Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# TextEditor::TextEditorSettings|
source: Links that follow symbol under cursor.
de: Links, die Symbol unter dem Cursor folgen.
es: Los enlaces que siguen símbolo bajo el cursor.
fr: Liens qui suivent le symbole sous le curseur.

# TextEditor::TextEditorSettings|
source: Selection
de: Auswahl
es: Selección
fr: Sélection

# TextEditor::TextEditorSettings|
source: Selected text.
de: Ausgewählter Text.
es: El texto seleccionado.
fr: Texte sélectionné.

# TextEditor::TextEditorSettings|
source: Line Number
de: Zeilennummer
es: Número de línea
fr: Numéro de ligne

# TextEditor::TextEditorSettings|
source: Line numbers located on the left side of the editor.
de: Zeilennummern auf der linken Seite des Editors befinden.
es: Los números de línea situados en el lado izquierdo del editor.
fr: Les numéros de lignes situées sur le côté gauche de l'éditeur.

# TextEditor::TextEditorSettings|
source: Search Result
de: Suchergebnis
es: Resultado de la búsqueda
fr: Résultat de la recherche

# TextEditor::TextEditorSettings|
source: Highlighted search results inside the editor.
de: Hervorgehobene Suchergebnisse im Editor.
es: Resultados de búsqueda resaltados dentro del editor.
fr: Résultats de la recherche mis en évidence à l'intérieur de l'éditeur.

# TextEditor::TextEditorSettings|
source: Search Scope
de: Suchbereich
es: Ámbito de búsqueda
fr: Portée de la recherche

# TextEditor::TextEditorSettings|
source: Section where the pattern is searched in.
de: Wo das Muster in gesucht.
es: Sección donde el patrón se busca en.
fr: Section où le motif est recherché dans.

# TextEditor::TextEditorSettings|
source: Parentheses
de: Klammern
es: Los paréntesis
fr: Parenthèses

# TextEditor::TextEditorSettings|
source: Displayed when matching parentheses, square brackets or curly brackets are found.
de: Wird angezeigt, wenn von passenden Klammern sind eckige oder geschweifte Klammern gefunden.
es: Se muestra cuando juego paréntesis, corchetes o llaves se encuentran.
fr: Se affiche lorsque la correspondance des parenthèses, crochets ou accolades sont trouvés.

# TextEditor::TextEditorSettings|
source: Current Line
de: Aktuelle Zeile
es: Corriente de línea
fr: Courant de ligne

# TextEditor::TextEditorSettings|
source: Line where the cursor is placed in.
de: Zeile, in der sich der Cursor in platziert.
es: Línea donde el cursor se coloca en.
fr: Ligne où le curseur est placé dans.

# TextEditor::TextEditorSettings|
source: Current Line Number
de: Aktuelle Zeilennummer
es: Actual número de línea
fr: Nombre actuel de ligne

# TextEditor::TextEditorSettings|
source: Line number located on the left side of the editor where the cursor is placed in.
de: Zeilennummer auf der linken Seite des Editors, wo der Cursor in platziert entfernt.
es: Número de línea situada en el lado izquierdo del editor, donde el cursor se coloca en.
fr: Numéro de ligne situé sur le côté gauche de l'éditeur où le curseur est placé.

# TextEditor::TextEditorSettings|
source: Occurrences
de: Vorkommen
es: Ocurrencias
fr: Événements

# TextEditor::TextEditorSettings|
source: Occurrences of the symbol under the cursor. (Only the background will be applied.)
de: Auftretens des Symbols unter dem Cursor. (dh nur der Hintergrund angewendet werden.)
es: Ocurrencias del símbolo bajo el cursor. (El fondo será aplicado.)
fr: Occurrences du symbole sous le curseur. (Seul le fond sera appliquée.)

# TextEditor::TextEditorSettings|
source: Unused Occurrence
de: Ungenutzte Vorkommen
es: Ocurrencia Unused
fr: Présence utilisé

# TextEditor::TextEditorSettings|
source: Occurrences of unused variables.
de: Vorkommen von nicht verwendeten Variablen.
es: Ocurrencias de las variables utilizadas.
fr: Occurrences de variables inutilisées.

# TextEditor::TextEditorSettings|
source: Renaming Occurrence
de: Umbenennen Vorkommen
es: Ocurrencia Cambio de nombre
fr: Présence Renommer

# TextEditor::TextEditorSettings|
source: Occurrences of a symbol that will be renamed.
de: Vorkommen eines Symbols, das umbenannt werden soll.
es: Ocurrencias de un símbolo que pasará a llamarse.
fr: Occurrences d'un symbole qui sera renommé.

# TextEditor::TextEditorSettings|
source: Number
de: Anzahl
es: Número
fr: Nombre

# TextEditor::TextEditorSettings|
source: Number literal.
de: Anzahl wörtliche.
es: Número literal.
fr: Nombre littérale.

# TextEditor::TextEditorSettings|
source: String
de: Schnur
es: Cadena
fr: Chaîne

# TextEditor::TextEditorSettings|
source: Character and string literals.
de: Charakter und Zeichenfolgenliterale.
es: Carácter y literales de cadena.
fr: Caractère et littéraux de chaîne.

# TextEditor::TextEditorSettings|
source: Name of a type.
de: Benennen eines Typs.
es: Nombre de un tipo.
fr: Nom d'un type.

# TextEditor::TextEditorSettings|
source: Local variables.
de: Lokale Variablen.
es: Las variables locales.
fr: Les variables locales.

# TextEditor::TextEditorSettings|
source: Field
de: Bereich
es: Campo
fr: Domaine

# TextEditor::TextEditorSettings|
source: Class' data members.
de: Klasse' Datenelemente.
es: Miembros de datos de clase '.
fr: Les membres de données de classe.

# TextEditor::TextEditorSettings|
source: Enumeration
de: Aufzählung
es: Enumeración
fr: Énumération

# TextEditor::TextEditorSettings|
source: Applied to enumeration items.
de: Um Aufzählung Elemente angewendet.
es: Aplicado a los elementos de la enumeración.
fr: Appliqué à des éléments d'énumération.

# TextEditor::TextEditorSettings|
source: Function
de: Funktion
es: Función
fr: Fonction

# TextEditor::TextEditorSettings|
source: Name of a function.
de: Name einer Funktion.
es: Nombre de una función.
fr: Nom d'une fonction.

# TextEditor::TextEditorSettings|
source: Virtual Function
es: Función virtual
fr: Fonction virtuelle

# TextEditor::TextEditorSettings|
source: Name of function declared as virtual.
de: Name der Funktion deklariert als virtuelle.
es: Nombre de la función declarada como virtual.
fr: Nom de la fonction déclarée comme virtuel.

# TextEditor::TextEditorSettings|
source: QML Binding
es: QML Encuadernación
fr: QML Reliure

# TextEditor::TextEditorSettings|
source: QML item property, that allows a binding to another property.
de: QML Elementeigenschaft, die eine Bindung an eine andere Eigenschaft ermöglicht.
es: Propiedad del elemento QML, que permite una unión a otra propiedad.
fr: QML propriété d'élément, qui permet une liaison vers une autre propriété.

# TextEditor::TextEditorSettings|
source: QML Local Id
de: QML Lokale ID
es: QML Id Local
fr: QML locale Id

# TextEditor::TextEditorSettings|
source: QML item id within a QML file.
de: QML Artikel-ID innerhalb einer QML-Datei.
es: QML Identificación del artículo dentro de un archivo QML.
fr: QML élément id dans un fichier QML.

# TextEditor::TextEditorSettings|
source: QML Root Object Property
de: QML Stamm-Objekt-Eigenschaft
es: QML Root Object Propiedad
fr: QML racine Object

# TextEditor::TextEditorSettings|
source: QML property of a parent item.
de: QML Eigenschaft einer übergeordneten Artikel.
es: QML propiedad de un elemento padre.
fr: QML propriété d'un élément parent.

# TextEditor::TextEditorSettings|
source: QML Scope Object Property
de: QML Scope Objekt Eigenschaft
es: QML Alcance Objeto Propiedad
fr: QML Portée Object

# TextEditor::TextEditorSettings|
source: Property of the same QML item.
de: Eigentum von derselben QML Artikel.
es: Propiedad del mismo artículo QML.
fr: Propriété de la même élément QML.

# TextEditor::TextEditorSettings|
source: QML State Name
de: QML Staats Name
es: Nombre QML Estado
fr: Nom QML État

# TextEditor::TextEditorSettings|
source: Name of a QML state.
de: Benennen eines QML Zustand.
es: Nombre de un estado QML.
fr: Nom d'un État QML.

# TextEditor::TextEditorSettings|
source: QML Type Name
de: QML Typ Name
es: Tipo QML Nombre
fr: Type de QML Nom

# TextEditor::TextEditorSettings|
source: Name of a QML type.
de: Benennen eines QML-Typ.
es: Nombre de un tipo QML.
fr: Nom d'un type QML.

# TextEditor::TextEditorSettings|
source: QML External Id
de: QML Externe Id
es: QML ID externo
fr: QML Id externe

# TextEditor::TextEditorSettings|
source: QML id defined in another QML file.
de: QML-ID in einem anderen QML-Datei definiert.
es: Identificación del QML definido en otro archivo QML.
fr: QML id défini dans un autre fichier QML.

# TextEditor::TextEditorSettings|
source: QML External Object Property
de: QML Externe Objekteigenschaften
es: QML externa del inmueble objeto
fr: QML externe propriété de l'objet

# TextEditor::TextEditorSettings|
source: QML property defined in another QML file.
de: QML-Immobilie in einem anderen QML-Datei definiert.
es: Propiedad QML definido en otro archivo QML.
fr: QML propriété définie dans un autre fichier QML.

# TextEditor::TextEditorSettings|
source: JavaScript Scope Var
es: JavaScript Alcance Var
fr: JavaScript Portée Var

# TextEditor::TextEditorSettings|
source: Variables defined inside the JavaScript file.
de: Variablen in der JavaScript-Datei definiert.
es: Las variables definidas en el archivo JavaScript.
fr: Les variables définies dans le fichier JavaScript.

# TextEditor::TextEditorSettings|
source: JavaScript Import
es: JavaScript Importación
fr: JavaScript importation

# TextEditor::TextEditorSettings|
source: Name of a JavaScript import inside a QML file.
de: Name einer JavaScript Import in eine QML-Datei.
es: Nombre de una importación de JavaScript dentro de un archivo QML.
fr: Nom d'une importation JavaScript dans un fichier QML.

# TextEditor::TextEditorSettings|
source: JavaScript Global Variable
de: JavaScript Globale Variable
es: Variable JavaScript Global
fr: Variable JavaScript mondial

# TextEditor::TextEditorSettings|
source: Variables defined outside the script.
de: Variablen außerhalb des Skripts definiert.
es: Las variables definidas fuera del guión.
fr: Les variables définies en dehors du script.

# TextEditor::TextEditorSettings|
source: Keyword
de: Schlüsselwort
es: Palabra clave
fr: Mots-clés

# TextEditor::TextEditorSettings|
source: Reserved keywords of the programming language.
de: Reservierte Schlüsselwörter der Programmiersprache.
es: Las palabras reservadas del lenguaje de programación.
fr: Mots-clés réservés du langage de programmation.

# TextEditor::TextEditorSettings|
source: Operator
de: Betreiber
es: Operador
fr: Opérateur

# TextEditor::TextEditorSettings|
source: Operators (for example operator++ or operator-=).
de: Operatoren (zB operator ++ oder betreiber =).
es: Los operadores (por ejemplo operador ++ o del operador =).
fr: Opérateurs (par exemple l'opérateur ++ ou d'un opérateur =).

# TextEditor::TextEditorSettings|
source: Preprocessor
fr: Préprocesseur

# TextEditor::TextEditorSettings|
source: Preprocessor directives.
de: Präprozessordirektiven.
es: Directivas del preprocesador.
fr: Directives préprocesseur.

# TextEditor::TextEditorSettings|
source: Label
de: Beschriftung
es: Etiqueta
fr: Étiquette

# TextEditor::TextEditorSettings|
source: Labels for goto statements.
de: Etiketten für goto-Anweisungen.
es: Las etiquetas de las sentencias goto.
fr: Etiquettes pour instructions goto.

# TextEditor::TextEditorSettings|
source: Comment
de: Kommentar
es: Comentario
fr: Commentaire

# TextEditor::TextEditorSettings|
source: All style of comments except Doxygen comments.
de: Alle Stil der Kommentare außer Doxygen Kommentare.
es: Todo el estilo de los comentarios, excepto los comentarios Doxygen.
fr: Tout style de commentaires, à l'exception commentaires Doxygen.

# TextEditor::TextEditorSettings|
source: Doxygen Comment
de: Doxygen Kommentar
es: Doxygen comentario
fr: Doxygen Commentaire

# TextEditor::TextEditorSettings|
source: Doxygen comments.
de: Doxygen Kommentare.
es: Comentarios Doxygen.
fr: Doxygen commentaires.

# TextEditor::TextEditorSettings|
source: Doxygen tags.
es: Etiquetas Doxygen.
fr: balises Doxygen.

# TextEditor::TextEditorSettings|
source: Visual Whitespace
de: Visuelle Leer
es: El espacio en blanco Visual
fr: Les espaces visuelle

# TextEditor::TextEditorSettings|
source: Whitespace. Will not be applied to whitespace in comments and strings.
de: Whitespace. wird nicht angewendet werden, um in Kommentaren und Zeichenfolgen Leerzeichen.
es: Los espacios en blanco. Se no se aplicará a los espacios en blanco en los comentarios y cadenas.
fr: Les espaces. Reconnexion pas être appliquée aux espaces dans les commentaires et les cordes.

# TextEditor::TextEditorSettings|
source: Disabled Code
es: Código de movilidad reducida
fr: Code de handicapés

# TextEditor::TextEditorSettings|
source: Code disabled by preprocessor directives.
de: Code Präprozessordirektiven deaktiviert.
es: Código desactivado por las directivas de preprocesador.
fr: Code désactivée par les directives de préprocesseur.

# TextEditor::TextEditorSettings|
source: Added Line
de: Added Linie
es: Línea Agregado
fr: Ajouté Ligne

# TextEditor::TextEditorSettings|
source: Applied to added lines in differences (in diff editor).
de: Hinzugefügt Leitungen angelegt in Unterschiede (im diff-Editor).
es: Aplicado a las líneas añadidas en diferencias (en el editor dif).
fr: Appliquée à des lignées ajoutés dans les différences (dans l'éditeur de diff).

# TextEditor::TextEditorSettings|
source: Removed Line
de: Entfernt Linie
es: Línea Eliminado
fr: Ligne retiré

# TextEditor::TextEditorSettings|
source: Applied to removed lines in differences (in diff editor).
de: Entfernt Leitungen angelegt in Unterschiede (im diff-Editor).
es: Aplicado a las líneas eliminadas en diferencias (en el editor dif).
fr: Appliquée à des lignées retirés des différences (dans l'éditeur de diff).

# TextEditor::TextEditorSettings|
source: Diff File
de: Diff-Datei
es: Archivo Dif
fr: Fichier Diff

# TextEditor::TextEditorSettings|
source: Compared files (in diff editor).
de: Im Vergleich von Dateien (in diff-Editor).
es: Archivos comparados (en editor diff).
fr: Fichiers comparés (dans l'éditeur diff).

# TextEditor::TextEditorSettings|
source: Diff Location
de: Diff Ort
es: Dif Ubicación
fr: Diff Localisation

# TextEditor::TextEditorSettings|
source: Location in the files where the difference is (in diff editor).
de: Lage in den Dateien, in denen der Unterschied (in diff-Editor).
es: Ubicación de los archivos donde la diferencia es (en el editor dif).
fr: Situation dans les fichiers où la différence est (dans l'éditeur de diff).

# TextEditor::TextEditorSettings|
source: Diff File Line
de: Diff Datei-Linie
es: Line Archivo Dif
fr: Diff Fichier Ligne

# TextEditor::TextEditorSettings|
source: Applied to lines with file information in differences (in side-by-side diff editor).
de: Linien mit Dateiinformationen angewendet in Unterschiede (im Side-by-Side-diff-Editor).
es: Aplicado a las líneas con la información de archivo de diferencias (en el editor diff lado a lado).
fr: Appliquée à des lignées avec les informations du fichier des différences (en side-by-side éditeur de diff).

# TextEditor::TextEditorSettings|
source: Diff Context Line
de: Diff Kontext Linie
es: Línea Contexto Dif
fr: Diff Contexte Ligne

# TextEditor::TextEditorSettings|
source: Applied to lines describing hidden context in differences (in side-by-side diff editor).
de: Linien beschreiben versteckten Kontext Unterschiede (im Side-by-side-Editor diff) angewendet.
es: Aplicado a líneas que describen contexto oculto en diferencias (en el editor diff lado a lado).
fr: Appliquée à des lignées décrivant contexte caché dans les différences (en side-by-side éditeur de diff).

# TextEditor::TextEditorSettings|
source: Diff Source Line
de: Diff Quelle Leitung
es: Línea Fuente Dif
fr: Diff Source Ligne

# TextEditor::TextEditorSettings|
source: Applied to source lines with changes in differences (in side-by-side diff editor).
de: Mit Änderungen der Differenzen (in einer Seite-an-Seite-diff Editor), um Quellenleitungen angelegt.
es: Aplicado a las líneas de código con los cambios en las diferencias (en editor diff lado a lado).
fr: Appliqué aux lignes de source et les variations de différences (en côte-à-côte éditeur diff).

# TextEditor::TextEditorSettings|
source: Diff Source Character
de: Diff Quelle Charakter
es: Dif Fuente Carácter
fr: Caractère Diff Source

# TextEditor::TextEditorSettings|
source: Applied to removed characters in differences (in side-by-side diff editor).
de: Entfernt Zeichen angewendet in Unterschiede (im Side-by-Side-diff-Editor).
es: Aplicado a los personajes que retiró en diferencias (en el editor diff lado a lado).
fr: Appliqué à caractères supprimés dans les différences (en side-by-side éditeur de diff).

# TextEditor::TextEditorSettings|
source: Diff Destination Line
de: Diff Ziellinie
es: Línea Destino Dif
fr: Diff Destinations Ligne

# TextEditor::TextEditorSettings|
source: Applied to destination lines with changes in differences (in side-by-side diff editor).
de: Mit Änderungen der Differenzen (in einer Seite-an-Seite-diff Editor), um Zielleitungen angelegt.
es: Aplicadas a las líneas de destino con los cambios en las diferencias (en editor diff lado a lado).
fr: Appliqué à la destination avec les lignes de l'évolution des différences (en côte-à-côte éditeur diff).

# TextEditor::TextEditorSettings|
source: Diff Destination Character
de: Diff Zielzeichen
es: Dif Destino Carácter
fr: Destinations Diff Caractère

# TextEditor::TextEditorSettings|
source: Applied to added characters in differences (in side-by-side diff editor).
de: Hinzugefügt Zeichen angewendet in Unterschiede (im Side-by-Side-diff-Editor).
es: Aplicado a los personajes añadidos en diferencias (en el editor diff lado a lado).
fr: Appliqué à caractères ajoutés aux différences (en side-by-side éditeur de diff).

# TextEditor::TextEditorSettings|
source: Behavior
de: Verhalten
es: Comportamiento
fr: Comportement

# TextEditor::TextEditorSettings|
source: Display
de: Anzeige
es: Visualización
fr: Exposition

# Utils::BaseTreeView|
source: Adjust Column Widths to Contents
de: Stellen Sie Spaltenbreite zum Inhalts
es: Ajustar ancho de columna a Contenido
fr: Ajuster largeur des colonnes au sommaire

# Utils::CheckableMessageBox|
source: Do not ask again
de: Nicht mehr fragen
es: No volver a preguntar
fr: Ne demandez pas à nouveau

# Utils::CheckableMessageBox|
source: Do not &ask again
de: Nicht erneut fragen &
es: No y pedir de nuevo
fr: Ne demandez pas à nouveau &

# Utils::ClassNameValidatingLineEdit|
source: The class name must not contain namespace delimiters.
de: Der Klassenname darf keine Namensraum-Trennzeichen.
es: El nombre de la clase no debe contener delimitadores de espacio de nombres.
fr: Le nom de la classe ne doit pas contenir des séparateurs d'espace de noms.

# Utils::ClassNameValidatingLineEdit|
source: Please enter a class name.
de: Bitte geben Sie einen Klassennamen.
es: Por favor ingrese un nombre de clase.
fr: Se il vous plaît entrer un nom de classe.

# Utils::ClassNameValidatingLineEdit|
source: The class name contains invalid characters.
de: Der Klassenname enthält ungültige Zeichen.
es: El nombre de la clase contiene caracteres no válidos.
fr: Le nom de la classe contient des caractères non valides.

# Utils::ConsoleProcess|
source: Cannot set up communication channel: %1
de: Kann nicht eingerichtet werden Kommunikationskanal:%1
es: No se puede configurar canal de comunicación:%1
fr: Impossible de configurer canal de communication: %1

# Utils::ConsoleProcess|
source: Press <RETURN> to close this window...
de: Drücken Sie <RETURN> dieses Fenster zu schliessen ...
es: Presione <INTRO> para cerrar esta ventana ...
fr: Appuyez sur <RETURN> pour fermer cette fenêtre ...

# Utils::ConsoleProcess|
source: Cannot create temporary file: %1
de: Kann nicht erstellt temporäre Datei:%1
es: No se puede crear el archivo temporal:%1
fr: Vous ne pouvez pas créer un fichier temporaire: %1

# Utils::ConsoleProcess|
source: Cannot write temporary file. Disk full?
de: Kann nicht geschrieben werden temporäre Datei. Festplatte voll?
es: No se puede escribir el archivo temporal. Disco lleno?
fr: Vous ne pouvez pas écrire le fichier temporaire. Disque plein?

# Utils::ConsoleProcess|
source: Cannot create temporary directory '%1': %2
de: Kann nicht erstellt temporäre Verzeichnis '%1':%2
es: No se puede crear directorio temporal '%1':%2
fr: Vous ne pouvez pas créer un répertoire temporaire '%1': %2

# Utils::ConsoleProcess|
source: Unexpected output from helper program (%1).
de: Unerwartete Ausgabe von Hilfsprogramm (%1).
es: Salida inesperada del programa de ayuda (%1).
fr: Sortie inattendue du programme d'aide (de %1).

# Utils::ConsoleProcess|
source: Cannot change to working directory '%1': %2
de: Kann nicht auf Arbeitsverzeichnis '%1' zu ändern:%2
es: No se puede cambiar al directorio de trabajo '%1':%2
fr: Vous ne pouvez pas changer le répertoire de travail '%1': %2

# Utils::ConsoleProcess|
source: Cannot execute '%1': %2
de: Kann nicht ausgeführt werden '%1':%2
es: No se puede ejecutar '%1':%2
fr: Vous ne pouvez pas exécuter%1:%2

# Utils::ConsoleProcess|
source: Quoting error in command.
de: Quoting Fehler im Befehl.
es: Error Citando al mando.
fr: Citant erreur dans la commande.

# Utils::ConsoleProcess|
source: Debugging complex shell commands in a terminal is currently not supported.
de: Debuggen komplexer Shell-Befehle in einem Terminal wird derzeit nicht unterstützt.
es: Depuración de comandos de shell complejos en un terminal no es compatible actualmente.
fr: Débogage des commandes shell complexes dans un terminal ne est pas supporté.

# Utils::ConsoleProcess|
source: Quoting error in terminal command.
de: Quoting Fehler im Terminal-Befehl.
es: Citando error en comando de terminal.
fr: Citant erreur dans la commande terminal.

# Utils::ConsoleProcess|
source: Terminal command may not be a shell command.
de: Terminal-Befehl kann nicht eine Shell-Befehl sein.
es: Comando terminal no puede ser un comando de shell.
fr: Commande de terminal peut ne pas être une commande shell.

# Utils::ConsoleProcess|
source: Cannot start the terminal emulator '%1', change the setting in the Environment options.
de: Können die Terminal-Emulator '%1' nicht starten können, ändern Sie die Einstellung in den Umgebungsoptionen.
es: No se puede iniciar el emulador de terminal '%1', cambie el ajuste en las opciones de entorno.
fr: Impossible de démarrer l'émulateur de terminal '%1', modifier le paramètre dans les options d'environnement.

# Utils::ConsoleProcess|
source: Cannot create socket '%1': %2
de: Kann nicht erzeugt werden '%1':%2
es: No se puede crear%1:%2
fr: Vous ne pouvez pas créer le socket '%1': %2

# Utils::ConsoleProcess|
source: The process '%1' could not be started: %2
de: Der Prozess '%1' konnte nicht gestartet werden:%2
es: El proceso de '%1' no pudo iniciar:%2
fr: Le processus '%1' n'a pas pu être démarré:%2

# Utils::ConsoleProcess|
source: Cannot obtain a handle to the inferior: %1
de: Kann nicht erhalten ein Handle für das minderwertige:%1
es: No se puede obtener un identificador para el inferior: %1
fr: Vous ne pouvez pas obtenir une poignée pour l'inférieur: %1

# Utils::ConsoleProcess|
source: Cannot obtain exit status from inferior: %1
de: Kann Exit-Status nicht gestattet, aus minderwertigen:%1
es: No se puede obtener la condición de salida de inferior: %1
fr: Vous ne pouvez pas obtenir le statut de sortie de inférieure: %1

# Utils::DetailsButton|
source: Details
de: Einzelheiten
es: Detalles
fr: Détails

# Utils::ElfReader|
source: '%1' is an invalid ELF object (%2)
de: '%1' ist keine gültige ELF-Objekt (%2)
es: '%1' es un objeto ELF no válido (%2)
fr: '%1' est un objet ELF invalide (%2)

# Utils::ElfReader|
source: '%1' is not an ELF object (file too small)
de: '%1' ist nicht ein ELF Objekt (Datei zu klein)
es: '%1' no es un objeto ELF (archivo demasiado pequeño)
fr: '%1' ne est pas un objet ELF (fichier trop petit)
