Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# TextEditor::Internal::Manager|
source: Error downloading selected definition(s).
de: Fehler beim Herunterladen der gewählten Definition (en).
es: Error al descargar definición seleccionada (s).
fr: Erreur de téléchargement définition sélectionnée (s).

# TextEditor::Internal::Manager|
source: Error downloading one or more definitions.
de: Fehler beim Herunterladen einer oder mehrerer Definitionen.
es: Error al descargar una o más definiciones.
fr: Erreur de téléchargement une ou plusieurs définitions.

# TextEditor::Internal::Manager|
source: Please check the directory's access rights.
de: Bitte überprüfen Sie die Zugriffsrechte des Verzeichnisses.
es: Por favor, consulte los derechos de acceso del directorio.
fr: Se il vous plaît vérifier les droits d'accès de l'annuaire.

# TextEditor::Internal::Manager|
source: Download Error
de: Download-Fehler
es: Error de descarga
fr: Erreur de téléchargement

# TextEditor::Internal::PlainTextEditorFactory|
source: A highlight definition was not found for this file. Would you like to try to find one?
de: Ein Höhepunkt Definition wurde für diese Datei nicht gefunden. Möchten Sie versuchen, einen zu finden?
es: Una definición más destacado no se ha encontrado para este archivo. Te gustaría tratar de encontrar uno?
fr: Une définition de clou n'a pas été trouvé pour ce fichier. Voulez-vous essayer de trouver un?

# TextEditor::Internal::PlainTextEditorFactory|
source: Show Highlighter Options...
de: Zeigen Highlighter Optionen ...
es: Mostrar Opciones resaltador ...
fr: Afficher les options surligneur ...

# TextEditor::Internal::PlainTextSnippetProvider|
source: Text
es: Texto
fr: Texte

# TextEditor::Internal::SnippetsCollection|
source: Cannot create user snippet directory %1
de: Benutzer-Snippet-Verzeichnis%1 kann nicht erstellt werden
es: No se puede crear el directorio fragmento de usuario%1
fr: Impossible de créer répertoire extrait de l'utilisateur%1

# TextEditor::Internal::SnippetsSettingsPage|
source: Form
es: Forma
fr: Forme

# TextEditor::Internal::SnippetsSettingsPage|
source: Group:
de: Gruppen:
es: Grupo:
fr: Groupe:

# TextEditor::Internal::SnippetsSettingsPage|
source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter

# TextEditor::Internal::SnippetsSettingsPage|
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer

# TextEditor::Internal::SnippetsSettingsPage|
source: Revert Built-in
de: Revert Eingebaute
es: Revertir incorporado
fr: Revenir intégré

# TextEditor::Internal::SnippetsSettingsPage|
source: Restore Removed Built-ins
de: Wiederherstellen entfernt Built-ins
es: Restaurar eliminados empotrados
fr: Restaurer-ins intégrés supprimés

# TextEditor::Internal::SnippetsSettingsPage|
source: Reset All
de: Alle zurücksetzen
es: Reiniciar todo
fr: Tout réinitialiser

# TextEditor::Internal::SnippetsSettingsPagePrivate|
source: Error While Saving Snippet Collection
de: Fehler beim Speichern Auszug Sammlung
es: Error al Colección Ahorro de fragmentos
fr: Erreur lors Collection Saving extraits

# TextEditor::Internal::SnippetsSettingsPagePrivate|
source: Error
de: Fehler
fr: Erreur

# TextEditor::Internal::SnippetsSettingsPagePrivate|
source: No snippet selected.
de: Kein Ausschnitt ausgewählt.
es: No fragmento seleccionado.
fr: Aucun extrait sélectionné.

# TextEditor::Internal::SnippetsTableModel|
source: Error
de: Fehler
fr: Erreur

# TextEditor::Internal::SnippetsTableModel|
source: Not a valid trigger.
de: Kein gültiger Trigger.
es: No es un disparo válido.
fr: Pas un déclenchement valide.

# TextEditor::Internal::SnippetsTableModel|
source: Trigger
de: Auslöser
es: Gatillo
fr: Gâchette

# TextEditor::Internal::SnippetsTableModel|
source: Error reverting snippet.
de: Fehlerrückgriff-Schnipsel.
es: Error revertir fragmento.
fr: Erreur revenir extrait.

# TextEditor::Internal::TabSettingsWidget|
source: Form
es: Forma
fr: Forme

# TextEditor::Internal::TabSettingsWidget|
source: Tabs And Indentation
de: Tabs und Einzüge
es: Pestañas y Sangría
fr: Onglets et l'indentation

# TextEditor::Internal::TabSettingsWidget|
source: Spaces Only
de: Nur Spaces
es: Sólo Espacios
fr: Seulement espaces

# TextEditor::Internal::TabSettingsWidget|
source: Tabs Only
de: Nur Tabs
es: Sólo Tabs
fr: Seulement Tabs

# TextEditor::Internal::TabSettingsWidget|
source: Mixed
de: Gemischt
es: Mixto
fr: Mixte

# TextEditor::Internal::TabSettingsWidget|
source: Ta&b size:
de: Ta & b Größe:
es: Ta & b tamaño:
fr: Ta & b taille:

# TextEditor::Internal::TabSettingsWidget|
source: &Indent size:
es: Y tamaño de sangría:
fr: Et la taille tiret:

# TextEditor::Internal::TabSettingsWidget|
source: <html><head/><body> Influences the indentation of continuation lines. <ul> <li>Not At All: Do not align at all. Lines will only be indented to the current logical indentation depth. <pre> (tab)int i = foo(a, b (tab)c, d); </pre> </li> <li>With Spaces: Always use spaces for alignment, regardless of the other indentation settings. <pre> (tab)int i = foo(a, b (tab) c, d); </pre> </li> <li>With Regular Indent: Use tabs and/or spaces for alignment, as configured above. <pre> (tab)int i = foo(a, b (tab)(tab)(tab) c, d); </pre> </li> </ul></body></html>
de: <Html> <head /> <body> Influences den Einzug der Fortsetzungszeilen <ul> <li> In keinster Weise:. Überhaupt ausrichten nicht. Die Leitungen werden nur auf die aktuelle logische Eindringtiefe eingerückt werden <pre> (tab) int i = foo (a, b (tab) c, d). </pre> </li> <li> Mit Plätze:. Verwenden Sie immer Räume für die Ausrichtung, unabhängig von den anderen Einbuchtung Einstellungen <pre> (tab) int i = foo (a, b (tab) c, d); </pre> </li> <li> Mit Regelmäßige Einzug:. Verwenden Sie Tabs und / oder Räume für die Ausrichtung, wie oben konfiguriert <pre> (tab) int i = foo (a, b (Register) (Register) (Register), c, d); </pre> </li> </ul> </body> </html>
es: <Html> <head /> <body> Influences la sangría de las líneas de continuación <ul> <li> Nada de eso:. No alinee en absoluto. Líneas sólo serán sangradas a la profundidad actual sangría lógico <pre> (pestaña) int i = foo (a, b (pestaña) c, d);. </pre> </li> <li> Con Espacios:. Siempre use espacios para la alineación, independientemente de los demás valores de sangría <pre> (pestaña) int i = foo (a, b (pestaña) c, d); </pre> </li> <li> Con sangría regular:. Use las pestañas y / o espacios para la alineación, como se ha configurado anteriormente <pre> (pestaña) int i = foo (a, b (pestaña) (pestaña) (pestaña) c, d); </pre> </li> </ul> </body> </html>
fr: <Html> <head /> <body> Influences l'indentation des lignes de continuation <ul> <li> Pas du tout:. Ne pas aligner du tout. Lignes ne seront en retrait à la profondeur actuelle de indentation logique <pre> (onglet) int i = foo (a, b (onglet) c, d);. </pre> </li> <li> avec des espaces:. Toujours utiliser des espaces pour l'alignement, quels que soient les autres paramètres d'indentation <pre> (onglet) int i = foo (a, b (onglet) c, d); </pre> </li> <li> Avec le retrait régulier:. Utilisez onglets et / ou des espaces pour l'alignement, tel que configuré ci-dessus <pre> (onglet) int i = foo (a, b (onglet) (onglet) (onglet) c, d); </pre> </li> </ul> </body> </html>

# TextEditor::Internal::TabSettingsWidget|
source: Not At All
de: Gar Nicht
es: De Ningún Modo
fr: Pas Du Tout

# TextEditor::Internal::TabSettingsWidget|
source: With Spaces
de: Mit Spaces
es: Con Espacios
fr: Avec Spaces

# TextEditor::Internal::TabSettingsWidget|
source: With Regular Indent
de: Mit regelmäßigen Einzug
es: Con Sangría Regular
fr: Avec le retrait régulier

# TextEditor::Internal::TabSettingsWidget|
source: Tab policy:
de: Tab Politik:
es: Política Ficha:
fr: politique de Tab:

# TextEditor::Internal::TabSettingsWidget|
source: Align continuation lines:
de: Richten Fortsetzungszeilen:
es: Alinear las líneas de continuación:
fr: Aligner les lignes de continuation:

# TextEditor::Internal::TabSettingsWidget|
source: The text editor indentation setting is used for non-code files only. See the C++ and Qt Quick coding style settings to configure indentation for code files.
de: Der Texteditor Einzug Einstellung ist nur für Nicht-Code-Dateien verwendet. Finden Sie in der C ++ und Qt Quick-Coding-Style Einstellungen Einzug für Code-Dateien zu konfigurieren.
es: El ajuste de sangría editor de texto se utiliza para archivos que no sean de código solamente. Ver el C ++ y Qt Quick ajustes de estilo de codificación para configurar sangría para archivos de código.
fr: Le réglage d'indentation de l'éditeur de texte est utilisé pour les fichiers non-code uniquement. Voir la C ++ et Qt Quick paramètres de style de codage pour configurer indentation pour les fichiers de code.

# TextEditor::Internal::TabSettingsWidget|
source: <i>Code indentation is configured in <a href="C++">C++</a> and <a href="QtQuick">Qt Quick</a> settings.</i>
de: <I>-Code Einzug in <a href="C++"> C ++ </a> und <a href="QtQuick"> Qt Schnell </a> Einstellungen konfiguriert. </I>
es: <I> sangría Código se configura en <a href="C++"> C ++ </a> y <a ajustes href="QtQuick"> Qt Quick </a>. </I>
fr: <I> l'indentation du code est configuré dans <a href="C++"> C ++ </a> et <a paramètres </a> href="QtQuick"> Qt Quick. </I>

# TextEditor::Internal::TextEditorPlugin|
source: General
fr: Général

# TextEditor::Internal::TextEditorPlugin|
source: Triggers a completion in this scope
de: Löst einen Abschluss in diesem Bereich
es: Desencadena una finalización en este ámbito
fr: Déclenche une fin dans ce périmètre

# TextEditor::Internal::TextEditorPlugin|
source: Ctrl+Space
de: Strg + Leertaste
es: Ctrl + Espacio
fr: Ctrl + Espace

# TextEditor::Internal::TextEditorPlugin|
source: Triggers a quick fix in this scope
de: Löst eine schnelle Lösung in diesem Rahmen
es: Desencadena una solución rápida en este ámbito
fr: Déclenche une solution rapide dans ce champ

# TextEditor::Internal::TextEditorPlugin|
source: Alt+Return
es: Alt + Retorno
fr: Alt + Entrée

# TextEditor::Internal::TextEditorPlugin|
source: Creates a scratch buffer using a temporary file.
de: Erstellt einen Scratch-Puffer mit einer temporären Datei.
es: Crea un búfer de cero utilizando un archivo temporal.
fr: Crée un tampon de zéro en utilisant un fichier temporaire.

# TextEditor::Internal::TextEditorPlugin|
source: Selected text within the current document.
de: Ausgewählter Text im aktuellen Dokument.
es: El texto seleccionado en el documento actual.
fr: Texte sélectionné dans le document courant.

# TextEditor::Internal::TextEditorPlugin|
source: Line number of the text cursor position in current document (starts with 1).
de: Zeilennummer der Textcursorposition im aktuellen Dokument (beginnt mit 1).
es: Número de línea de la posición del cursor de texto en el documento actual (comienza con 1).
fr: numéro de la position du curseur de texte dans le document courant de ligne (commence par 1).

# TextEditor::Internal::TextEditorPlugin|
source: Column number of the text cursor position in current document (starts with 0).
de: Spaltennummer der Textcursorposition im aktuellen Dokument (beginnt mit 0).
es: Número de columna de la posición del cursor de texto en el documento actual (comienza con 0).
fr: Numéro de colonne de la position du curseur de texte dans le document courant (commence à 0).

# TextEditor::Internal::TextEditorPlugin|
source: Number of lines visible in current document.
de: Anzahl der Zeilen im aktuellen Dokument sichtbar.
es: Número de líneas visibles en el documento actual.
fr: Nombre de lignes visibles dans le document actuel.

# TextEditor::Internal::TextEditorPlugin|
source: Number of columns visible in current document.
de: Anzahl der Spalten im aktuellen Dokument sichtbar.
es: Número de columnas visibles en el documento actual.
fr: Nombre de colonnes visibles dans le document actuel.

# TextEditor::Internal::TextEditorPlugin|
source: Current document's font size in points.
de: Schriftgröße aktuellen Dokuments in Punkt.
es: Tamaño de la fuente del documento actual en puntos.
fr: La taille de la police de document actuel en points.

# TextEditor::TextEditorActionHandler|
source: &Undo
de: & Rückgängig
es: Y deshacer
fr: & Annuler

# TextEditor::TextEditorActionHandler|
source: Shift+Del
es: Shift + Supr
fr: Maj + Suppr

# TextEditor::TextEditorActionHandler|
source: Copy &Line
de: Kopieren und Leitungs
fr: Copie & Line

# TextEditor::TextEditorActionHandler|
source: Delete &Line
de: Löschen und Leitungs
es: Eliminar & Line
fr: Supprimer & Line

# TextEditor::TextEditorActionHandler|
source: Delete Word from Cursor On
de: Wort Löschen Cursor auf
es: Eliminar Palabra de Cursor En
fr: Supprimer Word à partir du curseur Sur

# TextEditor::TextEditorActionHandler|
source: Delete Word Camel Case from Cursor On
de: Wort löschen Camel Fall von Cursor auf
es: Eliminar Caso Palabra Camel desde Cursor En
fr: Supprimer Parole Camel Case du curseur Sur

# TextEditor::TextEditorActionHandler|
source: Delete Word up to Cursor
de: Wort löschen Cursor bis zu
es: Eliminar Palabra hasta Cursor
fr: Supprimer Word up to Cursor

# TextEditor::TextEditorActionHandler|
source: Delete Word Camel Case up to Cursor
de: Wort löschen Camel Gehäuse bis zu Cursor
es: Eliminar Caso Palabra Camel hasta Cursor
fr: Supprimer Parole Camel Case jusqu'à curseur

# TextEditor::TextEditorActionHandler|
source: Go to Block Start with Selection
de: Zum Sperren Beginnen Sie mit Auswahl
es: Ir al inicio del bloqueo con la Selección
fr: Passez au Bloc Démarrer avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Block End with Selection
de: Zum Bausteinende mit Auswahl
es: Ir a Fin de bloque con la Selección
fr: Passez au Bloc Fin avec la sélection

# TextEditor::TextEditorActionHandler|
source: Move Line Up
de: Bewegen Line Up
es: Mueva Line Up
fr: Déplacez Line Up

# TextEditor::TextEditorActionHandler|
source: Ctrl+Shift+Up
es: Ctrl + Shift + Arriba
fr: Ctrl + Maj +

# TextEditor::TextEditorActionHandler|
source: Move Line Down
de: Bewegen Sie Zeile nach unten
es: Mueva la Línea de Down
fr: Déplacer la ligne vers le bas

# TextEditor::TextEditorActionHandler|
source: Ctrl+Shift+Down
de: Strg + Umschalt + Down
es: Ctrl + Shift + Abajo
fr: Ctrl + Maj + Bas

# TextEditor::TextEditorActionHandler|
source: Copy Line Up
de: Kopieren Line Up
es: Copia Line Up
fr: Copie Line Up

# TextEditor::TextEditorActionHandler|
source: Ctrl+Alt+Up
de: Strg + Alt + Up
es: Ctrl + Alt + Arriba
fr: Ctrl + Alt +

# TextEditor::TextEditorActionHandler|
source: Copy Line Down
de: Kopieren Zeile nach unten
es: Copiar línea de Down
fr: Copie ligne vers le bas

# TextEditor::TextEditorActionHandler|
source: Ctrl+Alt+Down
de: Strg + Alt + Pfeil nach unten
es: Ctrl + Alt + Abajo
fr: Ctrl + Alt + Bas

# TextEditor::TextEditorActionHandler|
source: Join Lines
de: Registriert Linien
es: Únete Líneas
fr: Rejoignez Lines

# TextEditor::TextEditorActionHandler|
source: Insert Line Above Current Line
de: Legen Sie zeichnen Sie über aktuelle Zeile
es: Inserte alinee sobre la línea actual
fr: Insérez Ligne dessus de la ligne actuelle

# TextEditor::TextEditorActionHandler|
source: Ctrl+Shift+Return
de: Strg + Umschalt + Return
es: Ctrl + Mayús + Retorno
fr: Ctrl + Maj + Entrée

# TextEditor::TextEditorActionHandler|
source: Insert Line Below Current Line
de: Legen Linie Unten Aktuelle Zeile
es: Inserte Línea por debajo de la línea actual
fr: Insérez la ligne en dessous du seuil actuel

# TextEditor::TextEditorActionHandler|
source: Ctrl+Return
de: Strg + Return
es: Ctrl + Retorno
fr: Ctrl + Retour

# TextEditor::TextEditorActionHandler|
source: Uppercase Selection
de: Groß Auswahl
es: Selección en mayúsculas
fr: Majuscules Sélection

# TextEditor::TextEditorActionHandler|
source: Meta+Shift+U
de: Meta + Umschalt + U
es: + Shift + U Meta
fr: + Maj + U Meta

# TextEditor::TextEditorActionHandler|
source: Alt+Shift+U
de: Alt + Umschalt + U
fr: Alt + Maj + U

# TextEditor::TextEditorActionHandler|
source: Lowercase Selection
de: Klein Auswahl
es: Selección Minúsculas
fr: Sélection minuscules

# TextEditor::TextEditorActionHandler|
source: Indent
de: Einzug
es: Muesca
fr: Tiret

# TextEditor::TextEditorActionHandler|
source: Unindent
fr: Désindenter

# TextEditor::TextEditorActionHandler|
source: Follow Symbol Under Cursor
de: Folgen Sie Symbol unter Cursor
es: Siga Símbolo bajo el cursor
fr: Suivez Symbole sous le curseur

# TextEditor::TextEditorActionHandler|
source: Follow Symbol Under Cursor in Next Split
de: Folgen Sie Symbol unter Cursor in nächste Split
es: Siga Símbolo bajo el cursor en el siguiente partido
fr: Suivez Symbole sous le curseur à Split Suivant

# TextEditor::TextEditorActionHandler|
source: Jump To File Under Cursor
de: Wechseln Um unter Cursor-Datei
es: Saltar a archivo bajo el cursor
fr: Aller dans un fichier sous le curseur

# TextEditor::TextEditorActionHandler|
source: Select Encoding...
de: Wählen Encoding ...
es: Seleccione Encoding ...
fr: Sélectionnez Codage ...

# TextEditor::TextEditorActionHandler|
source: Paste from Clipboard History
es: Pegar desde el Portapapeles de Historia
fr: Coller à partir du Presse-papiers Histoire

# TextEditor::TextEditorActionHandler|
source: Ctrl+Shift+V
de: Strg + Umschalt + V
fr: Ctrl + Maj + V

# TextEditor::TextEditorActionHandler|
source: Auto-&indent Selection
de: Auto- & Spiegelstrich Auswahl
es: Auto y Selección guión
fr: Auto- & Sélection tiret

# TextEditor::TextEditorActionHandler|
source: &Rewrap Paragraph
de: & Rewrap Absatz
es: Y vuelva a envolver el párrafo
fr: & RÉEMBALLAGE Paragraphe

# TextEditor::TextEditorActionHandler|
source: &Visualize Whitespace
de: & Visualisieren Leer
es: Visualizar y espacios en blanco
fr: & Visualiser Whitespace

# TextEditor::TextEditorActionHandler|
source: Clean Whitespace
de: Saubere Leer
es: El espacio en blanco Limpio
fr: Les espaces propres

# TextEditor::TextEditorActionHandler|
source: Enable Text &Wrapping
de: Aktivieren Text & Wrapping
es: Habilitar texto y Embalaje
fr: Activer texte & Emballage

# TextEditor::TextEditorActionHandler|
source: Toggle Comment &Selection
de: Toggle Kommentar & Selection
es: Alternar Comentario y Selección
fr: Basculer Commentaire & Selection

# TextEditor::TextEditorActionHandler|
source: Fold
de: Falten
es: Plegar
fr: Plier

# TextEditor::TextEditorActionHandler|
source: Unfold
de: Entfalten
es: Desplegar
fr: Déplier

# TextEditor::TextEditorActionHandler|
source: Toggle &Fold All
de: Schaltet & All Falten
es: Alternar & Fold Todo
fr: Basculer & Fold Tous

# TextEditor::TextEditorActionHandler|
source: Increase Font Size
de: Schriftgrad vergrößern
es: Aumentar tamaño de fuente
fr: Augmenter la taille

# TextEditor::TextEditorActionHandler|
source: Decrease Font Size
de: Schrift verkleinern
es: Disminuir tamaño de fuente
fr: Diminuer la taille

# TextEditor::TextEditorActionHandler|
source: Reset Font Size
de: Zurücksetzen Schriftgröße
es: Cambiar tamaño de fuente
fr: Réinitialiser la taille

# TextEditor::TextEditorActionHandler|
source: Go to Block Start
de: Zum Sperren starten
es: Ir al inicio del bloqueo
fr: Passez au Bloc Démarrer

# TextEditor::TextEditorActionHandler|
source: Go to Block End
de: Zum Endblock
es: Ir al Bloque End
fr: Passez au Bloc Fin

# TextEditor::TextEditorActionHandler|
source: Select Block Up
de: Wählen Sie Sperren Up
es: Seleccione Bloquear arriba
fr: Sélectionnez Bloquer Up

# TextEditor::TextEditorActionHandler|
source: Select Block Down
de: Wählen Sie Sperren unten
es: Seleccione Bloque de Down
fr: Sélectionnez Bloquer Bas

# TextEditor::TextEditorActionHandler|
source: Go to Line Start
de: Zum Zeilenanfang
es: Ir a la línea de salida
fr: Aller à la ligne Démarrer

# TextEditor::TextEditorActionHandler|
source: Go to Line End
de: Zum Zeilenende
es: Ir a la Final de línea
fr: Aller à la ligne Fin

# TextEditor::TextEditorActionHandler|
source: Go to Next Line
de: Gehe zur nächsten Zeile
es: Ir a la siguiente línea
fr: Aller à la ligne suivante

# TextEditor::TextEditorActionHandler|
source: Go to Previous Line
de: Gehe zur vorherigen Linie
es: Ir a la línea anterior
fr: Aller à la ligne précédente

# TextEditor::TextEditorActionHandler|
source: Go to Previous Character
de: Gehe zur vorherigen Zeichen
es: Ir a Carácter anterior
fr: Aller au caractère précédent

# TextEditor::TextEditorActionHandler|
source: Go to Next Character
de: Zum Nächstes Zeichen
es: Ir al siguiente personaje
fr: Aller au caractère suivant

# TextEditor::TextEditorActionHandler|
source: Go to Previous Word
de: Zum vorherigen Wort
es: Ir a la palabra anterior
fr: Aller au mot précédent

# TextEditor::TextEditorActionHandler|
source: Go to Next Word
de: Zum nächsten Wort
es: Ir a la siguiente palabra
fr: Aller au mot suivant

# TextEditor::TextEditorActionHandler|
source: Go to Previous Word Camel Case
de: Zum vorherigen Wort Camel Gehäuse
es: Ir a la anterior Caso Palabra Camel
fr: Aller au mot précédent Camel Case

# TextEditor::TextEditorActionHandler|
source: Go to Next Word Camel Case
de: Zum nächsten Wort Camel Gehäuse
es: Ir al Siguiente Caso Palabra Camel
fr: Aller à Suivant Camel Case Parole

# TextEditor::TextEditorActionHandler|
source: Go to Line Start with Selection
de: Zum Zeilenanfang mit Auswahl
es: Ir a la línea de salida con la Selección
fr: Aller à la ligne de démarrage avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Line End with Selection
de: Zum Zeilenende mit Auswahl
es: Ir a la línea final con la selección
fr: Aller à la ligne End avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Next Line with Selection
de: Gehe zur nächsten Zeile mit Auswahl
es: Ir a la siguiente línea con la Selección
fr: Aller à la ligne suivante avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Previous Line with Selection
de: Gehe zur vorherigen Linie mit Auswahl
es: Ir a la línea anterior con la Selección
fr: Aller à la ligne précédente avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Previous Character with Selection
de: Gehe zur vorherigen Zeichen mit Auswahl
es: Ir a Carácter anterior con la Selección
fr: Aller au caractère précédent avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Next Character with Selection
de: Zum Nächstes Zeichen mit Auswahl
es: Ir al siguiente personaje con la Selección
fr: Aller au caractère suivant avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Previous Word with Selection
de: Zum vorherigen Wort mit Auswahl
es: Ir a la palabra anterior con la Selección
fr: Aller au mot précédent avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Next Word with Selection
de: Zum nächsten Wort mit Auswahl
es: Ir a la siguiente palabra con la Selección
fr: Aller au mot suivant avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Previous Word Camel Case with Selection
de: Zum vorherigen Wort Kamel-Fall mit Auswahl
es: Ir a la sentencia de palabra anterior Camel con la Selección
fr: Aller au mot précédent Camel Case avec la sélection

# TextEditor::TextEditorActionHandler|
source: Go to Next Word Camel Case with Selection
de: Zum nächsten Wort Kamel-Fall mit Auswahl
es: Ir a la sentencia siguiente palabra Camel con la Selección
fr: Aller au mot suivant Camel Case avec la sélection

# TextEditor::TextEditorSettings|
source: Text
es: Texto
fr: Texte

# TextEditor::TextEditorSettings|
source: Generic text. Applied to text, if no other rules matching.
de: Generisches Text. Text Applied, wenn keine andere passende Regeln.
es: Texto genérico. Applied al texto, si no hay otra normativa correspondiente.
fr: Texte générique. Applied au texte, si aucune autre correspondance règles.

# TextEditor::TextEditorSettings|
source: Link
es: Enlace
fr: Lien
