Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# TextEditor::Internal::BehaviorSettingsWidget|
source: <html><head/><body> <p>How text editors should deal with UTF-8 Byte Order Marks. The options are:</p> <ul ><li><i>Add If Encoding Is UTF-8:</i> always add a BOM when saving a file in UTF-8 encoding. Note that this will not work if the encoding is <i>System</i>, as Qt Creator does not know what it actually is.</li> <li><i>Keep If Already Present: </i>save the file with a BOM if it already had one when it was loaded.</li> <li><i>Always Delete:</i> never write an UTF-8 BOM, possibly deleting a pre-existing one.</li></ul> <p>Note that UTF-8 BOMs are uncommon and treated incorrectly by some editors, so it usually makes little sense to add any.</p> <p>This setting does <b>not</b> influence the use of UTF-16 and UTF-32 BOMs.</p></body></html>
de: <Html> <head /> <body> <p> Wie Editoren sollten mit UTF-8-Byte Order Marks umzugehen. Die Optionen sind: </p> <ul> <li> <i> Add wenn die Kodierung UTF-8: </i> immer eine Stückliste beim Speichern einer Datei in UTF-8 hinzuzufügen. Beachten Sie, dass dies nicht funktionieren wird, wenn die Codierung ist <i> System </i>, wie Qt Creator nicht weiß, was es tatsächlich ist </li> <li> <i> zu halten, wenn bereits vorhanden. </I > Speichern Sie die Datei mit einem BOM, wenn es einem, wenn es geladen wurde bereits </li> <li> <i> Immer löschen:. </i> nie schreiben Sie eine UTF-8 BOM, möglicherweise das Löschen einer bereits bestehenden ein. </li> </ul> <p> Beachten Sie, dass UTF-8 Stücklisten sind selten und falsch von einigen Editoren behandelt, so macht es in der Regel keinen Sinn, jede. </p> <p> Dieses Add Einstellung tut <b> nicht </b> Einfluss auf die Verwendung von UTF-16 und UTF-32 Stücklisten. </p> </body> </html>
es: <Html> <head /> <body> <p> Como editores de texto deben lidiar con UTF-8 Byte Order Marcas. Las opciones son: </p> <ul> <li> <i> Agregar si codificación es UTF-8: </i> siempre agregar una lista de materiales al guardar un archivo en codificación UTF-8. Tenga en cuenta que esto no funcionará si la codificación es <i> Sistema </i>, como Qt Creator no sabe lo que realmente es </li> <li> <i> Solicitud de si ya está presente:. </I > guardar el archivo con una lista de materiales si ya tenía uno cuando se cargó </li> <li> <i> Borrar siempre:. </i> Nunca escribo una BOM UTF-8, posiblemente, la eliminación de un preexistente uno. </li> </ul> <p> Tenga en cuenta que UTF-8 listas de materiales son poco frecuentes y se tratan de forma incorrecta por algunos editores, por lo que por lo general no tiene mucho sentido para añadir cualquier. </p> <p> Este ajuste hace <b> no </b> influir en el uso de UTF-16 y UTF-32 listas de materiales. </p> </body> </html>
fr: <Html> <head /> <body> <p> Comment les éditeurs de texte doivent composer avec UTF-8 Byte Order Marks. Les options sont: </p> <ul> <li> <i> Ajouter Si encodage est UTF-8: </i> toujours ajouter une nomenclature lors de l'enregistrement d'un fichier en UTF-8 codage. Notez que cela ne fonctionne pas si l'encodage est <i> Système </i>, comme Qt Creator ne sais pas ce que ce est en fait </li> <li> <i> Gardez Si déjà présents:. </I > enregistrer le fichier avec une nomenclature se il avait déjà un quand il a été chargé </li> <li> <i> Toujours Supprimer:. </i> ne écris jamais une nomenclature UTF-8, éventuellement la suppression d'un pré-existante une. </li> </ul> <p> Notez que UTF-8 nomenclatures sont rares et traitées de manière incorrecte par certains éditeurs, il est donc généralement peu de sens d'ajouter tout. </p> <p> Cette paramètre ne <b> pas </b> influencer l'utilisation de UTF-16 et UTF-32 nomenclatures. </p> </body> </html>

# TextEditor::Internal::BehaviorSettingsWidget|
source: Add If Encoding Is UTF-8
de: Fügen wenn die Kodierung UTF-8
es: Añadir Si codificación es UTF-8
fr: Ajouter Si encodage est UTF-8

# TextEditor::Internal::BehaviorSettingsWidget|
source: Keep If Already Present
de: Halten Wenn bereits vorhanden
es: Mantenga si ya está presente
fr: Gardez Si déjà présent

# TextEditor::Internal::BehaviorSettingsWidget|
source: Always Delete
de: Immer löschen
es: Borrar siempre
fr: Toujours supprimer

# TextEditor::Internal::BehaviorSettingsWidget|
source: UTF-8 BOM:
es: BOM UTF-8:
fr: BOM UTF-8:

# TextEditor::Internal::BehaviorSettingsWidget|
source: Mouse and Keyboard
de: Maus und Tastatur
es: Ratón y teclado
fr: Souris et clavier

# TextEditor::Internal::BehaviorSettingsWidget|
source: Hide mouse cursor while typing
de: Ausblenden Mauszeiger während der Eingabe
es: Ocultar cursor del ratón mientras se escribe
fr: Cacher curseur de la souris tout en tapant

# TextEditor::Internal::BehaviorSettingsWidget|
source: Enable &mouse navigation
de: Aktivieren und Mausnavigation
es: Habilitar y navegación con el ratón
fr: Activer la navigation et de la souris

# TextEditor::Internal::BehaviorSettingsWidget|
source: Enable scroll &wheel zooming
de: Aktivieren Scroll Rad & Zoomen
es: Activar desplazamiento y zoom rueda
fr: Activer défilement et zoom roue

# TextEditor::Internal::BehaviorSettingsWidget|
source: Enable built-in camel case &navigation
de: Aktivieren integrierten Camelcase & Navigation
es: Activar incorporado en caso de camello y navegación
fr: Activer intégré chameau cas et navigation

# TextEditor::Internal::BehaviorSettingsWidget|
source: Pressing Alt displays context-sensitive help or type information as tooltips.
de: Drücken von Alt zeigt kontextbezogene Hilfe oder Typinformationen als Tooltip.
es: Al pulsar Alt muestra ayuda contextual o información de tipo como información sobre herramientas.
fr: En appuyant sur Alt affiche une aide contextuelle ou des informations de type que les info-bulles.

# TextEditor::Internal::BehaviorSettingsWidget|
source: Show help tooltips using keyboard shortcut (Alt)
de: Hilfe Quickinfos mit Tastenkombination (Alt)
es: Mostrar información sobre herramientas de ayuda utilizando atajo de teclado (Alt)
fr: Show Aide infobulles en utilisant le raccourci clavier (Alt)

# TextEditor::Internal::BehaviorSettingsWidget|
source: Show help tooltips using the mouse:
de: System Hilfe Tooltips mit der Maus:
es: Mostrar información sobre herramientas de ayuda utilizando el ratón:
fr: Show Aide infobulles aide de la souris:

# TextEditor::Internal::BehaviorSettingsWidget|
source: On Mouseover
es: En Mouseover
fr: Sur Mouseover

# TextEditor::Internal::BehaviorSettingsWidget|
source: On Shift+Mouseover
de: Am Shift + Mouseover
es: En Shift + Mouseover
fr: Le Maj + Mouseover

# TextEditor::Internal::CodeStyleDialog|
source: Edit Code Style
de: Code bearbeiten Stil
es: Editar estilo Código
fr: Modifier Style Code

# TextEditor::Internal::CodeStyleDialog|
source: Code style name:
de: Code Stil Name:
es: Nombre de estilo Código:
fr: nom du style de code:

# TextEditor::Internal::CodeStyleDialog|
source: You cannot save changes to a built-in code style. Copy it first to create your own version.
de: Sie können keine Änderungen an einem integrierten Code-Stil speichern. Kopieren Sie zunächst eine eigene Version erstellen.
es: No se puede guardar los cambios en un estilo de código incorporado. Copiarlo primero en crear su propia versión.
fr: Vous ne pouvez pas enregistrer les modifications à un style de code intégré. Copiez-le premier à créer votre propre version.

# TextEditor::Internal::CodeStyleDialog|
source: Copy Built-in Code Style
de: Kopieren integrierten Code-Stil
es: Copiar incorporado Código Estilo
fr: Copie Built-in Style Code

# TextEditor::Internal::CodeStyleDialog|
source: %1 (Copy)
de: %1 (Kopieren)
es: %1 (Copia)
fr: %1 (Copie)

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Form
es: Forma
fr: Forme

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Current settings:
de: Aktuelle Einstellungen:
es: Parámetros actuales:
fr: Paramètres actuels:

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Copy...
de: Kopieren ...
es: Copiar ...
fr: Copier ...

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Edit...
es: Editar ...
fr: Modifier ...

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Export...
es: Exportar ...
fr: Exporter ...

# TextEditor::Internal::CodeStyleSelectorWidget|
source: Import...
es: Importar ...
fr: Importer ...

# TextEditor::Internal::CodecSelector|
source: The following encodings are likely to fit:
de: Folgende Kodierungen sind wahrscheinlich passen:
es: Los siguientes codificaciones es probable que adaptarse:
fr: Les codages suivants sont susceptibles de correspondre:

# TextEditor::Internal::CodecSelector|
source: Select encoding for "%1".%2
de: Wählen Sie die Kodierung für "%1 ".%2
es: Seleccionar la codificación de "%1 ".%2
fr: Sélectionnez l'encodage pour "%1 ". %2

# TextEditor::Internal::CodecSelector|
source: Reload with Encoding
de: Seite neu laden mit Encoding
es: Actualizar con Codificación
fr: Recharger avec encodage

# TextEditor::Internal::CodecSelector|
source: Save with Encoding
de: Sparen Sie mit Encoding
es: Ahorre con Codificación
fr: Enregistrer avec codage

# TextEditor::Internal::ColorScheme|
source: Not a color scheme file.
de: Nicht ein Farbschema-Datei.
es: No es un archivo de esquema de color.
fr: Pas un fichier de jeu de couleurs.

# TextEditor::Internal::ColorSchemeEdit|
source: Foreground:
de: Vordergrund:
es: Primer plano:
fr: Premier plan:

# TextEditor::Internal::ColorSchemeEdit|
source: Erase foreground.
de: Löschen Vordergrund.
es: Erase primer plano.
fr: Effacer premier plan.

# TextEditor::Internal::ColorSchemeEdit|
source: Background:
de: Hintergrund:
es: Antecedentes:
fr: Contexte:

# TextEditor::Internal::ColorSchemeEdit|
source: Erase background.
de: Erase Hintergrund.
es: Borrar fondo.
fr: Effacer le fond.

# TextEditor::Internal::ColorSchemeEdit|
source: Bold
de: Fett
es: Audaz
fr: Audacieux

# TextEditor::Internal::ColorSchemeEdit|
source: Italic
de: Kursiv
es: Itálico
fr: Italique

# TextEditor::Internal::CompletionSettingsPage|
source: Behavior
de: Verhalten
es: Comportamiento
fr: Comportement

# TextEditor::Internal::CompletionSettingsPage|
source: &Case-sensitivity:
de: & Case-Empfindlichkeit:
es: Y Mayúsculas y minúsculas:
fr: & Case sensibilité:

# TextEditor::Internal::CompletionSettingsPage|
source: Full
de: Voll
es: Completo
fr: Plein

# TextEditor::Internal::CompletionSettingsPage|
source: None
de: Die Sonne Geht Auf
es: Ninguno
fr: Aucun

# TextEditor::Internal::CompletionSettingsPage|
source: First Letter
de: Anfangsbuchstabe
es: Primera Carta
fr: Première Lettre

# TextEditor::Internal::CompletionSettingsPage|
source: Activate completion:
de: Aktivieren Abschluss:
es: Activar finalización:
fr: Activer la fin:

# TextEditor::Internal::CompletionSettingsPage|
source: Manually
de: Manuell
es: A mano
fr: Manuellement

# TextEditor::Internal::CompletionSettingsPage|
source: When Triggered
de: Wenn ausgelöst
es: Cuando se dispara
fr: Lorsque Déclenché

# TextEditor::Internal::CompletionSettingsPage|
source: Always
de: Schon Immer
es: Siempre
fr: Toujours

# TextEditor::Internal::CompletionSettingsPage|
source: Inserts the common prefix of available completion items.
de: Fügt den gemeinsamen Präfix verfügbarer Fertigteile.
es: Inserta el prefijo común de los productos de terminación disponibles.
fr: Insère le préfixe commun d'articles disponibles d'achèvement.

# TextEditor::Internal::CompletionSettingsPage|
source: Autocomplete common &prefix
de: Autocomplete gemeinsamen Präfix &
es: Autocompletar común y prefijo
fr: Autocomplete commune préfixe &

# TextEditor::Internal::CompletionSettingsPage|
source: Automatically inserts semicolons and closing brackets, parentheses, curly braces, and quotes when appropriate.
de: Fügt automatisch ein Semikolon und schließenden Klammern, Klammern, geschweiften Klammern und Anführungszeichen, wenn angemessen.
es: Inserta automáticamente un punto y coma y los soportes de cierre, paréntesis, corchetes y comillas cuando sea apropiado.
fr: Insère automatiquement des points-virgules et parenthèses de fermeture, entre parenthèses, des accolades, et des citations, le cas échéant.

# TextEditor::Internal::CompletionSettingsPage|
source: &Automatically insert matching characters
de: & Einstimmenden Zeichen automatisch einfügen
es: Y insertar automáticamente caracteres coincidentes
fr: Et insérer automatiquement les caractères correspondant

# TextEditor::Internal::CompletionSettingsPage|
source: When typing a matching character and there is a text selection, instead of removing the selection, surrounds it with the corresponding characters.
de: Bei der Eingabe eines passenden Charakter und es gibt eine Textauswahl, anstatt sie zu entfernen Sie die Auswahl, umgibt sie mit den entsprechenden Zeichen.
es: Al escribir un carácter a juego y hay una selección de texto, en lugar de eliminar la selección, la rodea con los caracteres correspondientes.
fr: Lors de la saisie d'un caractère correspondant et il ya une sélection de texte, au lieu de supprimer la sélection, l'entoure avec les caractères correspondants.

# TextEditor::Internal::CompletionSettingsPage|
source: Surround &text selections
de: Surround & Textauswahl
es: Selecciones de sonido envolvente y de texto
fr: Surround et texte sélections

# TextEditor::Internal::CompletionSettingsPage|
source: Insert &space after function name
de: Legen & Leerzeichen nach Funktionsnamen
es: Inserte y espacio después de nombre de la función
fr: Insérez et l'espace après le nom de la fonction

# TextEditor::Internal::CompletionSettingsPage|
source: Documentation Comments
de: Dokumentationskommentare
es: Documentación Comentarios
fr: Documentation Commentaires

# TextEditor::Internal::CompletionSettingsPage|
source: Automatically creates a Doxygen comment upon pressing enter after a '/**', '/*!', '//!' or '///'.
de: Erstellt automatisch eine Doxygen Kommentar auf und drücken Sie nach einem '/ **', '/ *!', '//' oder '///'.
es: Crea automáticamente un comentario Doxygen al presionar enter después de un '/ **', '/ *', '//' o '///'.
fr: Crée automatiquement un commentaire sur Doxygen appuyant sur ENTRÉE après un '/ **', '/ *!', '//! ou '///'.

# TextEditor::Internal::CompletionSettingsPage|
source: Enable Doxygen blocks
de: Aktivieren Doxygen Blöcke
es: Habilitar Doxygen bloques
fr: Activer blocs Doxygen

# TextEditor::Internal::CompletionSettingsPage|
source: Generates a <i>brief</i> command with an initial description for the corresponding declaration.
de: Erzeugt eine <i> kurze </i> Befehl mit einer Beschreibung für die entsprechende Erklärung.
es: Genera un <i> breve </i> de comandos con una descripción inicial de la declaración correspondiente.
fr: Génère un <i> brève </i> commande avec une description initiale de la déclaration correspondante.

# TextEditor::Internal::CompletionSettingsPage|
source: Generate brief description
de: Generieren Sie Kurzbeschreibung
es: Generar breve descripción
fr: Générer brève description

# TextEditor::Internal::CompletionSettingsPage|
source: Adds leading asterisks when continuing Qt '/*!' and Java '/**' style comments on new lines.
de: Fügt führende Sternchen beim Fortsetzen Qt '/ *' und Java '/ **' Kommentare Stil auf neue Linien.
es: Agrega la asteriscos que conduce al continuar Qt '/ *! y '/ **' comentarios de estilo Java en nuevas líneas.
fr: Ajoute leader astérisques lors de la poursuite Qt '/ *! et Java '/ ** 'commentaires de style sur les nouvelles lignes.

# TextEditor::Internal::CompletionSettingsPage|
source: Add leading asterisks
de: In führenden Sternchen
es: Añadir asteriscos principales
fr: Ajouter principaux astérisques

# TextEditor::Internal::CompletionSettingsPage|
source: Completion
de: Abschluss
es: Terminación
fr: Achèvement

# TextEditor::Internal::CountingLabel|
source: %1 found
de: %1 gefunden
es: %1 encontrado
fr: %1 trouvé

# TextEditor::Internal::DisplaySettingsPage|
source: Text Wrapping
de: Textumbruch
es: Ajuste del texto
fr: Habillage du texte

# TextEditor::Internal::DisplaySettingsPage|
source: Enable text &wrapping
de: Text & Wickel aktivieren
es: Habilitar texto y envoltura
fr: Activer le texte et emballage

# TextEditor::Internal::DisplaySettingsPage|
source: Display right &margin at column:
de: Anzeige rechts & Marge in Spalte:
es: Mostrar derecha y margen en la columna:
fr: Afficher droit et la marge à la colonne:

# TextEditor::Internal::DisplaySettingsPage|
source: Display
de: Anzeige
es: Visualización
fr: Exposition

# TextEditor::Internal::DisplaySettingsPage|
source: &Highlight matching parentheses
de: & Markieren von passenden Klammern
es: Y Resaltar paréntesis, a juego
fr: & Sélectionnez parenthèses correspondant

# TextEditor::Internal::DisplaySettingsPage|
source: Mark &text changes
de: Mark & ​​Textänderungen
es: Marcar y texto cambia
fr: Marquer & texte changements

# TextEditor::Internal::DisplaySettingsPage|
source: Shows tabs and spaces.
de: Zeigt Tabulatoren und Leerzeichen.
es: Muestra tabulaciones y espacios.
fr: Affiche tabulations et des espaces.

# TextEditor::Internal::DisplaySettingsPage|
source: &Visualize whitespace
de: & Visualisieren Leerzeichen
es: Visualice y espacios en blanco
fr: Visualisez & espaces

# TextEditor::Internal::DisplaySettingsPage|
source: Highlight &blocks
de: Markieren und Blöcke
es: Reflejo y bloques
fr: Highlight & blocs

# TextEditor::Internal::DisplaySettingsPage|
source: Center &cursor on scroll
de: Center & Cursor auf Scroll-
es: Center & cursor sobre desplazamiento
fr: Center & curseur sur défilement

# TextEditor::Internal::DisplaySettingsPage|
source: Display &folding markers
de: Display & Faltung Marker
es: Exhibición y plegables marcadores
fr: Affichage et pliage marqueurs

# TextEditor::Internal::DisplaySettingsPage|
source: Highlight current &line
de: Strom & Linie markieren
es: Resaltar actual y la línea
fr: Mettez en surbrillance et actuelle ligne

# TextEditor::Internal::DisplaySettingsPage|
source: &Animate matching parentheses
de: & Animieren von passenden Klammern
es: Y Animate a juego paréntesis
fr: & Animation correspondant parenthèses

# TextEditor::Internal::DisplaySettingsPage|
source: Display line &numbers
de: Zeile & Zahlen
es: Display línea y números
fr: Ligne et numéros Affichage

# TextEditor::Internal::DisplaySettingsPage|
source: Auto-fold first &comment
de: Auto-fach ersten und Kommentar
es: Auto veces primero y comentario
fr: Auto première fois et commentaire

# TextEditor::Internal::DisplaySettingsPage|
source: Always open links in another split
de: Immer offen Links in einem anderen Split
es: Siempre enlaces abiertos en otra división
fr: Toujours ouvrir les liens dans un autre groupe

# TextEditor::Internal::DisplaySettingsPage|
source: Display file encoding
de: Display-Dateicodierung
es: Codificación de archivos de visualización
fr: encodage du fichier d'affichage

# TextEditor::Internal::FindInCurrentFile|
source: Current File
de: Aktuelle Datei
es: Archivo actual
fr: Fichier actuel

# TextEditor::Internal::FindInCurrentFile|
source: File '%1':
de: Datei '%1':
es: Archivo '%1':
fr: Le fichier '%1':

# TextEditor::Internal::FindInCurrentFile|
source: File path: %1 %2
de: Dateipfad:%1 %2
es: Ruta de archivo:%1 %2
fr: Chemin du fichier:%1 %2

# TextEditor::Internal::FindInOpenFiles|
source: Open Documents
de: Geöffnete Dokumente
es: Documentos Abiertos
fr: Documents ouverts

# TextEditor::Internal::FindInOpenFiles|
source: Open documents:
de: Offene Dokumente:
es: Abrir documentos:
fr: Les documents ouverts:

# TextEditor::Internal::FindInOpenFiles|
source: Open Documents %1
de: Geöffnete Dokumente %1
es: Abrir documentos %1
fr: Ouvert Documents %1

# TextEditor::Internal::FontSettings|
source: Customized
de: Kundenspezifische
es: Personalizado
fr: Personnalisé

# TextEditor::Internal::FontSettingsPage|
source: Font
de: Schrift
es: Fuente
fr: Fonte

# TextEditor::Internal::FontSettingsPage|
source: Family:
de: Familie:
es: Familia:
fr: Famille:

# TextEditor::Internal::FontSettingsPage|
source: Size:
de: Größe:
es: Tamaño:
fr: Taille:

# TextEditor::Internal::FontSettingsPage|
source: Copy...
de: Kopieren ...
es: Copiar ...
fr: Copier ...

# TextEditor::Internal::FontSettingsPage|
source: Delete
de: Löschen
es: Borrar
fr: Effacer

# TextEditor::Internal::HighlighterSettingsPage|
source: Form
es: Forma
fr: Forme

# TextEditor::Internal::HighlighterSettingsPage|
source: <html><head/><body> <p>Highlight definitions are provided by the <a href="http://kate-editor.org/">Kate Text Editor</a>.</p></body></html>
de: <Html> <head /> <body> <p> Highlight Definitionen werden von der <a href="http://kate-editor.org/"> Kate Text Editor </a> vorgesehen. </p> </body> </html>
es: <Html> <head /> <body> <p> Definiciones Resaltar son proporcionados por el <a href="http://kate-editor.org/"> Kate </a> Editor de texto. </p> </body> </html>
fr: <Html> <head /> <body> <p> Définitions Faits saillants sont fournis par le <a href="http://kate-editor.org/"> éditeur de texte Kate </a>. </p> </body> </html>

# TextEditor::Internal::HighlighterSettingsPage|
source: Syntax Highlight Definition Files
de: Syntax-Hervorhebungsdefinitionsdateien
es: Sintaxis Resalte archivos de definición
fr: Syntaxe Sélectionnez Fichiers de définition

# TextEditor::Internal::HighlighterSettingsPage|
source: Location:
de: Wohnort:
es: Ubicación:
fr: Localisation:

# TextEditor::Internal::HighlighterSettingsPage|
source: Use fallback location
de: Verwenden Sie Fallback-Position
es: Utilizar ubicación de repliegue
fr: Utiliser l'emplacement de repli

# TextEditor::Internal::HighlighterSettingsPage|
source: Behavior
de: Verhalten
es: Comportamiento
fr: Comportement

# TextEditor::Internal::HighlighterSettingsPage|
source: Ignored file patterns:
de: Ignoriert Dateimuster:
es: Patrones de ficheros ignorados:
fr: Modèles de fichiers ignorés:

# TextEditor::Internal::ManageDefinitionsDialog|
source: Dialog
es: Diálogo
fr: Dialogue

# TextEditor::Internal::ManageDefinitionsDialog|
source: Definitions
de: Begriffsbestimmungen
es: Definiciones
fr: Définitions

# TextEditor::Internal::ManageDefinitionsDialog|
source: Select All
de: Alle auswählen
es: Seleccionar todo
fr: Sélectionner tout

# TextEditor::Internal::ManageDefinitionsDialog|
source: Clear Selection
de: Auswahl löschen
es: Selección Borrar
fr: Effacer la sélection

# TextEditor::Internal::ManageDefinitionsDialog|
source: Invert Selection
de: Auswahl umkehren
es: Invertir selección
fr: Inverser la sélection

# TextEditor::Internal::ManageDefinitionsDialog|
source: Download Selected Definitions
de: Download markierte Definitionen
es: Descarga seleccionada Definiciones
fr: Télécharger Sélectionné Définitions

# TextEditor::Internal::ManageDefinitionsDialog|
source: Name
es: Nombre
fr: Nom

# TextEditor::Internal::ManageDefinitionsDialog|
source: Installed
de: Installierte
es: Instalado
fr: Installé

# TextEditor::Internal::ManageDefinitionsDialog|
source: Available
de: Zur Verfügung
es: Disponible
fr: Disponible

# TextEditor::Internal::ManageDefinitionsDialog|
source: Download Definitions
de: Herunterladen Definitionen
es: Descargue definiciones
fr: Télécharger Définitions

# TextEditor::Internal::ManageDefinitionsDialog|
source: Download Information
de: Informationen zum Download
es: Información de descarga
fr: Télécharger l'information

# TextEditor::Internal::ManageDefinitionsDialog|
source: There is already one download in progress. Please wait until it is finished.
de: Es läuft bereits ein Download. Bitte warten Sie, bis es fertig ist.
es: Ya hay una descarga en curso. Por favor, espere hasta que esté terminado.
fr: Il ya déjà un téléchargement en cours. Se il vous plaît attendre jusqu'à ce qu'il soit terminé.

# TextEditor::Internal::Manager|
source: Downloading definitions
de: Herunterladen von Definitionen
es: Descarga de definiciones
fr: Téléchargement définitions
