Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# Utils::TextFileFormat|
source: Out of memory.
de: Zu wenig Speicher.
es: Fuera de la memoria.

# Core::ICore|
source: Qt Creator %1%2
es: Creador Qt%1%2

# Core::Internal::FindDialog|
source: Sco&pe:
es: Sco y pe:

# Core::Internal::MainWindow|
source: &Tools
es: y herramientas

# ExtensionSystem::Internal::PluginDetailsView|
source: Version:
es: Versión:

# ExtensionSystem::PluginView|
source: Version
es: Versión

# JsEditorTools::JSEditorMenuItems|
source: Save A&ll
es: Guardar & todo

# JsEditorTools::JSEditorMenuItems|
source: &Redo
es: Y Rehacer

# TextEditor::HighlighterSettingsPage|
source: Autodetect
es: Detección automática

# TextEditor::Internal::CodecSelector|
source: Text Encoding
es: Codificación de texto

# TextEditor::Internal::TextEditorPlugin|
source: Meta+Space
es: Meta + Espacio

# TextEditor::TextEditorActionHandler|
source: &Redo
es: Y Rehacer

# TextEditor::TextEditorActionHandler|
source: Alt+U
es: Alt + T
