Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# QmlJSEditor::Internal::ComponentNameDialog|
source: Component name:
de: Komponentenname:
es: Nombre del componente:
fr: Nom du composant:

# QmlJSEditor::Internal::ComponentNameDialog|
source: Choose a path
de: Wählen Sie einen Pfad
es: Elegir un camino
fr: Choisissez un chemin

# QmlJSEditor::Internal::ComponentNameDialog|
source: Invalid component name
de: Ungültigen Komponentennamen
es: Nombre del componente no válido
fr: Invalid nom de composant

# QmlJSEditor::Internal::ComponentNameDialog|
source: Invalid path
de: Ungültiger Pfad
es: Ruta no válida
fr: Chemin non valide

# QmlJSEditor::Internal::HoverHandler|
source: Library at %1
de: Bibliothek in%1
es: Biblioteca en%1
fr: Bibliothèque à %1

# QmlJSEditor::Internal::HoverHandler|
source: Dumped plugins successfully.
de: Gedumpten Plugins erfolgreich.
es: Plugins objeto de dumping con éxito.
fr: Plugins sous-évaluées avec succès.

# QmlJSEditor::Internal::HoverHandler|
source: Read typeinfo files successfully.
de: Lesen Sie Typeinfo-Dateien erfolgreich.
es: Leer typeinfo archivos correctamente.
fr: Lire typeinfo fichiers avec succès.

# QmlJSEditor::Internal::Operation|
source: Wrap Component in Loader
de: Wickeln Komponente in Loader
es: Envuelva Componente en cargador
fr: Enveloppez composant dans Loader

# QmlJSEditor::Internal::Operation|
source: // TODO: Move position bindings from the component to the Loader. // Check all uses of 'parent' inside the root element of the component.
de: // TODO: Bewegen Position Bindungen von der Komponente an den Loader // Check alle Verwendungen von 'Eltern' im Wurzelelement des Bauteils..
es: // TODO: Mueva fijaciones de posición del componente a Loader // Comprobar todos los usos de 'padre' en el interior del elemento raíz del componente..
fr: // TODO: Déplacez fixations de position du composant à la Loader // Vérifiez toutes les utilisations de «parent» à l'intérieur de l'élément racine du composant..

# QmlJSEditor::Internal::Operation|
source: // Rename all outer uses of the id '%1' to '%2.item'.
de: // Benennen Sie alle äußeren Anwendungen der ID '%1' auf '%2.item'.
es: // Cambiar el nombre de todos los usos exteriores del id '%1' a '%2.item'.
fr: // Renommez toutes les utilisations extérieures de l'id '%1' et '%2.Item'.

# QmlJSEditor::Internal::Operation|
source: // Rename all outer uses of the id '%1' to '%2.item.%1'.
de: // Benennen Sie alle äußeren Anwendungen der ID '%1' auf '%2.item.%1'.
es: // Cambiar el nombre de todos los usos exteriores del id '%1' a '%2.item.%1'.
fr: // Renommez toutes les utilisations extérieures de l'id '%1' et '%2.Item.%1'.

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Ctrl+Shift+U
de: Strg + Umschalt + U
fr: Ctrl + Maj + U

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Rename Symbol Under Cursor
de: Benennen Sie Symbol unter Cursor
es: Cambiar el nombre del símbolo bajo el cursor
fr: Renommer Symbole sous le curseur

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Ctrl+Shift+R
de: Strg + Umschalt + R
fr: Ctrl + Maj + R

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Run Checks
de: Führen Checks
es: Los cheques Ejecutar
fr: Contrôles Run

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Ctrl+Shift+C
fr: Ctrl + Maj + C

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Reformat File
de: Formatieren Datei
es: Cambiar el formato de archivos
fr: Reformater fichier

# QmlJSEditor::Internal::QmlJSOutlineTreeView|
source: Expand All
de: Alle erweitern
es: Abre todos
fr: Développer tout

# QmlJSEditor::Internal::QmlJSOutlineTreeView|
source: Collapse All
de: Alles
es: Contraer Todo
fr: Réduire tout

# QmlJSEditor::Internal::QmlJSOutlineWidget|
source: Show All Bindings
de: Zeige alle Bindungen
es: Mostrar todos los enlaces
fr: Voir tous les Fixations

# QmlJSEditor::Internal::QmlJSTextEditorWidget|
source: Show Qt Quick ToolBar
de: Zeigen Qt Quick-Symbolleiste
es: Mostrar barra de herramientas Qt Quick
fr: Afficher Qt ToolBar rapide

# QmlJSEditor::QuickFix|
source: Split Initializer
es: Dividir Inicializador
fr: De Split Initializer

# QmlJSTools|
source: Code Style
de: Code Stil
es: Código Estilo
fr: Style Code

# QmlJSTools::Internal::QmlJSToolsPlugin|
source: Reset Code Model
de: Zurücksetzen Codemodell
es: Restablecer Código Modelo
fr: Réinitialiser Code type

# QmlJSTools::QmlJSToolsSettings|Settings
source: Global
de: Weltweit
fr: Mondial

# QmlParser|
source: Illegal syntax for exponential number
de: Illegale Syntax für exponentielle Anzahl
es: Sintaxis ilegal por número exponencial
fr: Syntaxe illégal pour nombre exponentiel

# QmlParser|
source: Stray newline in string literal
de: Streunende Newline in Zeichenfolgenliteral
es: Nueva línea perdido en cadena literal
fr: Stray nouvelle ligne dans la chaîne littérale

# QmlParser|
source: Illegal unicode escape sequence
de: Illegale Unicode-Escape-Sequenz
es: Secuencia de escape Unicode Ilegal
fr: Séquence d'échappement Unicode illégale

# QmlParser|
source: Illegal hexadecimal escape sequence
de: Illegale hexadezimale Escape-Sequenz
es: Ilegal secuencia de escape hexadecimal
fr: Séquence d'échappement hexadécimale illégale

# QmlParser|
source: Octal escape sequences are not allowed
de: Octal-Escape-Sequenzen sind nicht erlaubt
es: Secuencias de escape octales no están permitidos
fr: Octal séquences d'échappement ne sont pas autorisés

# QmlParser|
source: Unclosed string at end of line
de: Nicht geschlossene String am Zeilenende
es: Cadena sin cerrar al final de la línea
fr: Unclosed chaîne à la fin de la ligne

# QmlParser|
source: Decimal numbers can't start with '0'
de: Dezimalzahlen nicht mit '0'
es: Los números decimales no pueden comenzar con '0'
fr: Les nombres décimaux ne peuvent pas commencer par «0»

# QmlParser|
source: At least one hexadecimal digit is required after '0%1'
de: Mindestens eine hexadezimale Ziffer wird nach '0%1' erforderlich
es: Se requiere al menos un dígito hexadecimal después de '0%1 '
fr: Au moins un chiffre hexadécimal est nécessaire après '0%1'

# QmlParser|
source: Invalid regular expression flag '%0'
de: Ungültige Markierung regulären Ausdruck '%0'
es: Bandera expresión regular no válido '%0'
fr: Invalid drapeau de l'expression régulière '%0'

# QmlParser|
source: Unterminated regular expression backslash sequence
de: Nicht abgeschlossene Ausdruck Backslash-Sequenz regelmäßige
es: Secuencia barra invertida expresión regular sin terminar
fr: Séquence expression régulière barre oblique inverse non terminée

# QmlParser|
source: Unterminated regular expression class
de: Nicht abgeschlossene Ausdruck Klasse regelmäßige
es: Clase de expresiones regulares sin terminar
fr: Non terminée classe expression régulière

# QmlParser|
source: Unterminated regular expression literal
de: Nicht abgeschlossene regulären Ausdruck wörtliche
es: Expresión regular no terminada literal
fr: Expression régulière non terminée

# QmlParser|
source: Syntax error
de: Syntaxfehler
es: Error de sintaxis
fr: Erreur de syntaxe

# QmlParser|
source: Expected token `%1'
de: Erwartete Zeichen `%1 '
es: Esperado símbolo `%1 '
fr: Prévue jeton `%1 '

source: Text Editor
es: Editor de texto
fr: Editeur de texte

# TextEditor::BaseFileFind|
source: Search
de: Suche
es: Búsqueda
fr: Recherche

# TextEditor::BaseFileFind|
source: List of comma separated wildcard filters
de: Liste der durch Komma getrennt Wildcard-Filtern
es: Lista de filtros separados por comas comodín
fr: Liste des séparées par des virgules filtres génériques

# TextEditor::BaseTextDocument|
source: Opening file
de: Beim Öffnen der Datei
es: Abrir archivo
fr: Ouverture du fichier

# TextEditor::BaseTextEditor|
source: Line: %1, Col: %2
es: Línea:%1, Col:%2
fr: Ligne:%1, Col: %2

# TextEditor::BaseTextEditor|
source: Line: 9999, Col: 999
es: Línea: 9999, Col: 999
fr: Ligne: 9999, Col: 999

# TextEditor::BaseTextEditorWidget|
source: Print Document
de: Dokument drucken
es: Imprimir Documento
fr: Imprimer le document

# TextEditor::BaseTextEditorWidget|
source: File Error
de: Dateifehler
es: Error de archivo
fr: Erreur de fichier

# TextEditor::BaseTextEditorWidget|
source: The text is too large to be displayed (%1 MB).
de: Der Text zu groß ist, die angezeigt werden (%1 MB).
es: El texto es demasiado grande para ser visualizado (%1 MB).
fr: Le texte est trop important pour être affiché (%1 Mo).

# TextEditor::BaseTextEditorWidget|
source: <b>Error:</b> Could not decode "%1" with "%2"-encoding. Editing not possible.
de: <B> Fehler: </b> konnte nicht decodiert werden "%1 " mit "%2 " - Codierung. Bearbeiten nicht möglich.
es: <B> Error: </b> No se pudo decodificar "%1 " con "%2 " - codificación. La edición no sea posible.
fr: <B> Erreur: </b> Impossible de décoder "%1 " par "%2 " - encodage. Modification pas possible.

# TextEditor::BaseTextEditorWidget|
source: Select Encoding
de: Wählen Encoding
es: Seleccione Codificación
fr: Sélectionnez Encodage

# TextEditor::BaseTextEditorWidget|
source: Delete UTF-8 BOM on Save
de: Löschen Sie UTF-8 BOM auf Speichern
es: Eliminar BOM UTF-8 en Guardar
fr: Supprimer BOM UTF-8 sur Enregistrer

# TextEditor::BaseTextEditorWidget|
source: Add UTF-8 BOM on Save
de: In UTF-8 BOM auf Speichern
es: Añadir BOM UTF-8 en Guardar
fr: Ajouter BOM UTF-8 sur Enregistrer

# TextEditor::BehaviorSettingsPage|Settings
source: Global
de: Weltweit
fr: Mondial

# TextEditor::BehaviorSettingsWidget|
source: Displays context-sensitive help or type information on mouseover.
de: Zeigt die kontextsensitive Hilfe oder Typinformationen bei Mouseover.
es: Muestra la ayuda contextual o escribe información al pasar el ratón.
fr: Affiche de l'aide ou des informations de type contextuel passage de la souris.

# TextEditor::BehaviorSettingsWidget|
source: Displays context-sensitive help or type information on Shift+Mouseover.
de: Zeigt die kontextsensitive Hilfe oder geben Informationen über Shift + Mouseover.
es: Muestra la ayuda contextual o escriba información sobre Shift + Sitúe el ratón.
fr: Affiche l'aide contextuelle ou tapez informations sur Maj + Mouseover.

# TextEditor::BehaviorSettingsWidget|
source: <System Language>
es: <Idioma del sistema>
fr: <Langue système>

# TextEditor::BehaviorSettingsWidget|
source: Restart required
de: Neustart erforderlich
es: Se requiere reiniciar
fr: Redémarrage nécessaire

# TextEditor::BehaviorSettingsWidget|
source: The language change will take effect after a restart of Qt Creator.
de: Die Sprache Änderung wird nach einem Neustart des Qt Creator zu nehmen.
es: El cambio de idioma tendrá efecto después de reiniciar Qt Creator.
fr: Le changement de langue prendra effet après un redémarrage de Qt Creator.

# TextEditor::CodeStyleEditor|
source: Edit preview contents to see how the current settings are applied to custom code snippets. Changes in the preview do not affect the current settings.
de: Bearbeiten Vorschau Inhalt zu sehen, wie die aktuellen Einstellungen, um benutzerdefinierte Code-Snippets angewendet. Änderungen in der Vorschau haben keinen Einfluss auf die aktuellen Einstellungen.
es: Editar el contenido de vista previa para ver cómo se aplican los ajustes actuales de fragmentos de código personalizado. Los cambios en la vista previa no afectan a la configuración actual.
fr: Modifier aperçu contenus de voir comment les paramètres actuels sont appliqués à des extraits de code personnalisé. Changements dans l'aperçu ne affectent pas les paramètres actuels.

# TextEditor::CodeStyleSelectorWidget|
source: Copy Code Style
de: Code kopieren Stil
es: Copiar código Estilo
fr: Copie Style Code

# TextEditor::CodeStyleSelectorWidget|
source: Code style name:
de: Code Stil Name:
es: Nombre de estilo Código:
fr: nom du style de code:

# TextEditor::CodeStyleSelectorWidget|
source: %1 (Copy)
de: %1 (Kopieren)
es: %1 (Copia)
fr: %1 (Copie)

# TextEditor::CodeStyleSelectorWidget|
source: Delete Code Style
de: Löschen-Code Stil
es: Borrar Código Estilo
fr: Supprimer Style Code

# TextEditor::CodeStyleSelectorWidget|
source: Are you sure you want to delete this code style permanently?
de: Sind Sie sicher, Sie wollen diesen Code Stil dauerhaft löschen?
es: Seguro que quieres borrar este estilo de código de forma permanente?
fr: Êtes-vous sûr de vouloir supprimer ce style de code de façon permanente?

# TextEditor::CodeStyleSelectorWidget|
source: Delete
de: Löschen
es: Borrar
fr: Effacer

# TextEditor::CodeStyleSelectorWidget|
source: Import Code Style
de: Import-Code Stil
es: Código Importación Estilo
fr: Style Code importation

# TextEditor::CodeStyleSelectorWidget|
source: Code styles (*.xml);;All files (*)
de: Code Stile (* .xml) ;; Alle Dateien (*)
es: Estilos Código (* .xml) ;; Todos los archivos (*)
fr: styles de code (* .xml) ;; Tous les fichiers (*)

# TextEditor::CodeStyleSelectorWidget|
source: Cannot import code style from %1
de: Kann nicht Code-Stil von%1 zu importieren
es: No se puede importar el estilo de código de %1
fr: Vous ne pouvez pas importer style de code %1

# TextEditor::CodeStyleSelectorWidget|
source: Export Code Style
de: Export-Code Stil
es: Código Exportar estilo
fr: Export Style Code

# TextEditor::CodeStyleSelectorWidget|
source: %1 [built-in]
de: %1 [eingebaute]
es: %1 [incorporados]
fr: %1 [intégré]

# TextEditor::FindInFiles|
source: Files on File System
de: Dateien auf File System
es: Los archivos de sistema de archivos
fr: Fichiers sur File System

# TextEditor::FindInFiles|
source: Directory '%1':
de: Verzeichnis '%1':
es: Directorio '%1':
fr: Répertoire '%1':

# TextEditor::FindInFiles|
source: Path: %1 Filter: %2 %3
de: Pfad:%1 Filter:%2 %3
es: Ruta de acceso:%1 Filter:%2 %3
fr: Chemin d'accès:%1 filter:%2 %3

# TextEditor::FindInFiles|
source: Director&y:
de: Regie & y:
es: Directora & y:
fr: Directeur et y:

# TextEditor::FindInFiles|
source: &Browse...
de: & Durchsuchen ...
es: Y Examinar ...
fr: & Parcourir ...

# TextEditor::FindInFiles|
source: Fi&le pattern:
de: Fi & le Muster:
es: Fi & le patrón:
fr: Fi et le modèle:

# TextEditor::FindInFiles|
source: Directory to search
de: Directory, um zu suchen
es: Directorio para buscar
fr: Répertoire de recherche

# TextEditor::FontSettingsPage|
source: Font && Colors
de: Font && Farben
es: Colores de fuente &&
fr: Font de Couleurs

# TextEditor::FontSettingsPage|
source: Copy Color Scheme
de: Kopieren Farbschema
es: Esquema de color de copia
fr: Copie Color Scheme

# TextEditor::FontSettingsPage|
source: Color scheme name:
de: Farbschema Name:
es: Color de nombre de esquema:
fr: Couleur nom de schéma:

# TextEditor::FontSettingsPage|
source: %1 (copy)
de: %1 (Kopie)
es: %1 (copia)
fr: %1 (copie)

# TextEditor::FontSettingsPage|
source: Delete Color Scheme
de: Löschen Farbschema
es: Eliminar Esquema de color
fr: Supprimer Color Scheme

# TextEditor::FontSettingsPage|
source: Are you sure you want to delete this color scheme permanently?
de: Sind Sie sicher, Sie wollen diesen Farbgebung dauerhaft löschen?
es: Seguro que quieres borrar este esquema de color de forma permanente?
fr: Êtes-vous sûr de vouloir supprimer ce schéma de couleur de façon permanente?

# TextEditor::FontSettingsPage|
source: Delete
de: Löschen
es: Borrar
fr: Effacer

# TextEditor::FontSettingsPage|
source: The color scheme "%1" was modified, do you want to save the changes?
de: Das Farbschema "%1 " geändert wurde, wollen Sie die Änderungen speichern?
es: El esquema de color "%1 " se modificó, desea guardar los cambios?
fr: La couleur système "%1 " a été modifié, voulez-vous enregistrer les modifications?

# TextEditor::FontSettingsPage|
source: Discard
de: Wegwerfen
es: Descartar
fr: Jeter

# TextEditor::HighlighterSettingsPage|
source: Generic Highlighter
de: Generische Textmarker
es: Highlighter Genérico
fr: Générique surligneur

# TextEditor::HighlighterSettingsPage|
source: Download Definitions...
de: Download-Definitionen ...
es: Descargue definiciones ...
fr: Téléchargement des définitions ...

# TextEditor::HighlighterSettingsPage|
source: Autodetect Definitions
de: Autodetect Definitionen
es: Definiciones autodetect
fr: Définitions Autodetect

# TextEditor::HighlighterSettingsPage|
source: No pre-installed definitions could be found.
de: Keine vorinstallierte Definitionen gefunden werden konnte.
es: No hay definiciones pre-instalado se podían encontrar.
fr: Aucune définition de pré-installés peuvent être trouvés.

# TextEditor::HighlighterSettingsPage|
source: Error connecting to server.
de: Fehler beim Verbinden mit dem Server.
es: Error al conectar con el servidor.
fr: Erreur de connexion au serveur.

# TextEditor::HighlighterSettingsPage|
source: Not possible to retrieve data.
de: Nicht möglich, Daten abzurufen.
es: No es posible recuperar los datos.
fr: Pas possible de récupérer des données.

# TextEditor::Internal::BehaviorSettingsPage|
source: Form
es: Forma
fr: Forme

# TextEditor::Internal::BehaviorSettingsWidget|
source: Typing
es: Mecanografía
fr: Dactylographie

# TextEditor::Internal::BehaviorSettingsWidget|
source: Enable automatic &indentation
de: Aktivieren Sie die automatische & Einbuchtung
es: Habilitar automática y sangría
fr: Activer automatique et indentation

# TextEditor::Internal::BehaviorSettingsWidget|
source: Backspace indentation:
de: Backspace Einzug:
es: Sangría Retroceso:
fr: Indentation Backspace:

# TextEditor::Internal::BehaviorSettingsWidget|
source: <html><head/><body> Specifies how backspace interacts with indentation. <ul> <li>None: No interaction at all. Regular plain backspace behavior. </li> <li>Follows Previous Indents: In leading white space it will take the cursor back to the nearest indentation level used in previous lines. </li> <li>Unindents: If the character behind the cursor is a space it behaves as a backtab. </li> </ul></body></html>
de: <Html> <head /> <body> Specifies wie Backspace interagiert mit Einkerbung <ul> <li>. None: Keine Interaktion überhaupt. Regelmäßige Klarrück Verhalten </li> <li> Folgt Vorherige Einzüge:.. In Leerraum wird sie den Cursor auf die nächste Einzugsebene in früheren Linien verwendet dauern </li> <li> Unindents:. Wenn das Zeichen hinter dem Cursor ist ein Raum, den sie als Negativer verhält sich </li> </ul> </body> </html>
es: <Html> <head /> <body> Specifies cómo retroceso interactúa con sangría <ul> <li> Ninguno:. No hay interacción en absoluto. Regular el comportamiento normal de retroceso </li> <li> Sigue guiones anteriores:.. En los espacios en blanco que tomará el cursor de nuevo al nivel de sangría más próximo, utilizada en anteriores líneas </li> <li> Unindents:. Si el carácter detrás del cursor es un espacio que se comporta como un RETROCESO </li> </ul> </body> </html>
fr: <Html> <head /> <body> Specifies comment backspace interagit avec indentation <ul> <li> Aucun:. Aucune interaction du tout. Comportement régulier plaine backspace </li> <li> Suit tirets précédents:.. En premier espace blanc il faudra le curseur vers le niveau de retrait le plus proche utilisé dans les lignes précédentes </li> <li> désindente:. Si le caractère derrière le curseur est un espace, il se comporte comme un son inverse </li> </ul> </body> </html>

# TextEditor::Internal::BehaviorSettingsWidget|
source: None
de: Die Sonne Geht Auf
es: Ninguno
fr: Aucun

# TextEditor::Internal::BehaviorSettingsWidget|
source: Follows Previous Indents
de: Folgt Vorherige Einzüge
es: Sigue guiones anteriores
fr: Suit tirets précédents

# TextEditor::Internal::BehaviorSettingsWidget|
source: Unindents
fr: Désindente

# TextEditor::Internal::BehaviorSettingsWidget|
source: Tab key performs auto-indent:
de: Tab-Taste wird die Auto-indent:
es: Tecla Tab realiza auto-guión:
fr: touche Tab effectue auto-tiret:

# TextEditor::Internal::BehaviorSettingsWidget|
source: Never
de: Noch Nie
es: Nunca
fr: Jamais

# TextEditor::Internal::BehaviorSettingsWidget|
source: Always
de: Schon Immer
es: Siempre
fr: Toujours

# TextEditor::Internal::BehaviorSettingsWidget|
source: In Leading White Space
de: Im Leerraum
es: En los espacios en blanco
fr: En espace blanc

# TextEditor::Internal::BehaviorSettingsWidget|
source: User Interface
de: Benutzeroberfläche
es: Interfaz de usuario
fr: Interface utilisateur

# TextEditor::Internal::BehaviorSettingsWidget|
source: Cleanup actions which are automatically performed right before the file is saved to disk.
de: Bereinigungsaktionen, die automatisch kurz vor der Datei durchgeführt werden, wird auf der Festplatte gespeichert.
es: Acciones de limpieza que se realizan automáticamente justo antes de que el archivo se guarda en el disco.
fr: Actions nettoyage qui sont automatiquement effectuées juste avant le fichier est enregistré sur le disque.

# TextEditor::Internal::BehaviorSettingsWidget|
source: Cleanups Upon Saving
de: Aufräumarbeiten nach dem Speichern
es: Limpiezas al guardar
fr: Nettoyages lors de l'enregistrement

# TextEditor::Internal::BehaviorSettingsWidget|
source: Removes trailing whitespace upon saving.
de: Entfernt nachfolgende Leerzeichen beim Speichern.
es: Elimina espacios en blanco al guardar.
fr: Supprime les espaces blancs lors de l'enregistrement.

# TextEditor::Internal::BehaviorSettingsWidget|
source: &Clean whitespace
de: & Clean Leerzeichen
es: Y los espacios en blanco Limpio
fr: & Espaces Clean

# TextEditor::Internal::BehaviorSettingsWidget|
source: Cleans whitespace in entire document instead of only for changed parts.
de: Reinigt Leerzeichen im gesamten Dokument, anstatt nur geänderte Teile.
es: Limpia el espacio en blanco en todo el documento en lugar de sólo para las partes modificadas.
fr: Nettoie espaces dans tout le document au lieu d'uniquement pour les parties modifiées.

# TextEditor::Internal::BehaviorSettingsWidget|
source: In entire &document
de: Im gesamten Dokument &
es: En todo el documento y
fr: Dans toute & documents

# TextEditor::Internal::BehaviorSettingsWidget|
source: Corrects leading whitespace according to tab settings.
de: Korrigiert führenden Whitespace nach Registerkarte Einstellungen.
es: Corrige espacios en blanco según la configuración de la ficha.
fr: Corrige leader espaces en fonction des paramètres de l'onglet.

# TextEditor::Internal::BehaviorSettingsWidget|
source: Clean indentation
de: Saubere Einbuchtung
es: Sangría Clean
fr: Indentation Clean

# TextEditor::Internal::BehaviorSettingsWidget|
source: Always writes a newline character at the end of the file.
de: Schreibt immer einen Zeilenumbruch am Ende der Datei.
es: Siempre escribe un carácter de nueva línea al final del archivo.
fr: Écrit toujours un caractère de nouvelle ligne à la fin du fichier.

# TextEditor::Internal::BehaviorSettingsWidget|
source: &Ensure newline at end of file
de: & Stellen Sie sicher, neue Zeile am Ende der Datei
es: Asegurar la nueva línea al final del archivo
fr: & Assurer saut de ligne à la fin du fichier

# TextEditor::Internal::BehaviorSettingsWidget|
source: File Encodings
de: Dateikodierungen
es: Codificaciones de archivo
fr: codages de fichier

# TextEditor::Internal::BehaviorSettingsWidget|
source: Default encoding:
de: Standardkodierung:
es: La codificación por omisión:
fr: Encodage par défaut:
