Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# Utils::ElfReader|
source: '%1' is not an ELF object
de: '%1' ist nicht ein ELF-Objekt
es: '%1' no es un objeto ELF
fr: '%1' ne est pas un objet ELF

# Utils::ElfReader|
source: odd cpu architecture
de: ungerade CPU-Architektur
es: arquitectura de CPU extraño
fr: l'architecture du processeur impair

# Utils::ElfReader|
source: odd endianness
de: ungerade Byte-Reihenfolge
es: endianness impar
fr: boutisme impair

# Utils::ElfReader|
source: unexpected e_shsize
de: unerwartete e_shsize
es: e_shsize inesperado
fr: e_shsize inattendue

# Utils::ElfReader|
source: unexpected e_shentsize
de: unerwartete e_shentsize
es: e_shentsize inesperado
fr: e_shentsize inattendue

# Utils::ElfReader|
source: announced %n sections, each %1 bytes, exceed file size
de: kündigte %n Abschnitte, die jeweils%1 Byte überschreiten Dateigröße
es: anunciadas %n secciones, cada%1 bytes, superan el tamaño del archivo
fr: annoncées %n sections, chacune%1 octets, dépassent la taille du fichier

# Utils::ElfReader|
source: string table seems to be at 0x%1
de: String-Tabelle scheint bei 0x%1 sein
es: tabla de cadenas parece estar en 0x%1
fr: table de chaîne semble être à 0x%1

# Utils::ElfReader|
source: section name %1 of %2 behind end of file
de: Abschnittsnamen%1 von%2 hinter Dateiende
es: nombre de la sección%1 de%2 detrás de final del archivo
fr: nom de la section%%12 derrière la fin du fichier

# Utils::EnvironmentModel|
source: Value
de: Wert
es: Valor
fr: Valeur

# Utils::EnvironmentModel|
source: <VALUE>
de: <Wert>
es: <VALOR>
fr: <VALEUR>

# Utils::FancyLineEdit|
source: Filter
es: Filtro
fr: Filtre

# Utils::FancyLineEdit|
source: Clear text
de: Klartext
es: Borrar texto
fr: Effacer texte

# Utils::FancyMainWindow|
source: Locked
de: Verschlossen
es: Bloqueado
fr: Fermé

# Utils::FancyMainWindow|
source: Reset to Default Layout
de: Rücksetzen auf Standard-Layout
es: Restablecer valores predeterminados Layout
fr: Réinitialiser Disposition

# Utils::FileNameValidatingLineEdit|
source: Name is empty.
de: Name ist leer.
es: Nombre está vacío.
fr: Nom est vide.

# Utils::FileNameValidatingLineEdit|
source: Name contains white space.
de: Name beinhaltet Leerraum.
es: El nombre contiene espacios en blanco.
fr: Le nom contient un espace blanc.

# Utils::FileNameValidatingLineEdit|
source: Invalid character '%1'.
de: Ungültiges Zeichen '%1'.
es: Carácter no válido '%1'.
fr: Caractère invalide '%1'.

# Utils::FileNameValidatingLineEdit|
source: Invalid characters '%1'.
de: Ungültige Zeichen '%1'.
es: '%1' Los caracteres no válidos.
fr: '%1' des caractères non valides.

# Utils::FileNameValidatingLineEdit|
source: Name matches MS Windows device. (%1).
de: Name mit MS Windows-Gerät. (%1).
es: Nombre coincide con dispositivo de MS Windows. (%1).
fr: Nom correspond périphérique MS Windows. (%1).

# Utils::FileNameValidatingLineEdit|
source: File extension %1 is required:
de: Dateierweiterung%1 wird benötigt:
es: Extensión de archivo%1 se requiere:
fr: File extension%1 est nécessaire:

# Utils::FileNameValidatingLineEdit|
source: File extensions %1 are required:
de: Datei-Erweiterungen%1 benötigt:
es: Las extensiones de archivo%1 se requiere:
fr: Les extensions de fichier%1 sont nécessaires:

# Utils::FileSearch|
source: %1: canceled. %n occurrences found in %2 files.
de: %1: gestempelt. %n Vorkommen in%2 Dateien gefunden.
es: %1: cancelado. %n ocurrencias encuentran en%2 archivos.
fr: %1: annulé. %n occurrences trouvées dans %2 des fichiers.

# Utils::FileSearch|
source: %1: %n occurrences found in %2 files.
de: %1:%n Vorkommen in%2 Dateien gefunden.
es: %1:%n ocurrencias se encuentran en%2 archivos.
fr: %1: %n occurrences trouvées dans %2 des fichiers.

# Utils::FileUtils|
source: Refusing to remove root directory.
de: Die Weigerung, Root-Verzeichnis zu entfernen.
es: Negarse a eliminar el directorio raíz.
fr: Refusant de supprimer le répertoire racine.

# Utils::FileUtils|
source: Refusing to remove your home directory.
de: Die Weigerung, Ihr Home-Verzeichnis zu entfernen.
es: Negarse a eliminar el directorio home.
fr: Le refus de supprimer votre répertoire home.

# Utils::FileUtils|
source: Failed to remove directory '%1'.
de: Konnte Verzeichnis '%1' zu entfernen.
es: Error al eliminar el directorio '%1'.
fr: Impossible de supprimer le répertoire '%1'.

# Utils::FileUtils|
source: Failed to remove file '%1'.
de: Konnte die Datei entfernen '%1'.
es: Error al eliminar el archivo '%1'.
fr: Impossible de supprimer le fichier '%1'.

# Utils::FileUtils|
source: Failed to create directory '%1'.
de: Konnte Verzeichnis '%1' erstellen.
es: No se pudo crear el directorio '%1'.
fr: Impossible de créer le répertoire '%1'.

# Utils::FileUtils|
source: Could not copy file '%1' to '%2'.
de: Konnte nicht Datei '%1' auf '%2' zu kopieren.
es: No se pudo copiar el archivo '%1' a '%2'.
fr: Impossible de copier le fichier '%1' et '%2'.

# Utils::FileUtils|
source: Cannot open %1 for reading: %2
de: Kann nicht geöffnet werden%1 zum Lesen:%2
es: No se puede abrir%1 para lectura: %2
fr: Impossible d'ouvrir%1 pour la lecture: %2

# Utils::FileUtils|
source: Cannot read %1: %2
de: Kann nicht gelesen werden%1:%2
es: No se puede leer%1:%2
fr: Impossible de lire%1:%2

# Utils::FileUtils|
source: File Error
de: Dateifehler
es: Error de archivo
fr: Erreur de fichier

# Utils::FileUtils|
source: Cannot write file %1. Disk full?
de: Datei kann nicht geschrieben%1. Festplatte voll?
es: No se puede escribir el archivo%1. Disco lleno?
fr: Vous ne pouvez pas écrire le fichier%1. Disque plein?

# Utils::FileUtils|
source: Cannot overwrite file %1: %2
de: Kann nicht überschrieben Datei%1:%2
es: No se puede sobrescribir el archivo%1:%2
fr: Vous ne pouvez pas écraser le fichier%1:%2

# Utils::FileUtils|
source: Cannot create file %1: %2
de: Datei kann nicht erstellt%1:%2
es: No se puede crear el archivo%1:%2
fr: Impossible de créer le fichier%1:%2

# Utils::FileUtils|
source: Cannot create temporary file in %1: %2
de: Kann temporäre Datei nicht erstellt werden in%1:%2
es: No se puede crear el archivo temporal en%1:%2
fr: Vous ne pouvez pas créer un fichier temporaire en%1:%2

# Utils::FileWizardDialog|
source: Location
de: Lage
es: Ubicación
fr: Emplacement

# Utils::IpAddressLineEdit|
source: The IP address is not valid.
de: Die IP-Adresse ist nicht gültig.
es: La dirección IP no es válida.
fr: L'adresse IP ne est pas valide.

# Utils::NewClassWidget|
source: &Class name:
de: & Klassenname:
es: Y el nombre de clase:
fr: & Nom de la classe:

# Utils::NewClassWidget|
source: &Base class:
de: & Basisklasse:
es: Y Clase base:
fr: & Classe de base:

# Utils::NewClassWidget|
source: &Type information:
de: Geben Sie & Informationen:
es: Y Tipo:
fr: Tapez et informations:

# Utils::NewClassWidget|
source: None
de: Die Sonne Geht Auf
es: Ninguno
fr: Aucun

# Utils::NewClassWidget|
source: Inherits QObject
de: Erbt QObject
es: QObject Hereda
fr: QObject Inherits

# Utils::NewClassWidget|
source: Inherits QWidget
de: Erbt QWidget
es: QWidget Hereda
fr: QWidget Inherits

# Utils::NewClassWidget|
source: Inherits QQuickItem - Qt Quick 2
de: Erbt QQuickItem - Qt Quick 2
es: Hereda QQuickItem - Qt Quick 2
fr: Hérite QQuickItem - Qt Quick 2

# Utils::NewClassWidget|
source: Based on QSharedData
de: Basierend auf QSharedData
es: Basado en QSharedData
fr: Sur la base de QSharedData

# Utils::NewClassWidget|
source: &Header file:
de: & Headerdatei:
es: Y archivos de cabecera:
fr: & Fichier en-tête:

# Utils::NewClassWidget|
source: &Source file:
de: & Quelldatei:
es: Y el archivo de origen:
fr: & Fichier Source:

# Utils::NewClassWidget|
source: &Generate form:
de: & Generieren Form:
es: Y Generar formulario:
fr: & Forme Générer:

# Utils::NewClassWidget|
source: &Form file:
de: & Formulardatei:
es: Y forma de archivo:
fr: & Form fichier:

# Utils::NewClassWidget|
source: &Path:
de: & Pfad:
es: Y Ruta de acceso:
fr: & Chemin:

# Utils::NewClassWidget|
source: Invalid base class name
de: Ungültige Basisklassenname
es: De base no válida nombre de la clase
fr: Nom de la classe de base non valide

# Utils::NewClassWidget|
source: Invalid header file name: '%1'
de: Ungültige Header-Datei-Name: '%1'
es: Inválido nombre de archivo de cabecera: '%1'
fr: Nom de fichier incorrect d'en-tête: '%1'

# Utils::NewClassWidget|
source: Invalid source file name: '%1'
de: Ungültige Quelldateinamen: '%1'
es: Inválido nombre del archivo fuente: '%1'
fr: Nom de fichier incorrect source: '%1'

# Utils::NewClassWidget|
source: Invalid form file name: '%1'
de: Ungültige Form Dateiname: '%1'
es: Inválido nombre de archivo formulario: '%1'
fr: Nom de fichier incorrect de forme: '%1'

# Utils::PathChooser|
source: Choose...
de: Wählen Sie ...
es: Elegir ...
fr: Choisissez ...

# Utils::PathChooser|
source: Browse...
de: Durchsuchen ...
es: Examinar ...
fr: Parcourir ...

# Utils::PathChooser|
source: Choose Directory
de: Verzeichnis wählen
es: Elegir directorio
fr: Choisissez Répertoire

# Utils::PathChooser|
source: Choose Executable
de: Wählen Executable
es: Elija Ejecutable
fr: Choisissez Executable

# Utils::PathChooser|
source: Choose File
de: Wählen Sie Datei
es: Elija Archivo
fr: Choisissez Fichier

# Utils::PathChooser|
source: The path must not be empty.
de: Der Pfad darf nicht leer sein.
es: El camino no debe estar vacío.
fr: Le chemin ne doit pas être vide.

# Utils::PathChooser|
source: The path '%1' expanded to an empty string.
de: Der Pfad '%1' erweitert, um eine leere Zeichenfolge.
es: La ruta '%1' se expandió a una cadena vacía.
fr: Le chemin '%1' étendue à une chaîne vide.

# Utils::PathChooser|
source: The path '%1' does not exist.
de: Der Pfad '%1' ist nicht vorhanden.
es: La ruta '%1' no existe.
fr: Le chemin '%1' ne existe pas.

# Utils::PathChooser|
source: The path '%1' is not a directory.
de: Der Pfad '%1' ist kein Verzeichnis.
es: La ruta '%1' no es un directorio.
fr: Le chemin '%1' ne est pas un répertoire.

# Utils::PathChooser|
source: The directory '%1' does not exist.
de: Das Verzeichnis '%1' ist nicht vorhanden.
es: No existe el directorio '%1'.
fr: Le répertoire '%1' ne existe pas.

# Utils::PathChooser|
source: Cannot execute '%1'.
de: Kann nicht ausgeführt werden '%1'.
es: No se puede ejecutar '%1'.
fr: Vous ne pouvez pas exécuter%1.

# Utils::PathChooser|
source: The path <b>%1</b> is not a directory.
de: Der Pfad <b>%1 </b> ist kein Verzeichnis.
es: La ruta <b>%1 </b> no es un directorio.
fr: Le chemin <b>%1 </b> ne est pas un répertoire.

# Utils::PathChooser|
source: The path <b>%1</b> is not a file.
de: Der Pfad <b>%1 </b> ist keine Datei.
es: La ruta <b>%1 </b> no es un archivo.
fr: Le chemin <b>%1 </b> ne est pas un fichier.

# Utils::PathChooser|
source: The path <b>%1</b> is not an executable file.
de: Der Pfad <b>%1 </b> ist keine ausführbare Datei.
es: La ruta <b>%1 </b> no es un archivo ejecutable.
fr: Le chemin <b>%1 </b> ne est pas un fichier exécutable.

# Utils::PathChooser|
source: Full path: <b>%1</b>
de: Vollständiger Pfad: <b>%1 </b>
es: Ruta completa: <b>%1 </b>
fr: Chemin complet: <b>%1 </b>

# Utils::PathChooser|
source: Path:
de: Pfad:
es: Ruta de acceso:
fr: Chemin d'accès:

# Utils::PathListEditor|
source: Insert...
de: Legen Sie ...
es: Inserte ...
fr: Insérez ...

# Utils::PathListEditor|
source: Add...
de: Hinzufügen ...
es: Añadir ...
fr: Ajouter ...

# Utils::PathListEditor|
source: Delete Line
de: Zeile löschen
es: Borrar Line
fr: Supprimer ligne

# Utils::PathListEditor|
source: Clear
de: Klar
es: Claro
fr: Clair

# Utils::PathListEditor|
source: From "%1"
de: Von "%1 "
es: De "%1 "
fr: De "%1 "

# Utils::ProjectIntroPage|
source: Introduction and Project Location
de: Einführung und Projektstandort
es: Introducción y Ubicación del Proyecto
fr: Introduction et Emplacement du projet

# Utils::ProjectIntroPage|
source: Name:
es: Nombre:
fr: Nom:

# Utils::ProjectIntroPage|
source: Create in:
de: Erstellen Sie in:
es: Crear en:
fr: Créer dans:

# Utils::ProjectIntroPage|
source: Use as default project location
de: Als Standard Projektstandort
es: Utilizar como la ubicación de proyecto por defecto
fr: Utiliser comme emplacement du projet par défaut

# Utils::ProjectIntroPage|
source: Project:
de: Projekt:
es: Proyecto:
fr: Projet:

# Utils::ProjectIntroPage|
source: The project already exists.
de: Das Projekt ist bereits vorhanden.
es: Ya existe el proyecto.
fr: Le projet existe déjà.

# Utils::ProjectIntroPage|
source: A file with that name already exists.
de: Eine Datei mit diesem Namen existiert bereits.
es: Un archivo con ese nombre ya existe.
fr: Un fichier avec ce nom existe déjà.

# Utils::ProjectNameValidatingLineEdit|
source: Invalid character '%1' found!
de: Ungültiges Zeichen '%1' gefunden!
es: Carácter no válido '%1' encontrado!
fr: Caractère invalide '%1' introuvable!

# Utils::ProjectNameValidatingLineEdit|
source: Invalid character '.'.
de: Ungültige Zeichen '.'.
es: Carácter no válido '.'.
fr: Caractère non valide '.'.

# Utils::QtcProcess|
source: Error in command line.
de: Fehler in der Befehlszeile.
es: Error en la línea de comandos.
fr: Erreur dans la ligne de commande.

# Utils::SettingsSelector|
source: Add
de: Hinzufügen
es: Añadir
fr: Ajouter

# Utils::SettingsSelector|
source: Remove
de: Entfernen
es: Quitar
fr: Supprimer

# Utils::SettingsSelector|
source: Rename
de: Umbenennen
es: Rebautizar
fr: Rebaptiser

# Utils::SettingsSelector|
source: Do you really want to delete the configuration <b>%1</b>?
de: Wollen Sie wirklich, um die Konfiguration zu löschen <b>%1 </b>?
es: De verdad quiere eliminar la configuración de <b>%1 </b>?
fr: Voulez-vous vraiment supprimer la configuration <b>%1 </b>?

# Utils::SettingsSelector|
source: New name for configuration <b>%1</b>:
de: Neuer Name für die Konfiguration <b>%1 </b>:
es: Nuevo nombre para la configuración de <b>%1 </b>:
fr: Nouveau nom pour la configuration <b>%1 </b>:

# Utils::SettingsSelector|
source: Rename...
de: Umbenennen ...
es: Cambiar el nombre de ...
fr: Renommer ...

# Utils::SynchronousProcess|
source: The command '%1' finished successfully.
de: Der Befehl '%1' wurde erfolgreich abgeschlossen.
es: El comando '%1' terminó con éxito.
fr: La commande '%1' est terminée avec succès.

# Utils::SynchronousProcess|
source: The command '%1' terminated with exit code %2.
de: Der Befehl '%1' mit Exit-Code%2 beendet.
es: El comando '%1' termina con código de salida%2.
fr: La commande '%1' se est terminé avec le code de sortie %2.

# Utils::SynchronousProcess|
source: The command '%1' terminated abnormally.
de: Der Befehl '%1' nicht normal beendet.
es: El comando '%1' ha terminado anormalmente.
fr: La commande '%1' est terminée anormalement.

# Utils::SynchronousProcess|
source: The command '%1' could not be started.
de: Der Befehl '%1' konnte nicht gestartet werden.
es: El comando '%1' no se pudo iniciar.
fr: La commande '%1' n'a pas pu être commencé.

# Utils::SynchronousProcess|
source: The command '%1' did not respond within the timeout limit (%2 ms).
de: Der Befehl '%1' nicht innerhalb der Timeout-Limit (%2 ms) zu reagieren.
es: El comando '%1' no respondió dentro del límite de tiempo de espera (%2 ms).
fr: La commande '%1' n'a pas répondu dans la limite de délai (de %2 ms).

# Utils::SynchronousProcess|
source: Process not Responding
de: Prozess reagiert nicht
es: Proceso no responde
fr: Processus ne répond pas

# Utils::SynchronousProcess|
source: The process is not responding.
de: Der Prozess reagiert nicht.
es: El proceso no está respondiendo.
fr: Le processus ne répond pas.

# Utils::SynchronousProcess|
source: The process '%1' is not responding.
de: Der Prozess '%1' nicht reagiert.
es: El proceso de '%1' no está respondiendo.
fr: Le processus '%1' ne répond pas.

# Utils::SynchronousProcess|
source: Would you like to terminate it?
de: Möchten Sie es zu beenden?
es: Te gustaría terminarlo?
fr: Aimeriez-vous y mettre fin?

# Utils::TextFileFormat|
source: An encoding error was encountered.
de: Ein Codierungsfehler aufgetreten.
es: Se encontró un error de codificación.
fr: Une erreur de codage a été rencontrée.

# Utils::UnixTools|
source: <table border=1 cellspacing=0 cellpadding=3><tr><th>Variable</th><th>Expands to</th></tr><tr><td>%d</td><td>directory of current file</td></tr><tr><td>%f</td><td>file name (with full path)</td></tr><tr><td>%n</td><td>file name (without path)</td></tr><tr><td>%%</td><td>%</td></tr></table>
de: <Table border = 1 cellspacing = 0 cellpadding = 3> <tr> <th> Variable </th> <th> expandiert nach </th> </tr> <tr> <td> %d </td> <td > Verzeichnis der aktuellen Datei </td> </tr> <tr> <td> %f </td> <td> Dateinamen (mit vollem Pfad) </td> </tr> <tr> <td> %n </td> <td> Dateiname (ohne Pfad) </td> </tr> <tr> <td> %% </td> <td>% </td> </tr> </table>
es: <Table border = 1 cellspacing = 0 cellpadding = 3> <tr> <th> Variable </th> <th> expande al </th> </tr> <tr> <td> %d </td> <td > directorio de archivo actual </td> </tr> <tr> <td> %f </td> <td> nombre de archivo (con la ruta completa) </td> </tr> <tr> <td> %n </td> <td> nombre de archivo (sin ruta) </td> </tr> <tr> <td> %% </td> <td>% </td> </tr> </table>
fr: <Table border = 1 cellspacing = 0 cellpadding = 3> <tr> <th> Variable </th> <th> élargit à </th> </tr> <tr> <td> %d </td> <td > Répertoire de fichier actuel </td> </tr> <tr> <td> %f </td> <td> nom de fichier (avec le chemin complet) </td> </tr> <tr> <td> %n </td> <td> nom de fichier (sans le chemin) </td> </tr> <tr> <td> %% </td> <td>% </td> </tr> </table>

# Utils::WizardPage|
source: Choose the Location
de: Wählen Sie den Ort
es: Elija la ubicación
fr: Choisissez l'emplacement

# Utils::WizardPage|
source: Name:
es: Nombre:
fr: Nom:

# Utils::WizardPage|
source: Path:
de: Pfad:
es: Ruta de acceso:
fr: Chemin d'accès:

# Utils::fileDeletedPrompt|
source: File has been removed
de: Datei wurde entfernt
es: El archivo ha sido eliminado
fr: Le fichier a été supprimé

# Utils::fileDeletedPrompt|
source: The file %1 has been removed outside Qt Creator. Do you want to save it under a different name, or close the editor?
de: Die Datei%1 ist außerhalb Qt Creator entfernt. Wollen Sie es unter einem anderen Namen speichern, oder schließen Sie den Editor suchen?
es: El archivo%1 ha sido retirado fuera de Qt Creator. Desea guardarlo con un nombre diferente, o cerrar el editor?
fr: Le fichier%1 a été supprimé en dehors Qt Creator. Voulez-vous l'enregistrer sous un nom différent, ou fermez l'éditeur?

# Utils::fileDeletedPrompt|
source: The file %1 was removed. Do you want to save it under a different name, or close the editor?
de: Die Datei%1 wurde entfernt. Wollen Sie es unter einem anderen Namen speichern, oder schließen Sie den Editor suchen?
es: Se eliminó el archivo%1. Desea guardarlo con un nombre diferente, o cerrar el editor?
fr: Le fichier%1 a été supprimé. Voulez-vous l'enregistrer sous un nom différent, ou fermez l'éditeur?

# Utils::fileDeletedPrompt|
source: &Close
de: & Zu Schließen
es: Y cerrar
fr: & Fermer

# Utils::fileDeletedPrompt|
source: C&lose All
de: C & verlieren alle
es: C & pierden todas
fr: C & perdent tout

# Utils::fileDeletedPrompt|
source: Save &as...
de: Speichern unter ...
es: Guardar y como ...
fr: Enregistrer & sous ...

# Utils::reloadPrompt|
source: File Changed
de: Datei geändert
es: Cambiado Archivo
fr: Changé fichier

# Utils::reloadPrompt|
source: The unsaved file <i>%1</i> has changed outside Qt Creator. Do you want to reload it and discard your changes?
de: Die gespeicherte Datei <i>%1 </i> außerhalb Qt Creator geändert hat. Wollen Sie es neu zu laden und Ihre Änderungen verwerfen?
es: El archivo no guardado <i>%1 </i> ha cambiado fuera de Qt Creator. Quieres volver a cargarlo y descartar los cambios?
fr: Le fichier non enregistré <i>%1 </i> a changé en dehors Qt Creator. Voulez-vous recharger et jetez vos modifications?

# Utils::reloadPrompt|
source: The file <i>%1</i> has changed outside Qt Creator. Do you want to reload it?
de: Die Datei <i>%1 </i> außerhalb Qt Creator geändert hat. Wollen Sie es neu zu laden?
es: El archivo <i>%1 </i> ha cambiado fuera de Qt Creator. Quieres volver a cargarlo?
fr: Le fichier <i>%1 </i> a changé en dehors Qt Creator. Voulez-vous le recharger?

# Core::EditorManager|
source: Ctrl+W
de: Strg + W

# Core::EditorManager|
source: Ctrl+F4
de: Strg + F4

# Core::EditorManager|
source: Ctrl+Tab
de: Strg + Tab

# Core::EditorManager|
source: Ctrl+E,2
de: Strg + E, 2

# Core::EditorManager|
source: Ctrl+E,3
de: Strg + E, 3

# Core::EditorManager|
source: Ctrl+E,4
de: Strg + E, 4

# Core::EditorManager|
source: Ctrl+E,0
de: Strg + E, 0

# Core::EditorManager|
source: Ctrl+E,o
de: Strg + E, o

# Core::Internal::FindToolBar|
source: Ctrl+E
de: Strg + E

# Core::Internal::FindToolBar|
source: Ctrl+F3
de: Strg + F3

# Core::Internal::FindToolBar|
source: Ctrl+=
de: Strg + =

# Core::Internal::MainWindow|
source: &Copy
de: & Kopieren

# Core::Internal::MainWindow|
source: Ctrl+,
de: Strg +,

# Core::Internal::OutputPaneManager|
source: Ctrl+9
de: Strg + 9

# Core::Internal::SettingsDialog|
source: Options
de: Optionen
es: Opciones

# ExtensionSystem::Internal::PluginDetailsView|
source: Description:
de: Beschreibung:
es: Descripción:

# JsEditorTools::JSEditorMenuItems|
source: &Copy
de: & Kopieren

# QmlJS::PluginDumper|
source: Arguments: %1
de: Argumente:%1
es: Argumentos:%1

# QmlJSEditor::FindReferences|
source: QML/JS Usages:
de: QML / JS Verbräuche:
es: QML / JS Usos:

# QmlJSEditor::Internal::QmlJSEditorPlugin|
source: Find Usages
de: Suche Verwendungen
es: Encuentra Usos

# QmlParser|
source: Unexpected token `%1'
de: Unerwartete Zeichen `%1 '
es: Símbolo inesperado `%1 '

# TextEditor::BaseTextEditorWidget|
source: CTRL+D
de: STRG + D

# TextEditor::FontSettingsPage|
source: Color Scheme Changed
de: Farbschema geändert
es: Combinación de colores Cambiado

# TextEditor::FunctionHintProposalWidget|
source: %1 of %2
de: %1 von%2
es: %1 %2 de

# TextEditor::Internal::FontSettingsPage|
source: Antialias
de: Antialiasing
es: Suavizar

# TextEditor::Internal::FontSettingsPage|
source: Color Scheme
de: Farbschema
es: Combinación de Colores

# TextEditor::Internal::SnippetsTableModel|
source: Trigger Variant
de: Trigger-Variante
es: Gatillo Variant

# TextEditor::TextEditorActionHandler|
source: Cut &Line
de: Cut & Linie

# TextEditor::TextEditorActionHandler|
source: Ctrl+Ins
de: Strg + Einfg

# TextEditor::TextEditorActionHandler|
source: Ctrl+{
de: Strg + {

# TextEditor::TextEditorActionHandler|
source: Ctrl+}
de: Strg +}

# TextEditor::TextEditorActionHandler|
source: Ctrl+J
de: Strg + J

# TextEditor::TextEditorActionHandler|
source: Ctrl+E, F2
de: Strg + E, F2

# TextEditor::TextEditorActionHandler|
source: Ctrl+I
de: Strg + I

# TextEditor::TextEditorActionHandler|
source: Ctrl+E, R
de: Strg + E, R

# TextEditor::TextEditorActionHandler|
source: Ctrl+E, Ctrl+V
de: Strg + E, Strg + V

# TextEditor::TextEditorActionHandler|
source: Ctrl+E, Ctrl+W
de: Strg + E, Strg + W

# TextEditor::TextEditorActionHandler|
source: Ctrl+/
de: Strg + /

# TextEditor::TextEditorActionHandler|
source: Ctrl+<
de: Strg + <

# TextEditor::TextEditorActionHandler|
source: Ctrl+>
de: Strg +>

# TextEditor::TextEditorActionHandler|
source: Ctrl++
de: Strg ++

# TextEditor::TextEditorActionHandler|
source: Ctrl+-
de: Strg + -

# TextEditor::TextEditorActionHandler|
source: Ctrl+0
de: Strg + 0

# TextEditor::TextEditorActionHandler|
source: Ctrl+[
de: Strg + [

# TextEditor::TextEditorActionHandler|
source: Ctrl+]
de: Strg +]

# TextEditor::TextEditorActionHandler|
source: Ctrl+U
de: Strg + U
es: Ctrl + T

# TextEditor::TextEditorSettings|
source: Type
de: Art
es: Tipo

# TextEditor::TextEditorSettings|
source: Local
de: Lokal

# Utils::NewClassWidget|
source: Inherits QDeclarativeItem - Qt Quick 1
de: Erbt QDeclarativeItem - Qt Quick-1
es: Hereda QDeclarativeItem - Qt Quick 1
