Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# QmlJS::StaticAnalysisMessages|
source: Unterminated non-empty case block.
de: Nicht abgeschlossene nichtleeren Fall Block.
es: Bloque case no vacía sin terminar.
fr: Non terminée non vide cas bloc.

# QmlJS::StaticAnalysisMessages|
source: Do not use 'eval'.
de: Verwenden Sie keine 'eval'.
es: No utilice 'eval'.
fr: Ne pas utiliser 'eval'.

# QmlJS::StaticAnalysisMessages|
source: Unreachable.
de: Nicht erreichbar.
es: Inalcanzable.
fr: Inaccessible.

# QmlJS::StaticAnalysisMessages|
source: Do not use 'with'.
de: Verwenden Sie nicht 'durch'.
es: No utilice 'con'.
fr: Ne utilisez pas «avec».

# QmlJS::StaticAnalysisMessages|
source: Do not use comma expressions.
de: Verwenden Sie keine Kommas Ausdrücke.
es: No utilice expresiones comas.
fr: Ne pas utiliser des expressions par des virgules.

# QmlJS::StaticAnalysisMessages|
source: '%1' already is a formal parameter.
de: '%1' ist bereits ein Formalparameter.
es: '%1' ya es un parámetro formal.
fr: '%1' est déjà un paramètre formel.

# QmlJS::StaticAnalysisMessages|
source: Unnecessary message suppression.
de: Unnötige Meldungsunterdrückung.
es: La eliminación de mensajes innecesarios.
fr: Inhibition des messages inutiles.

# QmlJS::StaticAnalysisMessages|
source: '%1' already is a function.
de: '%1' bereits eine Funktion.
es: '%1' ya es una función.
fr: '%1' est déjà une fonction.

# QmlJS::StaticAnalysisMessages|
source: var '%1' is used before its declaration.
de: var '%1' wird, bevor seine Erklärung verwendet.
es: var '%1' se utiliza antes de su declaración.
fr: var '%1' est utilisé avant sa déclaration.

# QmlJS::StaticAnalysisMessages|
source: '%1' already is a var.
de: '%1' ist bereits ein var.
es: '%1' ya es una var.
fr: '%1' est déjà un var.

# QmlJS::StaticAnalysisMessages|
source: '%1' is declared more than once.
de: '%1' ist mehr als einmal erklärt.
es: '%1' se declara más de una vez.
fr: '%1' est déclaré plus d'une fois.

# QmlJS::StaticAnalysisMessages|
source: Function '%1' is used before its declaration.
de: Funktion '%1' ist, bevor seine Erklärung verwendet.
es: Función '%1' se utiliza antes de su declaración.
fr: La fonction '%1' est utilisé avant sa déclaration.

# QmlJS::StaticAnalysisMessages|
source: The 'function' keyword and the opening parenthesis should be separated by a single space.
de: Die 'Funktion' Keyword und die öffnende Klammer sollten durch ein Leerzeichen getrennt sein.
es: La palabra clave 'función' y el paréntesis de apertura deben estar separados por un solo espacio.
fr: Le mot clé «de fonction» et la parenthèse d'ouverture doivent être séparés par un seul espace.

# QmlJS::StaticAnalysisMessages|
source: Do not use stand-alone blocks.
de: Verwenden Sie keine eigenständige Blöcke.
es: No utilice bloques independientes.
fr: Ne pas utiliser des blocs autonomes.

# QmlJS::StaticAnalysisMessages|
source: Do not use void expressions.
de: Verwenden Sie keine Lücke Ausdrücke.
es: No utilice expresiones vacías.
fr: Ne pas utiliser des expressions vides.

# QmlJS::StaticAnalysisMessages|
source: Confusing pluses.
de: Verwirrende Pluspunkte.
es: Ventajas confuso.
fr: Avantages confusion.

# QmlJS::StaticAnalysisMessages|
source: Confusing minuses.
de: Verwirrende Minus.
es: Sus menos confuso.
fr: Inconvénients confusion.

# QmlJS::StaticAnalysisMessages|
source: Declare all function vars on a single line.
de: Deklarieren Sie alle Funktion vars in einer einzigen Zeile.
es: Declarar todos los vars de función en una sola línea.
fr: Déclarez toutes les vars de fonction sur une seule ligne.

# QmlJS::StaticAnalysisMessages|
source: Unnecessary parentheses.
de: Unnötige Klammern.
es: Paréntesis innecesarios.
fr: Parenthèses inutiles.

# QmlJS::StaticAnalysisMessages|
source: == and != may perform type coercion, use === or !== to avoid it.
de: == Und! = Können Typumwandlung durchzuführen, verwenden === oder! ==, Es zu vermeiden.
es: == Y! = Puede realizar conversión de tipos, utilice === o! == Para evitarlo.
fr: == Et! = Peut effectuer la coercition de type, utiliser === ou! == Pour l'éviter.

# QmlJS::StaticAnalysisMessages|
source: Expression statements should be assignments, calls or delete expressions only.
de: Expression Aussagen sind Aufgaben, Anrufe oder nur löschen Ausdrücke.
es: Declaraciones de expresión deben ser las tareas, llamadas o borrar expresiones solamente.
fr: déclarations d'expression doivent être affectations, appels ou supprimer expressions seulement.

# QmlJS::StaticAnalysisMessages|
source: Place var declarations at the start of a function.
de: Zeigen var-Deklarationen am Anfang einer Funktion.
es: Coloque declaraciones var en el inicio de una función.
fr: Placez déclarations var au début d'une fonction.

# QmlJS::StaticAnalysisMessages|
source: Use only one statement per line.
de: Verwenden Sie nur eine Anweisung pro Zeile.
es: Utilice una sola declaración por línea.
fr: Utilisez une seule instruction par ligne.

# QmlJS::StaticAnalysisMessages|
source: Unknown component.
de: Unknown Komponente.
es: Componente desconocido.
fr: Composante inconnue.

# QmlJS::StaticAnalysisMessages|
source: Could not resolve the prototype '%1' of '%2'.
de: Den Prototyp '%1' von '%2' konnte nicht aufgelöst werden.
es: No se pudo resolver el prototipo '%1' de '%2'.
fr: Impossible de résoudre le prototype '%1' de '%2'.

# QmlJS::StaticAnalysisMessages|
source: Could not resolve the prototype '%1'.
de: Den Prototyp '%1' konnte nicht aufgelöst werden.
es: No se pudo resolver el prototipo '%1'.
fr: Impossible de résoudre le prototype '%1'.

# QmlJS::StaticAnalysisMessages|
source: Prototype cycle, the last non-repeated component is '%1'.
de: Prototype Zyklus, ist der letzte nicht-wiederholten Komponente '%1'.
es: Ciclo de Prototype, el último componente no repetida es '%1'.
fr: cycle de Prototype, la dernière composante non répétée est '%1'.

# QmlJS::StaticAnalysisMessages|
source: Invalid property type '%1'.
de: Ungültige Objekttyp '%1'.
es: Inválido tipo de propiedad '%1'.
fr: Invalid type de propriété '%1'.

# QmlJS::StaticAnalysisMessages|
source: == and != perform type coercion, use === or !== to avoid it.
de: == Und! = Führen Typumwandlung verwenden === oder! ==, Es zu vermeiden.
es: == Y! = Realizar conversión de tipos, utilice === o! == Para evitarlo.
fr: == Et! = Effectuer la coercition de type, utiliser === ou! == Pour l'éviter.

# QmlJS::StaticAnalysisMessages|
source: Calls of functions that start with an uppercase letter should use 'new'.
de: Anrufe von Funktionen, die mit einem Großbuchstaben beginnen sollte 'neu' zu verwenden.
es: Las llamadas de funciones que comienzan con una letra mayúscula deben utilizar los «nuevos».
fr: Appels de fonctions qui commencent par une lettre majuscule doivent utiliser «nouvelle».

# QmlJS::StaticAnalysisMessages|
source: Use 'new' only with functions that start with an uppercase letter.
de: Verwenden Sie 'neu' nur mit Funktionen, die mit einem Großbuchstaben beginnen.
es: Utilice 'nuevo' sólo con las funciones que comienzan con una letra mayúscula.
fr: Utilisez «nouvelle» uniquement des fonctions qui commencent par une lettre majuscule.

# QmlJS::StaticAnalysisMessages|
source: Use spaces around binary operators.
de: Benutzen Sie Leerzeichen um binäre Operatoren.
es: Use espacios alrededor de los operadores binarios.
fr: Utilisez des espaces autour des opérateurs binaires.

# QmlJS::StaticAnalysisMessages|
source: Unintentional empty block, use ({}) for empty object literal.
de: Unbeabsichtigte leeren Block, Verwendung ({}) für leere Objektliteral.
es: Bloque vacío no intencional, el uso ({}) para vacío objeto literal.
fr: Involontaire bloc vide, l'utilisation ({}) pour vide littéral d'objet.

# QmlJS::StaticAnalysisMessages|
source: Use %1 instead of 'var' or 'variant' to improve performance.
de: Verwenden Sie%1 anstelle von 'var' oder 'Variante', um die Leistung zu verbessern.
es: Use%1 en vez de 'var' o 'variante' para mejorar el rendimiento.
fr: Utilisez%1 au lieu de «var» ou «variante» pour améliorer les performances.

# QmlJS::StaticAnalysisMessages|
source: Missing property '%1'.
de: Fehlende Eigenschaft '%1'.
es: Propiedad Missing '%1'.
fr: Biens manquants '%1'.

# QmlJS::StaticAnalysisMessages|
source: Object value expected.
de: Objektwert erwartet.
es: Valor de objeto esperado.
fr: Valeur de l'objet prévu.

# QmlJS::StaticAnalysisMessages|
source: Array value expected.
de: Array-Wert erwartet.
es: Valor de matriz esperado.
fr: Valeur de tableau prévu.

# QmlJS::StaticAnalysisMessages|
source: %1 value expected.
de: %1 Wert erwartet.
es: Valor %1 esperado.
fr: %1valeur attendue.

# QmlJS::StaticAnalysisMessages|
source: Maximum number value is %1.
de: Maximale Anzahl Wert ist%1.
es: Número máximo valor es%1.
fr: La valeur maximale de nombre est%1.

# QmlJS::StaticAnalysisMessages|
source: Minimum number value is %1.
de: Mindestanzahl Wert ist%1.
es: Valor Número mínimo es%1.
fr: Valeur de nombre minimum est %1.

# QmlJS::StaticAnalysisMessages|
source: Maximum number value is exclusive.
de: Maximale Anzahl Wert ist exklusiv.
es: Valor máximo número es exclusivo.
fr: La valeur maximale de nombre est exclusive.

# QmlJS::StaticAnalysisMessages|
source: Minimum number value is exclusive.
de: Mindestanzahl Wert ist exklusiv.
es: Valor Número mínimo es exclusiva.
fr: Valeur de nombre minimum est exclusive.

# QmlJS::StaticAnalysisMessages|
source: String value does not match required pattern.
de: String-Wert entspricht nicht erforderliche Muster.
es: Valor de la cadena no coincide con el patrón requerido.
fr: Valeur de chaîne ne correspond pas motif requis.

# QmlJS::StaticAnalysisMessages|
source: Minimum string value length is %1.
de: Mindest Zeichenfolge Länge ist%1.
es: Longitud mínima de valor de la cadena es%1.
fr: Longueur minimale de valeur de chaîne est%1.

# QmlJS::StaticAnalysisMessages|
source: Maximum string value length is %1.
de: Maximale String-Wert Länge ist%1.
es: Longitud máxima de valor de la cadena es%1.
fr: Longueur maximale de valeur de chaîne est%1.

# QmlJS::StaticAnalysisMessages|
source: %1 elements expected in array value.
de: %1 Elemente in Array-Wert erwartet.
es: %1 elementos espera en valor de la matriz.
fr: %1 éléments attendus en valeur de tableau.

# QmlJS::StaticAnalysisMessages|
source: Imperative code is not supported in the Qt Quick Designer.
de: Unerlässlich Code nicht in der Qt Schnell Designer unterstützt.
es: Código imperativo no se admite en el diseñador de Qt Quick.
fr: Code impératif est pas pris en charge dans le Qt Quick Designer.

# QmlJS::StaticAnalysisMessages|
source: This type is not supported in the Qt Quick Designer.
de: Diese Art ist nicht in der Qt Schnell Designer unterstützt.
es: Este tipo no está soportado en el diseñador de Qt Quick.
fr: Ce type ne est pas supporté dans le Qt Quick Designer.

# QmlJS::StaticAnalysisMessages|
source: Reference to parent item cannot be resolved correctly by the Qt Quick Designer.
de: Verweis auf übergeordnete Element kann nicht korrekt von der Qt Designer Schnell gelöst werden.
es: Referencia al elemento padre no puede ser resuelto correctamente por el Diseñador Qt Quick.
fr: Référence à l'objet parent ne peut pas être résolu correctement par le Qt Quick Designer.

# QmlJS::StaticAnalysisMessages|
source: This visual property binding cannot be evaluated in the local context and might not show up in Qt Quick Designer as expected.
de: Diese visuelle Eigenschaft Bindung nicht im lokalen Kontext bewertet werden und kann nicht zeigen, bis in Qt Quick-Designer wie erwartet.
es: Esta propiedad visual vinculante no puede ser evaluado en el contexto local y podría no aparecer en Qt Designer rápido como se esperaba.
fr: Cette liaison propriété visuelle ne peut être évaluée dans le contexte local et pourrait ne pas apparaître dans Qt Quick Designer comme prévu.

# QmlJS::StaticAnalysisMessages|
source: Qt Quick Designer only supports states in the root item.
de: Qt Quick-Designer unterstützt nur Zustände in der Root-Element.
es: Qt Designer rápida sólo apoya a los Estados en el elemento raíz.
fr: Qt Quick Designer prend en charge uniquement les Etats dans l'élément racine.

# QmlJS::StaticAnalysisMessages|
source: Using Qt Quick 1 code model instead of Qt Quick 2.
de: Mit Qt Quick-1-Codemodell anstelle von Qt Quick 2.
es: El uso de Qt Quick modelo 1 código en lugar de Qt Quick 2.
fr: En utilisant Qt Quick modèle 1 de code au lieu de Qt Quick 2.

# QmlJS::TypeDescriptionReader|
source: Errors while loading qmltypes from %1: %2
de: Fehler beim Laden qmltypes von%1: %2
es: Errores mientras qmltypes de carga de %1: %2
fr: Erreurs lors qmltypes de chargement de %1: %2

# QmlJS::TypeDescriptionReader|
source: Warnings while loading qmltypes from %1: %2
de: Warnungen beim Laden qmltypes von%1: %2
es: Precauciones durante qmltypes de carga de %1: %2
fr: Avertissements tout en qmltypes de chargement de %1: %2

# QmlJS::TypeDescriptionReader|
source: Could not parse document.
de: Konnte nicht analysiert Dokument.
es: No se pudo analizar el documento.
fr: Impossible d'analyser le document.

# QmlJS::TypeDescriptionReader|
source: Expected a single import.
de: Erwartet einen einzelnen Import.
es: Se espera una sola importación.
fr: Attendu une seule importation.

# QmlJS::TypeDescriptionReader|
source: Expected import of QtQuick.tooling.
de: Erwartete Import von QtQuick.tooling.
es: Importación prevista de QtQuick.tooling.
fr: L'importation prévue de QtQuick.tooling.

# QmlJS::TypeDescriptionReader|
source: Major version different from 1 not supported.
de: Hauptversion unterscheidet sich von 1 nicht unterstützt.
es: Major versión diferente de 1 no es compatible.
fr: Version majeure différente de 1 pas pris en charge.

# QmlJS::TypeDescriptionReader|
source: Reading only version 1.1 parts.
de: Lesen nur Version 1.1 Teile.
es: Lectura única versión 1.1 partes.
fr: Lecture seule version 1,1 pièces.

# QmlJS::TypeDescriptionReader|
source: Expected document to contain a single object definition.
de: Erwartete Dokument, um eine einzelne Objektdefinition enthalten.
es: Se espera que el documento contiene una única definición de objeto.
fr: Le document devrait contenir une définition d'objet unique.

# QmlJS::TypeDescriptionReader|
source: Expected document to contain a Module {} member.
de: Erwartete Dokument, um ein Modul {} Glied enthalten.
es: Se espera que el documento contiene un módulo {} miembro.
fr: Le document devrait contenir un module {} membre.

# QmlJS::TypeDescriptionReader|
source: Expected only Component and ModuleApi object definitions.
de: Erwartete nur Komponenten und ModuleApi Objektdefinitionen.
es: Esperados sólo definiciones de objetos de componentes y ModuleApi.
fr: Attendus seulement définitions d'objets composants et ModuleApi.

# QmlJS::TypeDescriptionReader|
source: Expected only Property, Method, Signal and Enum object definitions, not '%1'.
de: Erwartete nur Eigenschaften, Methoden Signal und Enum Objektdefinitionen, nicht '%1'.
es: Definiciones de objetos sólo propiedad, método de señal y Enum esperados, no '%1'.
fr: Attendus définitions d'objets que propriété, une méthode de signalisation et de Enum, pas '%1'.

# QmlJS::TypeDescriptionReader|
source: Expected only name, prototype, defaultProperty, attachedType, exports isSingleton, isCreatable, isComposite and exportMetaObjectRevisions script bindings, not '%1'.
de: Erwartete einzige Name, Prototyp, Defaultproperty, attachedType Exporte isSingleton, isCreatable, isComposite und exportMetaObjectRevisions Skript Bindungen, nicht '%1'.
es: Esperado único nombre, prototipo, DefaultProperty, attachedType, las exportaciones isSingleton, isCreatable, isComposite y scripts exportMetaObjectRevisions fijaciones, no '%1'.
fr: Attendu seul nom, prototype, defaultProperty, attachedType, les exportations isSingleton, isCreatable, isComposite et de script de exportMetaObjectRevisions fixations, pas '%1'.

# QmlJS::TypeDescriptionReader|
source: Expected only script bindings and object definitions.
de: Erwartete nur Skript Bindungen und Objektdefinitionen.
es: Esperado sólo enlaces de guión y definiciones de objetos.
fr: Prévue seulement fixations de script et des définitions d'objets.

# QmlJS::TypeDescriptionReader|
source: Component definition is missing a name binding.
de: Component-Definition wird eine Namensbindung fehlt.
es: Definición de componentes que falta un nombre vinculante.
fr: Définition composant est manquant un nom de liaison.

# QmlJS::TypeDescriptionReader|
source: Expected only uri, version and name script bindings.
de: Erwartete nur uri, Version und Name Skript Bindungen.
es: Esperado sólo uri, la versión y las consolidaciones de script nombre.
fr: Appelés seulement uri, la version et fixations nom de script.

# QmlJS::TypeDescriptionReader|
source: Expected only script bindings.
de: Erwartete nur Skript-Bindungen.
es: Esperados sólo enlaces guión.
fr: Seulement fixations de script attendus.

# QmlJS::TypeDescriptionReader|
source: ModuleApi definition has no or invalid version binding.
de: ModuleApi Definition hat keine oder ungültige Version verbindlich.
es: Definición ModuleApi es nula o inválida versión vinculante.
fr: Définition ModuleApi n'a pas ou contraignant version non valide.

# QmlJS::TypeDescriptionReader|
source: Expected only Parameter object definitions.
de: Erwartete nur Parameter Objektdefinitionen.
es: Esperados definiciones de objeto único parámetro.
fr: Attendus définitions d'objets seul paramètre.

# QmlJS::TypeDescriptionReader|
source: Expected only name and type script bindings.
de: Erwartete nur Name und Typ Skript Bindungen.
es: Único nombre esperado y los enlaces de guión tipo.
fr: Seul nom attendu et fixations de script de type.

# QmlJS::TypeDescriptionReader|
source: Method or signal is missing a name script binding.
de: Verfahren oder Signal einen Namen Skript Bindung fehlt.
es: Método o señal le falta un guión nombre vinculante.
fr: Méthode ou le signal est manquant un nom de script contraignant.

# QmlJS::TypeDescriptionReader|
source: Expected script binding.
de: Erwartete Skript verbindlich.
es: Guión esperado vinculante.
fr: Scénario attendu contraignant.

# QmlJS::TypeDescriptionReader|
source: Expected only type, name, revision, isPointer, isReadonly and isList script bindings.
de: Erwartete nur Typ, Name, Version, isPointer, isReadonly und isList Skript Bindungen.
es: Esperados sólo tipo, nombre, revisión, isPointer, IsReadOnly y isList enlaces guión.
fr: Seul le type, le nom, la révision, isPointer, isReadOnly et IsList fixations de script attendus.

# QmlJS::TypeDescriptionReader|
source: Property object is missing a name or type script binding.
de: Property-Objekt einen Namen fehlen oder Typ Skript verbindlich.
es: Objeto de la propiedad no se encuentra un nombre o vinculante guión tipo.
fr: objet Property manque un nom ou de liaison de type script.

# QmlJS::TypeDescriptionReader|
source: Expected only name and values script bindings.
de: Erwartete Namen und Werte Skript Bindungen.
es: Esperado único nombre y valora las consolidaciones de script.
fr: Attendu que le nom et les valeurs fixations de script.

# QmlJS::TypeDescriptionReader|
source: Expected string after colon.
de: Erwartete Zeichenfolge nach Doppelpunkt.
es: Cadena prevista después de colon.
fr: Chaîne attendue après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected boolean after colon.
de: Erwartete boolean nach Doppelpunkt.
es: Boolean esperado después de colon.
fr: Booléen attendu après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected true or false after colon.
de: Erwartete wahr oder falsch nach Doppelpunkt.
es: Esperado verdadero o falso después de colon.
fr: Prévue vrai ou faux après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected numeric literal after colon.
de: Erwartete Zahlenliteral nach Doppelpunkt.
es: Esperado literal numérico después de colon.
fr: Prévue littéral numérique après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected integer after colon.
de: Erwartete ganze Zahl nach Doppelpunkt.
es: Entero esperaba después de colon.
fr: Entier attendu après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected array of strings after colon.
de: Erwartete Array von Zeichenketten nach dem Doppelpunkt.
es: Gama esperada de cuerdas después de colon.
fr: Gamme prévue des chaînes après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected array literal with only string literal members.
de: Erwartete Arrayliteral nur Zeichenfolgenliteral Mitglieder.
es: Array esperado literal con miembros literales sólo de cuerdas.
fr: Tableau prévue littérale avec seulement cordes membres littérales.

# QmlJS::TypeDescriptionReader|
source: Expected string literal to contain 'Package/Name major.minor' or 'Name major.minor'.
de: Erwartete Zeichenfolgenliteral zu 'Paket / Namens major.minor 'oder' Name major.minor 'enthalten.
es: Cadena prevista literal a contener 'Paquete / Nombre major.minor' o 'Nombre major.minor'.
fr: Chaîne attendue littérale pour contenir 'Package / Nom majeur.mineur »ou« Nom majeur.mineur'.

# QmlJS::TypeDescriptionReader|
source: Expected array of numbers after colon.
de: Erwartete Array von Zahlen nach dem Doppelpunkt.
es: Gama esperada de números después de dos puntos.
fr: Gamme prévue de chiffres au bout du côlon.

# QmlJS::TypeDescriptionReader|
source: Expected array literal with only number literal members.
de: Erwartete Arrayliteral nur Zahlenliteral Mitglieder.
es: Array esperado literal con miembros literales sólo de números.
fr: Tableau prévue littérale avec seulement Nombre membres littérales.

# QmlJS::TypeDescriptionReader|
source: Meta object revision without matching export.
de: Metaobjekt Revision ohne passenden Export.
es: Revisión objeto Meta sin cumplir ninguna exportación.
fr: Objet révision Meta sans exportation correspondant.

# QmlJS::TypeDescriptionReader|
source: Expected integer.
de: Erwartete integer.
es: Entero esperado.
fr: Prévue entier.

# QmlJS::TypeDescriptionReader|
source: Expected object literal after colon.
de: Erwartete Objektliteral nach Doppelpunkt.
es: Objeto esperado literal después de colon.
fr: Objet attendu littérale après côlon.

# QmlJS::TypeDescriptionReader|
source: Expected object literal to contain only 'string: number' elements.
de: Erwartete Objektliteral nur enthalten 'string: number' Elementen.
es: Esperado literal de objeto para contener únicamente: elementos 'cadena de números'.
fr: Prévue littéral d'objet pour contenir seulement: éléments 'string nombre'.

# QmlJS::TypeDescriptionReader|
source: Enum should not contain getter and setters, but only 'string: number' elements.
de: Enum sollten keine Getter und Setter, aber nur 'string: number 'Elementen.
es: Enum no debe contener getter y setters, pero sólo 'de cadena: número de' elementos.
fr: Enum ne doit pas contenir getter et setters, mais seulement «cordes: Numéro 'éléments.

# QmlJSEditor::AddAnalysisMessageSuppressionComment|
source: Add a Comment to Suppress This Message
de: Fügen Sie einen Kommentar zu dieser Meldung zu unterdrücken
es: Añadir un comentario al suprimir este mensaje
fr: Ajouter un commentaire à supprimer ce message

# QmlJSEditor::ComponentFromObjectDef|
source: Move Component into Separate File
de: Bewegen Komponenten in separate Datei
es: Mover componente en archivo independiente
fr: Déplacer le composant en fichier séparé

# QmlJSEditor::FindReferences|
source: Searching
de: Suchen
es: Búsqueda
fr: Recherche

# QmlJSEditor::Internal::ComponentNameDialog|
source: Move Component into Separate File
de: Bewegen Komponenten in separate Datei
es: Mover componente en archivo independiente
fr: Déplacer le composant en fichier séparé

# QmlJSEditor::Internal::ComponentNameDialog|
source: Path:
de: Pfad:
es: Ruta de acceso:
fr: Chemin d'accès:
