Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# ExtensionSystem::Internal::PluginErrorOverview|
source: The following plugins have errors and cannot be loaded:
de: Die folgenden Plugins Fehler und kann nicht geladen werden:
es: Los siguientes plugins tienen errores y no se pueden cargar:
fr: Les plugins suivants ont erreurs et ne peuvent pas être chargés:

# ExtensionSystem::Internal::PluginErrorOverview|
source: Details:
es: Detalles:
fr: Détails:

# ExtensionSystem::Internal::PluginErrorView|
source: State:
de: Status:
es: Estado:
fr: État:

# ExtensionSystem::Internal::PluginErrorView|
source: Error message:
de: Fehlermeldung:
es: Mensaje de error:
fr: Message d'erreur:

# ExtensionSystem::Internal::PluginSpecPrivate|
source: Cannot open file %1 for reading: %2
de: Kann Datei%1 nicht öffnen zum Lesen:%2
es: No se puede abrir el archivo%1 para lectura: %2
fr: Impossible d'ouvrir le fichier%1 pour la lecture: %2

# ExtensionSystem::Internal::PluginSpecPrivate|
source: Error parsing file %1: %2, at line %3, column %4
de: Fehler bei der Analyse der Datei%1:%2 in Zeile%3, Spalte 4%
es: Error al analizar el archivo%1:%2, al %3 de filas, columnas %4
fr: fichier d'analyse d'erreur%1: %2, %3 à la ligne, colonne %4

# ExtensionSystem::PluginDetailsView|
source: None
de: Die Sonne Geht Auf
es: Ninguno
fr: Aucun

# ExtensionSystem::PluginDetailsView|
source: All
de: Alle
es: Todos
fr: Tous

# ExtensionSystem::PluginErrorOverview|
source: Continue
de: Fortsetzen
es: Continuar
fr: Continuer

# ExtensionSystem::PluginErrorView|
source: Invalid
de: Ungültig
es: Inválido
fr: Invalide

# ExtensionSystem::PluginErrorView|
source: Description file found, but error on read.
de: Beschreibung Datei gefunden, aber Fehler auf zu lesen.
es: Descripción archivo encontrado, pero el error de leer.
fr: fichier Description trouvée, mais l'erreur lors de la lecture.

# ExtensionSystem::PluginErrorView|
source: Read
de: Lesen Sie
es: Leer
fr: Lire

# ExtensionSystem::PluginErrorView|
source: Description successfully read.
de: Beschreibung erfolgreich gelesen.
es: Descripción leer correctamente.
fr: Description lu avec succès.

# ExtensionSystem::PluginErrorView|
source: Resolved
de: Entschlossen
es: Resuelto
fr: Résolu

# ExtensionSystem::PluginErrorView|
source: Dependencies are successfully resolved.
de: Abhängigkeiten werden erfolgreich gelöst.
es: Las dependencias se resuelven satisfactoriamente.
fr: Les dépendances sont résolues avec succès.

# ExtensionSystem::PluginErrorView|
source: Loaded
de: Beladen
es: Cargado
fr: Chargé

# ExtensionSystem::PluginErrorView|
source: Library is loaded.
de: Bibliothek geladen.
es: Biblioteca es cargado.
fr: Bibliothèque est chargé.

# ExtensionSystem::PluginErrorView|
source: Initialized
de: Initialisiert
fr: Initialisé

# ExtensionSystem::PluginErrorView|
source: Plugin's initialization function succeeded.
de: Initialisierungsfunktion Plugins gelungen.
es: Función de inicialización del Plugin tuvo éxito.
fr: La fonction d'initialisation de Plugin réussi.

# ExtensionSystem::PluginErrorView|
source: Running
de: Laufen
es: Correr
fr: Course

# ExtensionSystem::PluginErrorView|
source: Plugin successfully loaded and running.
de: Plugin erfolgreich geladen und ausgeführt wird.
es: Plugin éxito cargado y funcionando.
fr: Plugin succès chargé et en cours d'exécution.

# ExtensionSystem::PluginErrorView|
source: Stopped
de: Gestoppt
es: Detenido
fr: Arrêtée

# ExtensionSystem::PluginErrorView|
source: Plugin was shut down.
de: Plugin wurde heruntergefahren.
es: Plugin fue cerrado.
fr: Plugin a été fermé.

# ExtensionSystem::PluginErrorView|
source: Deleted
de: Gelöscht
es: Suprimido
fr: Supprimé

# ExtensionSystem::PluginErrorView|
source: Plugin ended its life cycle and was deleted.
de: Plugin Ende seines Lebenszyklus und wurde gelöscht.
es: Plugin terminó su ciclo de vida y se ha eliminado.
fr: Plugin a terminé son cycle de vie et a été supprimé.

# ExtensionSystem::PluginManager|
source: Circular dependency detected:
de: Ringabhängigkeit festgestellt:
es: Dependencia circular detectado:
fr: Dépendance circulaire détecté:

# ExtensionSystem::PluginManager|
source: %1(%2) depends on
de: %1 (%2) von
es: %1 (%2) depende de
fr: %1 (%2) dépend de

# ExtensionSystem::PluginManager|
source: Cannot load plugin because dependency failed to load: %1(%2) Reason: %3
de: Kann Plugin nicht geladen werden, da die Abhängigkeit nicht geladen werden:%1 (%2) Grund:%3
es: No se puede cargar el plugin porque la dependencia no se pudo cargar:%1 (%2) Origen: %3
fr: Impossible de charger plugin car la dépendance n'a pas pu charger:%1 (%2) Raison: %3

# ExtensionSystem::PluginView|
source: Name
es: Nombre
fr: Nom

# ExtensionSystem::PluginView|
source: Load
de: Last
es: Carga
fr: Charge

# ExtensionSystem::PluginView|
source: Vendor
de: Verkäufer
es: Vendedor
fr: Vendeur

# ExtensionSystem::PluginView|
source: Load on Startup
de: Beim Start laden
es: Cargar al iniciar
fr: Charger au démarrage

# ExtensionSystem::PluginView|
source: Utilities
de: Dienstprogramme
es: Utilidades
fr: Utilitaires

# FontSettings_C_OCCURRENCES_UNUSED|
source: Unused variable
de: Nicht verwendete variable
es: La variable no utilizada
fr: Variables utilisé

# JsEditorTools::JSEditorMenuItems|
source: &New File
de: & Neue Datei
es: Y Nuevo archivo
fr: & Nouveau fichier

# JsEditorTools::JSEditorMenuItems|
source: &Open File
de: & Datei öffnen
es: & Abrir Archivo
fr: & Ouvrir le fichier

# JsEditorTools::JSEditorMenuItems|
source: Save
de: Speichern
es: Guardar
fr: Enregistrer

# JsEditorTools::JSEditorMenuItems|
source: Save &As...
de: Speichern Unter ...
es: Guardar y como ...
fr: Enregistrer & sous ...

# JsEditorTools::JSEditorMenuItems|
source: Ctrl+Shift+S
de: Strg + Umschalt + S
fr: Ctrl + Maj + S

# JsEditorTools::JSEditorMenuItems|
source: Save As...
de: Speichern Unter ...
es: Guardar como ...
fr: Enregistrer sous ...

# JsEditorTools::JSEditorMenuItems|
source: &Undo
de: & Rückgängig
es: Y deshacer
fr: & Annuler

# JsEditorTools::JSEditorMenuItems|
source: Undo
de: Rückgängig machen
es: Deshacer
fr: Annuler

# JsEditorTools::JSEditorMenuItems|
source: Redo
de: Wiederholen
es: Rehacer
fr: Refaire

# JsEditorTools::JSEditorMenuItems|
source: &Paste
de: & Einfügen
fr: & Collez

# JsEditorTools::JSEditorMenuItems|
source: Select &All
de: & Alles auswählen
es: Seleccionar & todo
fr: Sélectionnez & All

# JsEditorTools::JsEditorToolsLib|
source: Find
de: Finden
es: Encontrar
fr: Trouver

# OpenWith::Editors|
source: Plain Text Editor
de: Nur-Text-Editor
es: Editor de Texto sin formato
fr: Éditeur de texte

# OpenWith::Editors|
source: QMLJS Editor
fr: QMLJS éditeur

# PluginManager|
source: The plugin '%1' is specified twice for testing.
de: Das Plugin '%1' wird zweimal für den Test festgelegt.
es: El plug-in '%1' se especifica dos veces para la prueba.
fr: Le plugin '%1' est spécifiée deux fois pour les tests.

# PluginManager|
source: The plugin '%1' does not exist.
de: Das Plugin '%1' ist nicht vorhanden.
es: El plug-in '%1' no existe.
fr: Le plugin '%1' ne existe pas.

# PluginManager|
source: Unknown option %1
de: Unbekannte Option%1
es: Desconocido opción %1
fr: Inconnu l'option%1

# PluginManager|
source: The option %1 requires an argument.
de: Die Option%1 erfordert ein Argument.
es: La opción %1 requiere un argumento.
fr: L'option%1 nécessite un argument.

# PluginSpec|
source: '%1' misses attribute '%2'
de: '%1' misses Attribut '%2'
es: Atribuyen '%1' misses '%2'
fr: '%1' accidents attribut '%2'

# PluginSpec|
source: '%1' has invalid format
de: '%1' hat ein ungültiges Format
es: '%1' tiene un formato no válido
fr: '%1' a format non valide

# PluginSpec|
source: Invalid element '%1'
de: Ungültige Element '%1'
es: Elemento no válido '%1'
fr: Élément non valide '%1'

# PluginSpec|
source: Unexpected closing element '%1'
de: Unerwartete Schließelement '%1'
es: Elemento de cierre inesperado '%1'
fr: Élément de fermeture inattendue '%1'

# PluginSpec|
source: Unexpected token
de: Unerwartetes Token
es: Símbolo inesperado
fr: Jeton inattendu

# PluginSpec|
source: Expected element '%1' as top level element
de: Erwartete Element '%1' als Element der obersten Ebene
es: Elemento esperaba '%1' como elemento de nivel superior
fr: Élément attendu '%1 »comme élément de niveau supérieur

# PluginSpec|
source: Resolving dependencies failed because state != Read
de: Beheben von Abhängigkeiten ist fehlgeschlagen, weil Zustand! = Lesen
es: Resolviendo dependencias fracasaron porque el estado! = Leer
fr: Résoudre les dépendances ont échoué parce que l'état! = Lire

# PluginSpec|
source: Could not resolve dependency '%1(%2)'
de: Abhängigkeit konnte nicht aufgelöst werden '%1 (%2)'
es: No se pudo resolver la dependencia '%1 (%2) '
fr: Impossible de résoudre la dépendance '%1 (%2)'

# PluginSpec|
source: Loading the library failed because state != Resolved
de: Lädt die Bibliothek ist fehlgeschlagen, weil Zustand! = Gelöst
es: Carga de la biblioteca ha fallado porque el estado! = Resuelto
fr: Chargement de la bibliothèque a échoué parce que l'état! = Résolu

# PluginSpec|
source: Plugin is not valid (does not derive from IPlugin)
de: Plugin nicht gültig ist (nicht von IPlugin ableiten)
es: Plugin no es válido (no se deriva de IPlugin)
fr: Plugin ne est pas valide (ne découle pas de IPlugin)

# PluginSpec|
source: Initializing the plugin failed because state != Loaded
de: Initialisieren des Plugin ist fehlgeschlagen, weil Zustand! = Loaded
es: Inicializando el plugin falló porque! Estado = Loaded
fr: Initialisation le plugin a échoué parce que l'état! = Loaded

# PluginSpec|
source: Internal error: have no plugin instance to initialize
de: Interner Fehler: keinen Plugin-Instanz zu initialisieren
es: Error interno: no tienen ninguna instancia del complemento para inicializar
fr: Erreur interne: ne ont pas de plug-in exemple pour initialiser

# PluginSpec|
source: Plugin initialization failed: %1
de: Plugin-Initialisierung fehlgeschlagen:%1
es: Inicialización Plugin fallado:%1
fr: Plugin initialisation a échoué:%1

# PluginSpec|
source: Cannot perform extensionsInitialized because state != Initialized
de: Kann extensionsInitialized nicht ausführen, da Staat! = Initialisiert
es: No se puede realizar porque extensionsInitialized estado! = Inicializar
fr: Impossible d'effectuer extensionsInitialized parce Etat! = Initialisé

# PluginSpec|
source: Internal error: have no plugin instance to perform extensionsInitialized
de: Interner Fehler: keinen Plugin-Instanz extensionsInitialized führen
es: Error interno: no tienen instancia plugin para realizar extensionsInitialized
fr: Erreur interne: aucune instance plug-in pour effectuer extensionsInitialized

# PluginSpec|
source: Internal error: have no plugin instance to perform delayedInitialize
de: Interner Fehler: keinen Plugin-Instanz delayedInitialize führen
es: Error interno: no tienen instancia plugin para realizar delayedInitialize
fr: Erreur interne: aucune instance plug-in pour effectuer delayedInitialize

# ProjectExplorer::BuildableHelperLibrary|
source: Cannot start process: %1
de: Kann nicht starten Prozess:%1
es: No se puede iniciar el proceso:%1
fr: Processus ne peut pas démarrer: %1

# ProjectExplorer::BuildableHelperLibrary|
source: Timeout after %1s.
de: Timeout nach%1s.
es: Tiempo de espera después de%1s.
fr: Timeout après%1s.

# ProjectExplorer::BuildableHelperLibrary|
source: The process crashed.
de: Der Prozess ist abgestürzt.
es: El proceso se estrelló.
fr: Le processus se est écrasé.

# ProjectExplorer::BuildableHelperLibrary|
source: The process returned exit code %1: %2
de: Der Prozess zurückExitCode%1: %2
es: El proceso de regresar código de salida%1: %2
fr: Le processus code de sortie retourné%1: %2

# ProjectExplorer::BuildableHelperLibrary|
source: Error running '%1' in %2: %3
de: Fehler beim Ausführen der '%1' in%2:%3
es: Error al ejecutar '%1' en%2:%3
fr: Erreur de la '%1'%2:%3

# ProjectExplorer::BuildableHelperLibrary|
source: Building helper '%1' in %2
de: Gebäude Helfer '%1' in%2
es: Ayudante de construcción '%1' en%2
fr: Bâtiment aide '%1' %2

# ProjectExplorer::BuildableHelperLibrary|
source: Running %1 %2...
de: Laufende %1 %2 ...
es: Correr %1 %2 ...
fr: Courir %1 %2 ...

# ProjectExplorer::BuildableHelperLibrary|
source: Running %1 %2 ...
de: Laufende %1 %2 ...
es: Correr %1 %2 ...
fr: Courir %1 %2 ...

# ProjectExplorer::BuildableHelperLibrary|
source: %1 not found in PATH
de: %1 nicht in PATH gefunden
es: %1 no encontrado en el PATH
fr: %1 ne trouve pas dans PATH

# ProjectExplorer::DebuggingHelperLibrary|
source: The target directory %1 could not be created.
de: Das Zielverzeichnis%1 konnte nicht erstellt werden.
es: El directorio de destino%1 no pudo ser creada.
fr: Le répertoire cible%1 n'a pas pu être créé.

# ProjectExplorer::DebuggingHelperLibrary|
source: The existing file %1 could not be removed.
de: Die vorhandene Datei%1 konnte nicht entfernt werden.
es: El archivo%1 existente no puede ser eliminado.
fr: Le fichier existant%1 n'a pas pu être supprimé.

# ProjectExplorer::DebuggingHelperLibrary|
source: The file %1 could not be copied to %2.
de: Die Datei%1 konnte nicht nach%2 kopiert werden.
es: El archivo%1 no se pudo copiar al %2.
fr: Le fichier%1 n'a pas pu être copié sur %2.

# ProjectExplorer::DebuggingHelperLibrary|
source: %1 not found in PATH
de: %1 nicht in PATH gefunden
es: %1 no encontrado en el PATH
fr: %1 ne trouve pas dans PATH

# QmlJS::Bind|
source: expected two numbers separated by a dot
de: erwartet zwei Zahlen getrennt durch einen Punkt
es: espera que dos números separados por un punto
fr: escomptés deux nombres séparés par un point

# QmlJS::Bind|
source: package import requires a version number
de: Package-Import erfordert eine Versionsnummer
es: paquete de importación requiere un número de versión
fr: package importation nécessite un numéro de version

# QmlJS::Check|
source: 'int' or 'real'
de: 'Int' oder 'echten'
es: 'Int' o 'real'
fr: 'Int »ou« réel »

# QmlJS::Link|
source: file or directory not found
de: Datei oder Verzeichnis nicht gefunden
es: archivo o directorio no encontrado
fr: fichier ou répertoire introuvable

# QmlJS::Link|
source: QML module not found Import paths: %1 For qmake projects, use the QML_IMPORT_PATH variable to add import paths. For qmlproject projects, use the importPaths property to add import paths.
de: 1 Für qmake-Projekten, verwenden Sie die QML_IMPORT_PATH Variable Import Pfade hinzufügen Für qmlproject Projekte, verwenden Sie die Eigenschaft auf importPaths Import Pfade hinzufügen %. QML-Modul nicht gefunden Import Wege.
es: Módulo QML no encontró caminos Importar: %1 proyectos Por qmake, utilice la variable QML_IMPORT_PATH para añadir rutas de importación Por proyectos qmlproject, utilice la propiedad importPaths para añadir rutas de importación..
fr: Module QML introuvable chemins Importer: %1 des projets qmake Pour, utilisez la variable d'QML_IMPORT_PATH pour ajouter des chemins d'importation projects nPour qmlproject, utilisez la propriété importPaths pour ajouter des chemins d'importation..

# QmlJS::Link|
source: QML module contains C++ plugins, currently reading type information...
de: QML-Modul enthält C ++ Plugins, gerade lesen Typ Informationen ...
es: Módulo QML contiene plugins C ++, actualmente leyendo la información de tipo ...
fr: Module QML contient les plugins de C, en train de lire les informations de type ...

# QmlJS::ModelManagerInterface|
source: Indexing
de: Indizierung
es: Indexación
fr: Indexage

# QmlJS::ModelManagerInterface|
source: QML import scan
es: Exploración importación QML
fr: Scan d'importation QML

# QmlJS::PluginDumper|
source: QML module does not contain information about components contained in plugins. Module path: %1 See "Using QML Modules with Plugins" in the documentation.
de: QML Modul enthält keine Informationen über in Plugins enthaltenen Komponenten Module Pfad:.%1 Siehe "Mit QML Module mit Plugins " in der Dokumentation.
es: Módulo QML no contiene información acerca de los componentes contenidos en plugins ruta Module:.%1 Consulte "Uso de módulos QML con Plugins " en la documentación.
fr: Module QML ne contient pas d'informations sur les composants contenus dans plugins chemin Module:.%1 Voir "Utilisation des modules QML avec Plugins " dans la documentation.

# QmlJS::PluginDumper|
source: Automatic type dump of QML module failed. Errors: %1
de: Automatische Typ-Dump der QML-Modul ist fehlgeschlagen Errors:. %1
es: Volcado de tipo automática de módulo QML falló Errors:. %1
fr: Type vidage automatique du module de QML échoué Errors:. %1

# QmlJS::PluginDumper|
source: Automatic type dump of QML module failed. First 10 lines or errors: %1 Check 'General Messages' output pane for details.
de: Automatische Typ-Dump der QML-Modul ist fehlgeschlagen first 10 Zeilen oder Fehler. %1 Überprüfen 'Allgemeine Meldungen' Ausgabebereich für Details.
es: Volcado de tipo automática de módulo QML falló first 10 líneas o errores:. 'general Mensajes' panel de salida%1 Compruebe para más detalles.
fr: Type vidage automatique du module de QML échoué first 10 lignes ou des erreurs:. 'général' Messages sortie volet%1 Vérifiez pour plus de détails.

# QmlJS::PluginDumper|
source: Warnings while parsing QML type information of %1: %2
de: Warnungen beim Parsen QML Typinformationen von%1: %2
es: Advertencias al analizar información de tipo QML de%1: %2
fr: Avertissements lors de l'analyse des informations de type QML de%1: %2

# QmlJS::PluginDumper|
source: "%1" failed to start: %2
de: "%1 " konnte nicht gestartet werden:%2
es: "%1 " no se pudo iniciar:%2
fr: "%1 " n'a pas pu démarrer: %2

# QmlJS::PluginDumper|
source: "%1" crashed.
de: "%1 " abgestürzt.
es: "%1 " se estrelló.
fr: "%1 " se est écrasé.

# QmlJS::PluginDumper|
source: "%1" timed out.
de: "%1 " Zeitüberschreitung.
es: "%1 " el tiempo de espera.
fr: "%1 " expiré.

# QmlJS::PluginDumper|
source: I/O error running "%1".
de: I / O-Fehler laufen "%1 ".
es: Error de E / S ejecutando "%1 ".
fr: I / O error exécutant "%1".

# QmlJS::PluginDumper|
source: "%1" returned exit code %2.
de: "%1 " zurück Exit-Code%2.
es: "%1 " salida devuelto%2.
fr: "%1" sortie renvoyé %2.

# QmlJS::PluginDumper|
source: Failed to parse '%1'. Error: %2
de: . Fehler beim Parsen '%1' Error:%2
es: . No se pudieron analizar '%1' Error:%2
fr: . Raté pour analyser '%1' Erreur: %2

# QmlJS::PluginDumper|
source: Errors while reading typeinfo files:
de: Fehler beim Lesen der Typeinfo-Dateien:
es: Errores durante la lectura typeinfo archivos:
fr: Erreurs en lisant typeinfo fichiers:

# QmlJS::PluginDumper|
source: Could not locate the helper application for dumping type information from C++ plugins. Please build the qmldump application on the Qt version options page.
de: Konnte nicht lokalisiert das Hilfsprogramm für die Dumping-Typinformationen von C ++ Plugins. Bitte bauen das qmldump Anwendung auf dem Qt-Version der Seite Optionen.
es: No se pudo localizar la aplicación de ayuda para obtener información de tipo de dumping de C ++ plugins. Por favor, construir la aplicación qmldump en la página de opciones de la versión Qt.
fr: Impossible de localiser l'application d'aide pour obtenir des informations de type de dumping de C ++ plugins. Veuillez construire l'application de qmldump sur la page des options de la version Qt.

# QmlJS::QrcParser|
source: XML error on line %1, col %2: %3
de: XML-Fehler in Zeile%1, Spalte%2:%3
es: Error XML en la línea%1, col%2:%3
fr: erreur de XML sur la ligne%1, col%2:%3

# QmlJS::QrcParser|
source: The <RCC> root element is missing.
de: Die <RCC> Stammelement fehlt.
es: El <RCC> elemento raíz no se encuentra.
fr: Le <RCC> élément racine est manquant.

# QmlJS::SimpleAbstractStreamReader|
source: Cannot find file %1.
de: Kann nicht finden, Datei%1.
es: No se puede encontrar el archivo%1.
fr: Vous ne trouvez pas le fichier%1.

# QmlJS::SimpleAbstractStreamReader|
source: Could not parse document.
de: Konnte nicht analysiert Dokument.
es: No se pudo analizar el documento.
fr: Impossible d'analyser le document.

# QmlJS::SimpleAbstractStreamReader|
source: Expected document to contain a single object definition.
de: Erwartete Dokument, um eine einzelne Objektdefinition enthalten.
es: Se espera que el documento contiene una única definición de objeto.
fr: Le document devrait contenir une définition d'objet unique.

# QmlJS::SimpleAbstractStreamReader|
source: Expected expression statement after colon.
de: Erwartete Ausdruck Anweisung nach Doppelpunkt.
es: Declaración de la expresión prevista después de colon.
fr: Prévue déclaration d'expression après côlon.

# QmlJS::SimpleAbstractStreamReader|
source: Expected expression statement to be a literal.
de: Erwartete Ausdrucksanweisung zu sein, buchstäblich.
es: Declaración de la expresión Se espera que sea un literal.
fr: Déclaration d'expression devrait être un littéral.

# QmlJS::SimpleReader|
source: Property is defined twice.
de: Das Eigentum ist zweimal definiert.
es: Los bienes se definen dos veces.
fr: La propriété est défini deux fois.

# QmlJS::StaticAnalysisMessages|
source: Do not use '%1' as a constructor.
de: Verwenden Sie '%1' als Konstrukteur.
es: No utilice '%1' como constructor.
fr: Ne pas utiliser '%1' en tant que constructeur.

# QmlJS::StaticAnalysisMessages|
source: Invalid value for enum.
de: Ungültiger Wert für Enum.
es: Valor no válido para enumeración.
fr: Valeur incorrecte pour énumération.

# QmlJS::StaticAnalysisMessages|
source: Enum value must be a string or a number.
de: Enum-Wert muss ein String oder eine Zahl sein.
es: Enum valor debe ser una cadena o un número.
fr: valeur Enum doit être une chaîne ou un nombre.

# QmlJS::StaticAnalysisMessages|
source: Number value expected.
de: Zahlenwert erwartet.
es: Número valor esperado.
fr: valeur de Nombre prévu.

# QmlJS::StaticAnalysisMessages|
source: Boolean value expected.
de: Booleschen Wert erwartet.
es: Valor booleano esperado.
fr: Valeur booléenne prévu.

# QmlJS::StaticAnalysisMessages|
source: String value expected.
de: String-Wert erwartet.
es: Valor de la cadena espera.
fr: Valeur de chaîne prévu.

# QmlJS::StaticAnalysisMessages|
source: Invalid URL.
de: Die angegebene URL.
es: URL no válida.
fr: URL invalide.

# QmlJS::StaticAnalysisMessages|
source: File or directory does not exist.
de: Datei oder Verzeichnis nicht vorhanden ist.
es: Archivo o directorio no existe.
fr: Fichier ou répertoire ne existe pas.

# QmlJS::StaticAnalysisMessages|
source: Invalid color.
de: Ungültige Farbe.
es: Color no válido.
fr: Couleur incorrecte.

# QmlJS::StaticAnalysisMessages|
source: Anchor line expected.
de: Ankerleine erwartet.
es: Línea de fondeo previsto.
fr: Ligne de mouillage prévu.

# QmlJS::StaticAnalysisMessages|
source: Duplicate property binding.
de: Doppelte Eigenschaft bindend.
es: Duplicar propiedad de unión.
fr: Dupliquer propriété de liaison.

# QmlJS::StaticAnalysisMessages|
source: Id expected.
de: Id erwartet.
es: Id esperado.
fr: Id prévu.

# QmlJS::StaticAnalysisMessages|
source: Invalid id.
de: Ungültige ID.
es: Identificación válida.
fr: Id valide.

# QmlJS::StaticAnalysisMessages|
source: Duplicate id.
de: Doppelte ID.
es: Identificación Duplicar.
fr: Id Dupliquer.

# QmlJS::StaticAnalysisMessages|
source: Invalid property name '%1'.
de: Ungültiger Eigenschaftsname '%1'.
es: Nombre de la propiedad no válido '%1'.
fr: Invalid nom '%1' de la propriété.

# QmlJS::StaticAnalysisMessages|
source: '%1' does not have members.
de: '%1' hat keine Mitglieder.
es: '%1' no tiene miembros.
fr: '%1' n'a pas de membres.

# QmlJS::StaticAnalysisMessages|
source: '%1' is not a member of '%2'.
de: '%1' ist kein Mitglied von '%2'.
es: '%1' no es un miembro de '%2'.
fr: '%1' ne est pas un membre de '%2'.

# QmlJS::StaticAnalysisMessages|
source: Assignment in condition.
de: Belegung im Zustand.
es: Asignación de condición.
fr: Affectation en état.
