Repository: ExorInternational/jseditor
Catalog: TestApp/src/libs/jseditortools/translations/po_files/jseditortools_*.po
Languages: de, es, fr

# Core|
source: Environment
de: Umgebung
es: Medio ambiente
fr: Environnement

# Core|
source: All Files (*)
de: Alle Dateien (*)
es: Todos los archivos (*)
fr: Tous les fichiers (*)

# Core|
source: Clear Menu
de: Klare Menü
es: Claro Menú
fr: Effacer Menu

# Core|msgShowOptionsDialog
source: Configure...
de: Konfigurieren ...
fr: Configurer ...

# Core::DocumentManager|
source: File Error
de: Dateifehler
es: Error de archivo
fr: Erreur de fichier

# Core::DocumentManager|
source: Error while saving file: %1
de: Fehler beim Speichern der Datei:%1
es: Error al guardar el archivo:%1
fr: Erreur lors de la sauvegarde du fichier:%1

# Core::DocumentManager|
source: Overwrite?
de: Überschreiben?
es: Sobrescribir?
fr: Ecraser?

# Core::DocumentManager|
source: An item named '%1' already exists at this location. Do you want to overwrite it?
de: Ein Element mit dem Namen '%1' ist bereits vorhanden an diesem Ort. Möchten Sie sie überschreiben?
es: Un artículo llamado '%1' ya existe en este lugar. Quieres sobreescribirlo?
fr: Un élément nommé '%1' existe déjà à cet emplacement. Voulez-vous le remplacer?

# Core::DocumentManager|
source: Save File As
de: Datei speichern unter
es: Guardar archivo como
fr: Enregistrer le fichier sous

# Core::DocumentManager|
source: Open File
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir un fichier

# Core::DocumentManager|
source: Cannot reload %1
de: Kann nicht laden%1
es: No se puede cargar%1
fr: Vous ne pouvez pas recharger%1

# Core::DocumentModel|
source: <no document>
de: <Kein Dokument>
es: <Ningún documento>
fr: <Aucun document>

# Core::DocumentModel|
source: No document is selected.
de: Kein Dokument ausgewählt ist.
es: Se ha seleccionado ningún documento.
fr: Aucun document ne est sélectionné.

# Core::EditorManager|
source: Revert to Saved
de: Zurück zur letzten Version
es: Volver a lo guardado
fr: Version enregistrée

# Core::EditorManager|
source: Close
de: Zu Schließen
es: Cerca
fr: Près

# Core::EditorManager|
source: Close All
de: Alle schließen
es: Cerrar todo
fr: Fermer tout

# Core::EditorManager|
source: Close Others
de: Schließen Sonstiges
es: Cerrar Otros
fr: Fermer les autres

# Core::EditorManager|
source: Close All Except Visible
de: Schließen Alle außer Visible
es: Cerrar todos excepto Visible
fr: Fermer Sauf Visible Tous

# Core::EditorManager|
source: Next Open Document in History
de: Nächste Open Document in History
es: Siguiente Abrir documento en Historia
fr: Suivant Open Document dans l'Histoire

# Core::EditorManager|
source: Previous Open Document in History
de: Vorherige Open Document in History
es: Anterior Abrir documento en Historia
fr: Open Document précédent dans l'histoire

# Core::EditorManager|
source: Go Back
de: Geh Zurück
es: Volver
fr: Retourner

# Core::EditorManager|
source: Go Forward
de: Vorgehen
es: Avanzar
fr: Aller de l'avant

# Core::EditorManager|
source: Save &As...
de: Speichern Unter ...
es: Guardar y como ...
fr: Enregistrer & sous ...

# Core::EditorManager|
source: Revert File to Saved
de: Revert Datei auf Ihre Favoriten
es: Revertir archivo a Guardados
fr: Revenir à la version enregistrée Fichier

# Core::EditorManager|
source: Ctrl+Shift+W
de: Strg + Umschalt + W
fr: Ctrl + Maj + W

# Core::EditorManager|
source: Alt+Shift+Tab
de: Alt + Umschalt + Tab
fr: Alt + Maj + Tab

# Core::EditorManager|
source: Ctrl+Shift+Tab
de: Strg + Umschalt + Tab
fr: Ctrl + Maj + Tab

# Core::EditorManager|
source: Ctrl+Alt+Left
de: Strg + Alt + Links
es: Ctrl + Alt + Izquierda
fr: Ctrl + Alt + Gauche

# Core::EditorManager|
source: Alt+Left
de: Alt + Pfeil links
es: Alt + Izquierda
fr: Alt + Gauche

# Core::EditorManager|
source: Ctrl+Alt+Right
de: Strg + Alt + Rechts
es: Ctrl + Alt + Derecha
fr: Ctrl + Alt + Droite

# Core::EditorManager|
source: Alt+Right
de: Alt + Rechts
es: Alt + Derecha
fr: Alt + Droite

# Core::EditorManager|
source: Split
de: Teilt
es: División
fr: Divisé

# Core::EditorManager|
source: Split Side by Side
es: Side by Side de Split
fr: Side by Side de Split

# Core::EditorManager|
source: Open in New Window
de: In neuem Fenster öffnen
es: Abrir en ventana nueva
fr: Ouvrir dans une nouvelle fenêtre

# Core::EditorManager|
source: Remove Current Split
de: Entfernen Aktuelle Split
es: Retire actual de Split
fr: Supprimer le fractionnement actuel

# Core::EditorManager|
source: Remove All Splits
de: Alle entfernen Splits
es: Eliminar todos los Splits
fr: Retirez toutes les divisions

# Core::EditorManager|
source: Meta+E,1
fr: Meta + E, une

# Core::EditorManager|
source: Ctrl+E,1
de: Strg + E, 1
fr: Ctrl + E, une

# Core::EditorManager|
source: Go to Next Split or Window
de: Zum nächsten Split oder Fenster
es: Ir al siguiente Dividir o Ventana
fr: Aller suivants de Split ou Fenêtre

# Core::EditorManager|
source: Ad&vanced
de: Ad-Advanced
es: Anuncio y avanzado
fr: Ad & avancé

# Core::EditorManager|
source: Current document
de: Aktuelles Dokument
es: Documento actual
fr: Document actuel

# Core::EditorManager|
source: X-coordinate of the current editor's upper left corner, relative to screen.
de: X-Koordinate des aktuellen Editors linken oberen Ecke, bezogen auf Bildschirm.
es: Coordenada X de la esquina superior izquierda del editor actual, en relación a la pantalla.
fr: Coordonnée X du coin supérieur gauche de l'éditeur actuel, par rapport à l'écran.

# Core::EditorManager|
source: Y-coordinate of the current editor's upper left corner, relative to screen.
de: Y-Koordinate des aktuellen Editors linken oberen Ecke, bezogen auf Bildschirm.
es: Coordenada Y de la esquina superior izquierda del editor actual, con relación a la pantalla.
fr: Coordonnée Y du coin supérieur gauche de l'éditeur actuel, par rapport à l'écran.

# Core::EditorManager|
source: Close "%1"
de: Schließen "%1 "
es: Cerrar "%1 "
fr: Fermer "%1 "

# Core::EditorManager|
source: Close Editor
de: Schließen Editor
es: Cierre el Editor
fr: Fermez l'Éditeur

# Core::EditorManager|
source: Close All Except "%1"
de: Schließen Alle außer "%1 "
es: Cerrar todos excepto "%1 "
fr: Fermer Tout Sauf "%1 "

# Core::EditorManager|
source: Close Other Editors
de: Schließen Andere Redakteure
es: Cerrar Otros Editores
fr: Fermer les autres éditeurs

# Core::EditorManager|
source: File Error
de: Dateifehler
es: Error de archivo
fr: Erreur de fichier

# Core::EditorManager|
source: <b>Warning:</b> You are changing a read-only file.
de: <B> Achtung: </b> Sie ändern eine schreibgeschützte Datei.
es: <B> Atención: </b> Está cambiando un archivo de sólo lectura.
fr: <B> Attention: </b> Vous changez un fichier en lecture seule.

# Core::EditorManager|
source: Make Writable
de: Schreibschutz aufheben
es: Hacer escribible
fr: Assurez-inscriptible

# Core::EditorManager|
source: Save %1 &As...
de: Sparen Sie%1 & As ...
es: Ahorre%1 y como ...
fr: Économisez%1 & A ...

# Core::EditorManager|
source: Revert %1 to Saved
de: Revert%1 Ihre Favoriten
es: Revertir%1 a Guardados
fr: Revenir à la version enregistrée %1

# Core::EditorManager|
source: Reload %1
de: Neu laden%1
es: Recargar%1
fr: Recharger%1

# Core::EditorManager|
source: Close %1
de: Schließen %1
es: Cerrar %1
fr: Fermer %1

# Core::EditorManager|
source: Close All Except %1
de: Alle schließen Mit Ausnahme%1
es: Cerrar todos excepto %1
fr: Fermer Tous sauf %1

# Core::EditorManager|
source: You will lose your current changes if you proceed reverting %1.
de: Sie werden Ihre aktuellen Änderungen verlieren, wenn Sie Rückgriff%1 vorgehen.
es: Usted perderá sus cambios actuales Si continúa revirtiendo%1.
fr: Vous allez perdre vos modifications actuelles Si vous continuez de revenir%1.

# Core::EditorManager|
source: Proceed
de: Fortfahren
es: Proceder
fr: Procéder

# Core::EditorManager|
source: Cancel
de: Rückgängig Machen
es: Cancelar
fr: Annuler

# Core::FindPlugin|
source: Open Advanced Find...
de: Öffnen Erweiterte Suche ...
es: Abrir búsqueda avanzada ...
fr: Advanced Open Trouver ...

# Core::FindPlugin|
source: Advanced...
de: Erweitert ...
es: Avanzada ...
fr: Avancée ...

# Core::FindPlugin|
source: Ctrl+Shift+F
de: Strg + Umschalt + F
fr: Ctrl + Maj + F

# Core::ICore|
source: Qt Creator %%12
fr: Creator Qt%%12

# Core::ICore|
source: Based on Qt %1 (%2, %3 bit)
de: Basierend auf Qt%1 (%2%3 Bit)
es: Con base en Qt%1 (%2,%3 bits)
fr: Basé sur Qt%1 (%2,%3 bits)

# Core::IDocument|
source: File was restored from auto-saved copy. Select Save to confirm or Revert to Saved to discard changes.
de: Datei wurde von automatisch gespeicherte Kopie wiederhergestellt. Wählen Sie Speichern, um zu bestätigen, oder Zurück zur letzten Version, um Änderungen zu verwerfen.
es: El archivo se ha restaurado a partir de copia de auto-guardado. Seleccione Guardar para confirmar o Volver a lo guardado para descartar los cambios.
fr: Le fichier a été restauré à partir d'une copie de sauvegarde automatique. Sélectionnez Enregistrer pour confirmer ou Version enregistrée pour annuler les modifications.

# Core::IFindFilter|
source: Case sensitive
de: Groß- und Kleinschreibung
es: Distingue mayúsculas y minúsculas
fr: Sensible aux majuscules et minuscules

# Core::IFindFilter|
source: Whole words
de: Ganze Wörter
es: Palabras completas
fr: Mots entiers

# Core::IFindFilter|
source: Regular expressions
de: Reguläre Ausdrücke
es: Las expresiones regulares
fr: Les expressions régulières

# Core::IFindFilter|
source: Preserve case
de: Preserve Fall
es: Preservar caso
fr: Préserver la casse

# Core::IFindFilter|
source: Flags: %1
es: Banderas:%1
fr: Drapeaux:%1

# Core::IFindFilter|
source: None
de: Die Sonne Geht Auf
es: Ninguno
fr: Aucun

# Core::InfoBarDisplay|
source: Do Not Show Again
de: Nicht mehr anzeigen
es: No mostrar de nuevo
fr: Ne plus afficher

# Core::InfoBarDisplay|
source: Close
de: Zu Schließen
es: Cerca
fr: Près

# Core::Internal|
source: Launching a file browser failed
de: Starten ein Datei-Browser gescheitert
es: El lanzamiento de un explorador de archivos no
fr: Démarrage d'un navigateur de fichier a échoué

# Core::Internal|
source: Unable to start the file manager: %1
de: Kann den Datei-Manager zu starten: %1
es: No se puede iniciar el gestor de archivos: %1
fr: Impossible de démarrer le gestionnaire de fichiers: %1

# Core::Internal|
source: '%1' returned the following error: %2
de: '%1' hat folgenden Fehler: %2
es: '%1' devolvió el siguiente error: %2
fr: '%1' a renvoyé l'erreur suivante: %2

# Core::Internal|
source: Launching Windows Explorer Failed
de: Startet den Windows Explorer Fehler
es: Lanzar el Explorador de Windows Error
fr: Lancement de l'Explorateur Windows Échec

# Core::Internal|
source: Could not find explorer.exe in path to launch Windows Explorer.
de: Explorer.exe konnte nicht gefunden werden in Weg, um Windows Explorer zu starten.
es: No se pudo encontrar explorer.exe en camino de lanzar el Explorador de Windows.
fr: Impossible de trouver explorer.exe dans le chemin pour lancer l'Explorateur Windows.

# Core::Internal|
source: Find in This Directory...
de: Finden Sie in diesem Verzeichnis ...
es: Buscar en este directorio ...
fr: Trouvez dans ce répertoire ...

# Core::Internal|
source: Show in Explorer
de: Im Explorer anzeigen
es: Mostrar en el Explorador
fr: Afficher dans l'explorateur

# Core::Internal|
source: Show in Finder
de: Im Finder anzeigen
es: Mostrar en Finder
fr: Afficher dans le Finder

# Core::Internal|
source: Show Containing Folder
de: Beinhaltenden Ordner anzeigen
es: Mostrar carpeta contenedora
fr: Voir le dossier contenant

# Core::Internal|
source: Open Command Prompt Here
de: Öffnen Sie die Eingabeaufforderung hier
es: Abra Command Prompt Aquí
fr: Ouvrez invite de commandes Voici

# Core::Internal|
source: Open Terminal Here
de: Öffnen Sie das Terminal hier
es: Terminal Abrir Aquí
fr: Ouvrez Terminal ici

# Core::Internal|
source: Deleting File Failed
de: Datei löschen fehlgeschlagen
es: No se ha podido eliminar el archivo
fr: Suppression de fichier Échec

# Core::Internal|
source: Could not delete file %1.
de: Datei%1 konnte nicht gelöscht werden.
es: No se pudo borrar el archivo%1.
fr: Impossible de supprimer le fichier%1.

# Core::Internal::EditMode|
source: Edit
de: Bearbeiten
es: Editar
fr: Éditer

# Core::Internal::FindDialog|
source: &Search
es: Y Buscar
fr: & Recherche

# Core::Internal::FindDialog|
source: Search && &Replace
de: Suchen & Ersetzen &&
es: Buscar y reemplazar &&
fr: Rechercher && & Remplacer

# Core::Internal::FindDialog|
source: Sear&ch for:
de: Suche nach:
es: Buscar:
fr: Rechercher:

# Core::Internal::FindDialog|
source: Case sensiti&ve
de: Fall sensiti & ve
es: Distingue mayúsculas y minúsculas
fr: Sensible aux majuscules et minuscules

# Core::Internal::FindDialog|
source: Whole words o&nly
de: Ganze Wörter o & nly
es: Palabras completas o & ólo
fr: Mots entiers o & euls

# Core::Internal::FindDialog|
source: Use re&gular expressions
de: Verwenden Sie Wieder & eckige Ausdrücke
es: Utilice expresiones re gular y
fr: Réutilisation et gulaires expressions

# Core::Internal::FindToolBar|
source: Shift+Enter
fr: Maj + Entrée

# Core::Internal::FindToolBar|
source: Shift+Return
es: Mayús + Retorno
fr: Maj + Retour

# Core::Internal::FindToolBar|
source: Find/Replace
de: Suchen / Ersetzen
es: Buscar / Reemplazar
fr: Rechercher / Remplacer

# Core::Internal::FindToolBar|
source: Enter Find String
de: Geben Suche String
es: Ingrese Encuentra Cadena
fr: Entrez Trouver la chaîne

# Core::Internal::FindToolBar|
source: Find Next
de: Weitersuchen
es: Buscar siguiente
fr: Trouver Suivant

# Core::Internal::FindToolBar|
source: Find Previous
de: Vorheriges suchen
es: Buscar anterior
fr: Trouver précédente

# Core::Internal::FindToolBar|
source: Find Next (Selected)
de: Weitersuchen (Ausgewählt)
es: Buscar siguiente (Seleccionado)
fr: Trouver Suivant (sélectionné)

# Core::Internal::FindToolBar|
source: Find Previous (Selected)
de: Frühere suchen (Auswahl)
es: Buscar anterior (Seleccionado)
fr: Trouver précédente (sélectionné)

# Core::Internal::FindToolBar|
source: Ctrl+Shift+F3
fr: Ctrl + Maj + F3

# Core::Internal::FindToolBar|
source: Replace
de: Ersetzen
es: Reemplazar
fr: Remplacer

# Core::Internal::FindToolBar|
source: Replace && Find
de: Ersetzen && Suche
es: Reemplace && Encuentra
fr: Remplacer && Trouver

# Core::Internal::FindToolBar|
source: Replace && Find Previous
de: Ersetzen && Vorheriges suchen
es: Reemplace && Buscar anterior
fr: Remplacer && Trouver précédente

# Core::Internal::FindToolBar|
source: Replace All
de: Alle ersetzen
es: Reemplazar todo
fr: Remplacer tout

# Core::Internal::FindToolBar|
source: Case Sensitive
de: Groß- und Kleinschreibung
es: Distingue Mayúsculas Y Minúsculas
fr: Sensible Aux Majuscules Et Minuscules

# Core::Internal::FindToolBar|
source: Whole Words Only
de: Nur ganze Wörter
es: Sólo palabras completas
fr: Mots entiers seulement

# Core::Internal::FindToolBar|
source: Use Regular Expressions
de: Verwenden Sie reguläre Ausdrücke
es: Utilice expresiones regulares
fr: Utiliser des expressions régulières

# Core::Internal::FindToolBar|
source: Preserve Case when Replacing
de: Preserve Fall beim Austauschen
es: Preservar caso cuando Sustitución
fr: Préserver la casse lors du remplacement

# Core::Internal::FindWidget|
source: Find
de: Finden
es: Encontrar
fr: Trouver

# Core::Internal::FindWidget|
source: Find:
de: Suche:
es: Encontrar:
fr: Trouver:

# Core::Internal::FindWidget|
source: Replace with:
de: Ersetzen durch:
es: Reemplazar con:
fr: Remplacer par:

# Core::Internal::FindWidget|
source: Replace
de: Ersetzen
es: Reemplazar
fr: Remplacer

# Core::Internal::FindWidget|
source: Replace && Find
de: Ersetzen && Suche
es: Reemplace && Encuentra
fr: Remplacer && Trouver

# Core::Internal::FindWidget|
source: Replace All
de: Alle ersetzen
es: Reemplazar todo
fr: Remplacer tout

# Core::Internal::FindWidget|
source: Advanced...
de: Erweitert ...
es: Avanzada ...
fr: Avancée ...

# Core::Internal::MainWindow|
source: &Paste
de: & Einfügen
fr: & Collez

# Core::Internal::MainWindow|
source: Select &All
de: & Alles auswählen
es: Seleccionar & todo
fr: Sélectionnez & All

# Core::Internal::MainWindow|
source: &Go to Line...
de: Und die Linie gehen ...
es: Y vaya a la línea ...
fr: & Aller à la ligne ...

# Core::Internal::MainWindow|
source: &Options...
de: & Optionen ...
es: & Opciones ...
fr: et options ...

# Core::Internal::MainWindow|
source: Show Mode Selector
es: Mostrar selector de modo de
fr: Afficher sélecteur de mode

# Core::Internal::MainWindow|
source: Settings...
de: Einstellungen ...
es: Configuración ...
fr: Paramètres ...

# Core::Internal::OutputPaneManager|
source: Output
de: Ausgabe
es: Salida
fr: Sortie

# Core::Internal::OutputPaneManager|
source: Clear
de: Klar
es: Claro
fr: Clair

# Core::Internal::OutputPaneManager|
source: Next Item
de: Nächster Artikel
es: Siguiente artículo
fr: Prochain article

# Core::Internal::OutputPaneManager|
source: Previous Item
de: Vorheriger Artikel
es: Artículo anterior
fr: Article précédent

# Core::Internal::OutputPaneManager|
source: Maximize Output Pane
de: Maximieren Ausgabebereich
es: Maximizar Panel de salida
fr: Maximiser volet de sortie

# Core::Internal::OutputPaneManager|
source: Shift+F6
de: Umschalt + F6
fr: Maj + F6

# Core::Internal::OutputPaneManager|
source: Minimize Output Pane
de: Minimieren Ausgabebereich
es: Minimizar el Panel de salida
fr: Réduire volet de sortie

# Core::Internal::PluginDialog|
source: Details
de: Einzelheiten
es: Detalles
fr: Détails

# Core::Internal::PluginDialog|
source: Error Details
de: Fehlerdetails
es: Detalles del error
fr: Détails de l'erreur

# Core::Internal::PluginDialog|
source: Close
de: Zu Schließen
es: Cerca
fr: Près

# Core::Internal::PluginDialog|
source: Restart required.
de: Neustart erforderlich.
es: Se requiere reiniciar.
fr: Redémarrage nécessaire.

# Core::Internal::PluginDialog|
source: Installed Plugins
de: Installierte Plugins
es: Plugins instalados
fr: Plugins installés

# Core::Internal::PluginDialog|
source: Plugin Details of %1
de: Plugin Einzelheiten%1
es: Detalles Plugin de %1
fr: Détails Plugin de %1

# Core::Internal::PluginDialog|
source: Plugin Errors of %1
de: Plugin-Fehler von %1
es: Errores Plugin de %1
fr: Erreurs Plugin de %1

# Core::Internal::ProgressManagerPrivate|
source: Toggle Progress Details
de: Toggle Fortschritt Einzelheiten
es: Alternar Progreso Detalles
fr: Basculer progrès Détails

# Core::Internal::ProgressManagerPrivate|
source: Ctrl+Shift+0
de: Strg + Umschalt + 0
fr: Ctrl + Maj + 0

# Core::Internal::ProgressManagerPrivate|
source: Alt+Shift+0
de: Alt + Umschalt + 0
fr: Alt + Maj + 0

# Core::Internal::ProgressView|
source: Processes
de: Prozesse
es: Procesos
fr: Processus

# Core::Internal::SearchResultWidget|
source: Search was canceled.
de: Suche wurde abgebrochen.
es: Buscar fue cancelado.
fr: Recherche a été annulée.

# Core::Internal::SearchResultWidget|
source: Cancel
de: Rückgängig Machen
es: Cancelar
fr: Annuler

# Core::Internal::SearchResultWidget|
source: Repeat the search with same parameters.
de: Wiederholen Sie die Suche mit denselben Parametern.
es: Repita la búsqueda con los mismos parámetros.
fr: Répétez la recherche avec les mêmes paramètres.

# Core::Internal::SearchResultWidget|
source: Search again
de: Weitere Suche
es: Buscar de nuevo
fr: Recherche supplémentaire

# Core::Internal::SearchResultWidget|
source: Replace with:
de: Ersetzen durch:
es: Reemplazar con:
fr: Remplacer par:

# Core::Internal::SearchResultWidget|
source: Replace all occurrences.
de: Ersetzen Sie alle Vorkommen.
es: Reemplace todas las apariciones.
fr: Remplacer toutes les occurrences.

# Core::Internal::SearchResultWidget|
source: Replace
de: Ersetzen
es: Reemplazar
fr: Remplacer

# Core::Internal::SearchResultWidget|
source: Preserve case
de: Preserve Fall
es: Preservar caso
fr: Préserver la casse

# Core::Internal::SearchResultWidget|
source: This change cannot be undone.
de: Diese Änderung kann nicht rückgängig gemacht werden.
es: Este cambio no se puede deshacer.
fr: Ce changement ne peut être annulée.

# Core::Internal::SearchResultWidget|
source: The search resulted in more than %n items, do you still want to continue?
de: Die Suche ergab mehr als %n Artikel, wollen Sie noch weiter?
es: La búsqueda dio como resultado más de %n elementos, todavía desea continuar?
fr: La recherche a abouti à plus de %n articles, voulez-vous continuer?

# Core::Internal::SearchResultWidget|
source: Continue
de: Fortsetzen
es: Continuar
fr: Continuer

# Core::Internal::SearchResultWidget|
source: No matches found.
de: Keine Übereinstimmungen gefunden.
es: No se encontraron coincidencias.
fr: Pas de matchs trouvés.

# Core::Internal::SearchResultWidget|
source: %n matches found.
de: %n Übereinstimmungen gefunden.
es: %n se han encontrado coincidencias.
fr: %n correspondances trouvées.

# Core::Internal::SettingsDialog|
source: Preferences
de: Einstellungen
es: Preferencias
fr: Préférences

# Core::ModeManager|
source: Switch to <b>%1</b> mode
de: Wechseln Sie auf <b>%1 </b> Mode
es: Cambiar a <b>%1 </b> Modo
fr: Changer à <b>%1 </b> Mode

# Core::SearchResultWindow|
source: New Search
de: Neue Suche
es: Nueva búsqueda
fr: Nouvelle recherche

# Core::SearchResultWindow|
source: Expand All
de: Alle erweitern
es: Abre todos
fr: Développer tout

# Core::SearchResultWindow|
source: Collapse All
de: Alles
es: Contraer Todo
fr: Réduire tout

# Core::SearchResultWindow|
source: Search Results
de: Suchergebnisse
es: Resultados de la búsqueda
fr: Résultats de la recherche

# Core::VariableManager|
source: %1: Full path including file name.
de: %1: Vollständiger Pfad einschließlich Dateinamen.
es: %1: Ruta completa incluyendo nombre de archivo.
fr: %1: chemin complet, y compris le nom du fichier.

# Core::VariableManager|
source: %1: Full path excluding file name.
de: %1: Vollständiger Pfad ohne Dateinamen.
es: %1: Ruta completa exclusión de nombre de archivo.
fr: %1: Chemin complet exclusion nom de fichier.

# Core::VariableManager|
source: %1: File name without path.
de: %1: Dateiname ohne Pfad.
es: %1: nombre del archivo sin ruta.
fr: %1: Nom du fichier sans le chemin.

# Core::VariableManager|
source: %1: File base name without path and suffix.
de: %1: Archivieren Basisnamen ohne Pfad und Suffix.
es: %1: Nombre de archivo base sin ruta y sufijo.
fr: %1: Nom du fichier base sans chemin et suffixe.

# CppQmlTypesLoader|
source: %1 seems not to be encoded in UTF8 or has a BOM.
de: %1 scheint in UTF8 nicht kodiert werden oder eine Stückliste.
es: %1 no parece ser codificados en UTF8 o tiene una lista de materiales.
fr: %1 ne semble pas être codé en UTF8 ou a une nomenclature.

# ExtensionSystem::Internal::PluginDetailsView|
source: Name:
es: Nombre:
fr: Nom:

# ExtensionSystem::Internal::PluginDetailsView|
source: Compatibility version:
de: Kompatibilität Version:
es: Versión Compatibilidad:
fr: version Compatibilité:

# ExtensionSystem::Internal::PluginDetailsView|
source: Dependencies:
de: Abhängigkeiten:
es: Dependencias:
fr: Dépendances:

# ExtensionSystem::Internal::PluginDetailsView|
source: Vendor:
de: Lieferant:
es: Proveedor:
fr: Vendeur:

# ExtensionSystem::Internal::PluginDetailsView|
source: Location:
de: Wohnort:
es: Ubicación:
fr: Localisation:

# ExtensionSystem::Internal::PluginDetailsView|
source: Platforms:
de: Plattformen:
es: Plataformas:
fr: Plates-formes:

# ExtensionSystem::Internal::PluginDetailsView|
source: Group:
de: Gruppen:
es: Grupo:
fr: Groupe:

# ExtensionSystem::Internal::PluginDetailsView|
source: License:
de: Lizenz:
es: Licencia:
fr: Licence:

# ExtensionSystem::Internal::PluginErrorOverview|
source: Qt Creator - Plugin loader messages
de: Qt Creator - Plugin Loader Nachrichten
es: Qt Creator - mensajes cargador de plugin
fr: Qt Creator - Plugin messages de chargeur
